{
  "job": {
    "title": "Sr. Software Engineer-Product Development",
    "industry": "Financial Services",
    "description": "If you are a Sr. Software Engineer-Product Development with experience, please read on!\nWe are an exciting company in the FinTech space, providing innovative sales and regulatory automation solutions to financial and insurance industries. Our product suite offers our customers accurate tools to automate and accelerate the sales process for agents, advisors, and their customers. We are restructuring the way insurance, retirement, and investment products are marketed, sold, bought, delivered, and managed. Our mission is to make the complex simple and be the leading industry partner our customers can count on.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a St. Software Engineer-Product Development with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nJustine.Jolley@CyberCoders.com\nJustine Jolley - Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:33:00.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Colorado Springs",
    "region": "CO",
    "postal_code": "80908",
    "street_address": null,
    "latitude": 38.835224,
    "longitude": -104.8198
  }
}