{
  "job": {
    "title": "Data Scientist, Search Modeling",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Who are we looking for\nWe are looking for a Data Scientist, Search Modeling to join the Search Sciences Team at Nike is a rapidly growing data science and machine learning team specializing in building the core models to power search on Nike.com and in the Nike app. Search at Nike covers both the traditional search space of query intent, ranking, etc, and also covers the emerging ability of ML to help with inventory management. Models in this space provide a portal into Nike’s portfolio for Athletes* in dozens of countries and subsequently generate billions of dollars in revenue. Efficiency improvements in more accurate search for customers and better aligned inventory to meet customer demand will have a substantial impact across the business. The opportunity to improve Nike’s current search functionality for customers and link insights back to the supply chain is vast. To move quickly and thoughtfully, this team will balance off the shelf solutions with custom model development and develop a framework for balancing the multiple objectives of search. This team has openings for senior and junior roles in Search Modeling, Search Measurement, and Search Integration.\nWhat will you work on\nIn this role, you will…\nWhat you bring",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T20:21:28.000Z"
  },
  "company": {
    "name": "Nike",
    "link": "https://www.linkedin.com/company/nike"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Beaverton",
    "region": "OR",
    "postal_code": "97007",
    "street_address": null,
    "latitude": 45.486595,
    "longitude": -122.795616
  }
}