{
  "job": {
    "title": "Software Engineer (New York)",
    "industry": "",
    "description": "At Debtsy, we work to ensure that borrowers who fall behind on debt are treated with dignity. Owing to outdated processes and bad actors, traditional debt collection is rife with harassment and fraud. Our products tackle this by helping financial institutions modernize collections, giving borrowers simpler and more compassionate ways to get back on track.\nWe’ve grown over 10x accounts over the past six months. Because of the pandemic, there’s never been a more important time for our mission. But this is only scratching the surface—we think there’s more ways to solve this problem than our existing offerings. We want you to play a pivotal role in building those products.\nEngineers at Debtsy aren’t just responsible for writing code. You'll also own product and team outcomes, advocate for customers, and help other engineers grow.\nAs the company grows, you may also be involved in scoping, architecting, and implementing new product lines. You’ll have the opportunity to build new lines of business from scratch.\nTo learn more about what it’s like to work with us, check out our Glassdoor reviews. We think our track record speaks best.\nDebtsy is an equal opportunity employer and does not discriminate on the basis of race, color, creed, ethnicity, sex, gender identity, sexual orientation, religion, disability, age, veteran status, or any other category protected by law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T20:01:26.000Z"
  },
  "company": {
    "name": "Debtsy",
    "link": "https://www.linkedin.com/company/debtsy"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}