{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services",
    "description": "&lt;p&gt;Company Name: Mindtree&amp;nbsp;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Role:- Site Reliability Engineer&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Location:- Bellevue, WA&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Duration:- Fulltime&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Duties and responsibilities &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;As a Site Reliability Engineer, you will be &lt;/p&gt;&lt;p&gt;• Plan and Manage the existing environment issue, high priority call, , patch and security compliance and monitoring. • Collaborate with Engineering team, partner and customers. SKILLS • IT experience in Administrator Role with at least 4 + years in Windows and Azure Application Engineering and Resource Management. • MS Azure Certified Professional (Preferred) • Azure (IaaS and PaaS) experience in managing configuration for Azure cloud-based Application Development and Implementation • Well Versed in ARM Templates, Azure AD, App Service Plans, App Services, Function App, and Kubernetes. • Experienced with Azure PaaS Configuration and Administration of Azure Resources. • Strong understanding of commonly used Azure PaaS Services viz. SQL PaaS, Azure Functions, Web Jobs, Bots, Redis, ServiceBus etc. • Knowledge and working Experience with Azure SDK / API experience, Azure Key Vault and Azure Storage. • Experience with Application Code Deployment and Configuration on Azure Environment. • Knowledge and working Experience with IIS error code and debugging. • Knowledge and working experience with SQL Administration and Query language. • Analytical and problem-solving skills with Code Debugging experience in Azure PaaS Hosted Environment. • Knowledge and experience with working on PowerShell, python, JSON, XML or similar scripting language. • Experienced with VM Build &amp;amp; Management from VHD, establishes policy and ability to create policy. • Experience on process of Incident/Change/Problem management. • Hand on experience on handling high priority Incident and troubleshooting. • Responsible to implement automation where needed, create/improving on monitoring strategies, and maintenance and optimization of azure based infrastructure. • Be the point of escalation for troubleshooting and remediating Azure cloud issues. • Hands-on client project support, minimizing service outages, supervise and produce reports/documentation for issue tracking. • Create and manage best practice documents and procedures to provide uniform, compliant cloud environment for production implementation, Update Knowledge base and Standard Operating Procedures&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Mindtree Equal Employment Opportunity Policy&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Mindtree provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why work with us:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;·&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Recognized for our employee learning and talent development&lt;/p&gt;&lt;p&gt;·&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Encourages a good work-life-balance&lt;/p&gt;&lt;p&gt;·&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Values recognition as a cornerstone of our culture&lt;/p&gt;&lt;p&gt;·&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Driven by values and leadership &lt;/p&gt;&lt;p&gt;Mindtree [NSE: MINDTREE] is a global technology consulting and services company, helping enterprises marry scale with agility to achieve competitive advantage. “Born digital,” in 1999 and now a Larsen &amp;amp; Toubro Group Company, Mindtree applies its deep domain knowledge to 300+ enterprise client engagements to break down silos, make sense of digital complexity and bring new initiatives to market faster. We enable IT to move at the speed of business, leveraging emerging technologies and the efficiencies of Continuous Delivery to spur business innovation. Operating in 18 countries and over 40 offices across the world, we’re consistently regarded as one of the best places to work, embodied every day by our winning culture made up of over 21,000 entrepreneurial, collaborative and dedicated “Mindtree Minds.”&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Industry&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Information Technology and Services&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Employment Type&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Full-time / Contract &lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T19:16:56.000Z"
  },
  "company": {
    "name": "Mindtree",
    "link": "https://in.linkedin.com/company/mindtreeltd"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}