{
  "job": {
    "title": "Data Analyst II",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "The Data Analyst 2 position is responsible for advancing our data environment via creating and maintaining database objects, data models, and end-user reports, with an emphasis on helping to advance the self-service reporting environment. The position can also be responsible for investigating business processes, to determine how to best answer questions given – as well as suggest questions that may not have been initially asked. At times, the position will include investigative efforts, which require reaching out to various other members of the organization.\nFLEETCOR Technologies, Inc. (“FLEETCOR”) is a leading global provider of business payment solutions. We help companies of all sizes control, simplify and secure payment of various domestic and cross-border payables using specialized payment products. We serve businesses, partners, merchants, consumers and payment networks in North America, Latin America, Europe, and Asia Pacific.\nOur payment solutions provide our customers with a payment method designed to be superior to and more robust and effective than what they use currently, whether they use a competitor’s product or another alternative method such as cash or check. We group our payment solutions into five primary categories: Fuel, Lodging, Tolls, Corporate Payments and Gift. Each category is unique in its focus, customer base and target markets, but they also share a number of characteristics: customers are primarily businesses, have recurring revenue models, have specialized networks which create barriers to entry, have high margins, and have similar selling systems.\nDespite many advances in our industry, the majority of business payments are still made with outdated and inferior payment methods, such as checks and cash. We envision a business world where every purchase is controlled, every payment is digital, and every payment-related decision is well-informed. In this future paperless state, payments will require little to no time to manage, leaving companies with more time for what matters most: activities that grow their businesses.\nFLEETCOR’s mission is to provide businesses with a better way to pay, by replacing outdated payment methods such as checks and cash, and displacing the incumbent providers of those methods. Through the digitalization of payments, we create and support robust ecosystems which benefit all participating constituents: payment-making customers, payment-accepting merchants, tax-collecting governments, and FLEETCOR.\nFLEETCOR is a growth company, and we employ a simple three-prong strategy for growing our business:\nFor our customers, these product extensions reduce payment friction, saving them time and operational headaches. For FLEETCOR, these product extensions can increase our share of wallet with existing customers and can increase our products’ appeal and applicability to previously-unserved customer segments (e.g., non-toll urban dwellers). We also create new product offerings, developed internally or in conjunction with partners, to cross-sell to our existing customer base.\nTogether we can foster true belonging.We know different ideas, perspectives and backgrounds lead to better innovation and results.\nEmbracing diversity enables our people to “make the difference” at FLEETCOR.\nFLEETCOR’s culture reflects our history of fast growth and our continued drive for results.\nThese values guide all of our employees and are infused in all aspects of our Company. We are, as a team, united through these shared values and our mission to provide “a better way to pay.”\nOur values foster an inclusive culture through the expectation that all employees will treat each other with respect and appreciate the diversity of identities, thoughts, backgrounds and styles. Our commitment to fostering an inclusive culture has never been more essential than in this moment of national reflection.We must always celebrate the diversity of our company and our communities.\nWe strongly believe that the quality and diversity of our workforce provide FLEETCOR with a competitive advantage, and that our problem-solving and solution-building efforts are greatly enhanced when we harness the collective thinking of a diverse group of people with unique experiences and perspectives.\nDue to COVID-19, most of our employees are temporarily working from home. In addition, FLEETCOR implemented a virtual interviewing and hiring process, engaging with talent by phone or video and onboarding new employees remotely. We value the safety of each member of our community because we know we’re all in this together.\nFLEETCOR is an Equal Opportunity Employer. FLEETCOR provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law.If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.\nFor more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency .\nApply Now",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:19:11.000Z"
  },
  "company": {
    "name": "FLEETCOR",
    "link": "https://www.linkedin.com/company/fleetcor"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Beaverton",
    "region": "OR",
    "postal_code": "97007",
    "street_address": null,
    "latitude": 45.486595,
    "longitude": -122.795616
  }
}