{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Chewy is looking for a\nor\nor\nwith a background in marketing measurement to join the Measurement Science team at Chewy. The team is committed to developing data-drive solutions, advancing measurement capabilities, building optimization frameworks, establishing best practices, and identifying growth opportunities across marketing channels, using methodologies such as marketing mix modeling (MMM), testing / experimentation, attribution, causal Inference, forecasting, 3rd party solutions, etc.\nAs we grow the Measurement Science function within the Marketing Science & Operations team and set up various capabilities from ground up, you will have the opportunity to operate or lead as a full-stack data scientist. In that capacity, you will have the opportunity to develop backend modeling frameworks, solve business problems, design experiments, build pipelines to streamline model development, partner with media partners and 3rd-party vendors to identify and implement new capabilities and best measurement practices, etc. For such efforts, you have chance to work closely with business partners, Analytics, Product and Tech teams, as well as external parties.\nCommitted to value-creation, you will work with marketing and finance stakeholders as a thought partner and guide them in their decision-making process using data and models as your north star. You will develop models and deliver insights to drastically improve how we plan and optimize our marketing efforts, drive budget allocation and spend optimization to maximize the overall value for Chewy, and identify areas and opportunities to grow our business through data and learning. Supporting company’s growth agendas with speed and accuracy, you will also have the opportunity to lead the design of experiments across marketing channels and platforms.\nChewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members.\nIf you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at Chewy, please contact HR at chewy dot com\nTo access Chewy’s Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here: https://www.chewy.com/app/content/privacy).",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T11:17:17.000Z"
  },
  "company": {
    "name": "Chewy",
    "link": "https://www.linkedin.com/company/chewy-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Dania",
    "region": "FL",
    "postal_code": "33004",
    "street_address": null,
    "latitude": 26.055845,
    "longitude": -80.14377
  }
}