{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "At Urbint, our mission is to make communities more resilient. We do this by pairing external data with artificial intelligence to identify areas of high risk and prevent catastrophic loss for utilities and infrastructure operators across the country. We are a team of close-knit engineers, entrepreneurs, and data geeks who obsess over problem-solving, new technologies, and making a positive impact in our communities.\nWe encourage people from underrepresented groups to apply.\nAt Urbint, the Machine Learning team does not work on making consumers spend more or on maximizing clicks. That is all fine; we work on reducing carbon emissions, reducing infrastructure risk and avoiding fatalities. We find meaning and excitement solving these problems, and we hope you do, too.\nWe are looking for a Data Scientist (level 1 or level 2) to join our high visibility, high impact Machine Learning team to help with this mission. The ML team collaborates with a diverse, broader-mission team to deliver value for our customers. Members of the Machine Learning team have the option to major/minor in areas from a large data science specialization spectrum: Technical Product Management, People Management, Data Story-Telling, Applied ML, ML Research, AutoML (Algo/Performance) and MLOps (DE, SRE). This is a great role for someone who enjoys variety and is also looking to expand their skill set in a structured fashion.\nWe're an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-13T01:28:42.000Z"
  },
  "company": {
    "name": "Urbint",
    "link": "https://www.linkedin.com/company/urbint"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 91900,
    "max_value": 199900,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}