{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Banking,Financial Services",
    "description": "This role will be responsible for the Process Automation Machine Learning new technology implementation working with project teams — defining the defining the problem statement and building solutions, sourcing them from other internal teams or external options. Following are the additional responsibilities –\nAt Barclays, each day is about being more – as a professional, and as a person. ‘Be More @ Barclays’ represents our core promise to all current and future employees. It’s the characteristic that we want to be associated with as an employer, and at the heart of every employee experience. We empower our colleagues to Be More Globally Connected, working on international projects that improve the way millions of customers handle their finances. Be More Inspired by working alongside the most talented people in the industry, and delivering imaginative new solutions that are redefining the future of finance. Be More Impactful by having the opportunity to work on cutting-edge projects, and Be More Valued for who you are.\nInterested and want to know more about Barclays? Visit home.barclays/who-we-are/ for more details.\nEverything we do is shaped by the five values of Respect, Integrity, Service, Excellence and Stewardship. Our values inform the foundations of our relationships with customers and clients, but they also shape how we measure and reward the performance of our colleagues. Simply put, success is not just about what you achieve, but about how you achieve it.\nWe aim to foster a culture where individuals of all backgrounds feel confident in bringing their whole selves to work, feel included and their talents are nurtured, empowering them to contribute fully to our vision and goals.\nOur customers are unique. The same goes for our colleagues. That's why at Barclays we offer a range of benefits, allowing every colleague to choose the best options for their personal circumstances. These include a competitive salary and pension, health care and all the tools, technology and support to help you become the very best you can be. We are proud of our dynamic working options for colleagues. If you have a need for flexibility, then please discuss this with us.\n90250590",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:16:55.000Z"
  },
  "company": {
    "name": "Barclays",
    "link": "https://uk.linkedin.com/company/barclays-bank"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "IN",
    "locality": "Pune",
    "region": null,
    "postal_code": "413115",
    "street_address": null,
    "latitude": 18.528904,
    "longitude": 73.87435
  }
}