{
  "job": {
    "title": "Sr. Tech Lead Software Engineer",
    "industry": "Consumer Goods",
    "description": "Job Title: Lead Software Engineer\nSalary: $130-180K Total comp (this includes a 7-10% bonus)\nLocation: Onsite San Diego or Tuscon with relocation provided if necessary\nWhat You Will Be Doing\nThe Sr. Tech Lead Software Engineer will be for our growing mobile application and server team and will focus on the continued expansion of cloud services and related technologies to guide us into the future of internet-connected home automation systems. Your day to day activities will include tracking current development tasks internal and external as well as identifying upcoming requests and converting requirements into detailed specifications for implementation.\nWhat You Need for this Position\nSo, if you are a Lead Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nAshley.Upchurch@CyberCoders.com\nAshley Upchurch - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:18:29.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Tucson",
    "region": "AZ",
    "postal_code": "85708",
    "street_address": null,
    "latitude": 32.221878,
    "longitude": -110.97122
  }
}