{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "The ideal candidate will have e xperience with Kubernetes, Docker, Go, and Python to help build Workiva's Continuous Integration/Continuous Development (CI/CD) product features, products or systems from beginning to end.\nThe Software Engineer under Platform Operations will own well-defined Continuous Integration/Continuous Development (CI/CD) product features, products or systems from beginning to end.\nEducation\nTravel Requirements\nWorking Conditions & Physical Requirements\nThe base pay range represents the low and high end of the hiring range for this job. Actual pay will vary and may be above or below the range based on various factors including but not limited to relevant skills, experience, and capabilities.\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created.\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems.\nwww.linkedin.com/showcase/workiva-life-and-careers/\nhttps://www.linkedin.com/company/workiva/\nhttps://www.workiva.com/careers/benefits\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation. Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email\n.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T07:45:57.000Z"
  },
  "company": {
    "name": "Workiva",
    "link": "https://www.linkedin.com/company/workiva"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}