{
  "job": {
    "title": "Software Engineer I",
    "industry": "Information Technology and Services,Computer Software,Logistics and Supply Chain",
    "description": "Join a team recognized for leadership, innovation and diversity\nThe future is what you make it.\nWhen you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future.\nThat means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars.\nWorking at Honeywell isn’t just about developing cool things. That’s why all of our employees enjoy access to dynamic career opportunities across different fields and industries.\nAre you ready to help us make the future?\nHoneywell Intelligrated is a leading North American-based, single-source provider of intelligent automated material handling solutions that drive fulfillment productivity for retailers, manufacturers and logistics providers around the world. Through a broad portfolio of automation equipment, software, service and support, Intelligrated solutions give businesses a competitive edge and optimize operational performance through increased flexibility, efficiency and accuracy.\nHoneywell Intelligrated is seeking a Software Engineer to join our growing team based out of the West Chester OH office.\nA Software Engineer at Honeywell Intelligrated is passionate about automated control systems, a self-motivated professional, and strives to be at the leading edge of control system technology. Honeywell Intelligrated Software Engineer will work with experienced software engineers to learn, understand and implement complex automated control systems. You will be part of a group of highly committed professionals who provide expertise and ensure the success of engineering projects\nKey Responsibilities\nAbility to travel up to 40%, work nights and/or weekends\nYOU MUST HAVE\nWE VALUE\n#CB #INDEED\nAdditional Information\nCustomer Experience (GLOBAL)\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-22T07:16:02.000Z"
  },
  "company": {
    "name": "Honeywell",
    "link": "https://www.linkedin.com/company/honeywell"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Mason",
    "region": "OH",
    "postal_code": "45040",
    "street_address": null,
    "latitude": 39.360252,
    "longitude": -84.309105
  }
}