{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Are you passionate about Data? Are you excited by the opportunity to build a beloved B2B brand? Do you want to have a significant impact at a high-growth startup?\nAt OpenPhone, building simple and delightful experiences is not only our competitive advantage but a value we hold dear. This philosophy applies to everything we do; from the way we work to the look and feel of our product, from the infrastructure it’s running on to our content, customer interactions, and everything else.\nAs our first Data Scientist at OpenPhone, you'll have the opportunity to dive into large datasets to guide decision-making. We tackle a wide range of exciting challenges including sales forecasting, lead scoring, operational optimization, product launches and more. If you're someone who enjoys finding patterns, speaking through data, and has experience using analytics to impact revenue, growth, and operations, we're looking for someone like you!\nThere's no such thing as a 'perfect' candidate. We're looking for an optimist with grit and determination, who is excited to face the challenges of a growing startup. OpenPhone is the type of company where you can grow, and we encourage you to apply to us even if you don't 100% match the exact candidate description.\nOpenPhone is a new type of business phone. Our mission is to help people communicate better and be more productive.\nWe’re backed by Y Combinator and the best venture firms including Craft Ventures, Slow Ventures, Kindred Ventures, and others. We're serving thousands of businesses around the world and growing quickly. We take a lot of pride in providing an exceptional customer experience and a product people love. Our customers rated us #1 on all possible categories on G2 Crowd.\nWe're a distributed team working from San Francisco, Seattle, Ottawa, Moscow, Manila, Phoenix, and Sydney.\nWe are committed to creating an inclusive workplace that values diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T17:10:47.000Z"
  },
  "company": {
    "name": "OpenPhone",
    "link": "https://www.linkedin.com/company/openphone"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}