{
  "job": {
    "title": "Software Engineer, Apple Pay",
    "industry": "Consumer Electronics",
    "description": "Apple Pay Server Engineering is the place to be if you are interested in working on awesome technology that is used by millions of people every single day! As part of the Apple Pay Server Engineering team, you will have the opportunity to explore and contribute to a wide variety of interesting projects within Apple Pay. If you meet the key qualifications and you are self-driven, enthusiastic, highly motivated, and you want to make an impact, we'd love to hear from you!\nMinimum 4+ years relevant industry experience\nExperience writing server software in Java or C/C++ or C#\nExperience/Knowledge working on highly scalable applications and RESTful web services\nKnowledge of databases both SQL and NoSQL\nFamiliarity with scalability and performance issues\nUnderstand software development process from inception to delivery of code to production\nStrong Computer Science background\nExperience/understanding of security and cryptography (not mandatory)\n- Responsible for designing and developing highly reliable, scalable server platforms with attention to detail\n- Follow our software development process including writing unit tests, perform code reviews etc. - Ability to learn and apply new technologies quickly\n- Work effectively with cross-functional teams to develop features\n- Provide support for production deployments\n- Demonstrate ability to deliver results on time with high quality\nBachelor in Computer Science or equivalent\nRole Number: 200284886",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-14T05:22:01.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 75600,
    "max_value": 160000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}