{
  "job": {
    "title": "Software Engineer, Machine Learning",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "At Lyft, our mission is to improve people’s lives with the world’s best transportation. To do this, we start with our own community by creating an open, inclusive, and diverse organization.\nData and Machine Learning are at the heart of Lyft’s products and decision-making. As a member of the Data Science and Machine Learning team, you will work in a dynamic environment, where we embrace moving quickly to build the world’s best transportation. Machine learning engineers build algorithms that make our internal and external products responsive, personalized and powerful. We’re looking for passionate, driven engineers to take on some of the most interesting and impactful problems in ridesharing.\nAs a machine learning engineer, you will be developing and implementing mathematical models underpinning the platform’s core services. Compared to other technology companies of a similar size, the set of problems that we tackle is incredibly diverse. They cut across optimization, personalization, adaptive modeling, transportation, and mapping. We are hiring motivated experts in each of these fields. We’re looking for someone who is passionate about solving problems with data, building reliable machine learning systems, and are excited about working in a fast-paced, innovative and collegial environment.\nYou will report to a Software Engineering Machine Learning Manager.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T23:17:25.000Z"
  },
  "company": {
    "name": "Lyft",
    "link": "https://www.linkedin.com/company/lyft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 130000,
    "max_value": 194000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}