{
  "job": {
    "title": "Data Engineer II",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "The ideal candidate will be a well-rounded technologist with a passion for building innovative business\nsolutions with big data and Java technologies. Experience delivering big data solutions – from system\nsetup to development to business solution delivery – is critical. Programming experience is also\nparamount. Senior Data Engineer should be keeping up with the latest developments and should be\nable to connect technical capability with business need.\n\nDesign analytic solutions for business users that provide the data needed to operate the\nbusiness\n\nBuild data integration solutions that process mid-large volume transactions in real time and in\nbatch using big data and Java technologies\n\nYou will be responsible for design, development, delivery and support of large-scale, data flows\nand tools.\n\n\nBS in Computer Science, Mathematics, Engineering, or Information Technology\n\n5 – 6 years of experience working with data warehouses (Vertica preferred)\n\n5 – 6 years of experience writing software in any of the following programming language (Java,\nPython)\n\nExperience performing analytics to solve complex business problems\n\n4 - 5 years of experience integrating data between operational databases using data\nintegration tools like AWS ETL technologies (preferred), Informatica, Datastage or SSIS.\n\nExpert level knowledge of data integration and familiarity with common data integration\nchallenges like converting data types, handling errors, and translating between different\ntechnology stacks\n\nSQL expertise and the ability to work with many different database types including Postgres,\n\nAble to work independently, own the requirements and deliverables, and produce an ETL\nsolution end to end successfully\n\nAble to work in a fast-paced environment and be comfortable being accountable for work\nproducts\n\nExperience designing analytic solutions in Vertica\n\nExperience with AWS\n\nJava front and backend\n\nExperience in ecommerce or large volume transactional systems\n\nExperience with statistical methods and operations research techniques such as linear\nprogramming\nIf you have a disability under the Americans with Disabilities Act or similar law, or you require a\nreligious accommodation, and you wish to discuss potential accommodations related to applying for\nemployment at our company, please contact HR@\nChewy.com\nTo access Chewy’s Privacy Policy, which contains information regarding information collected from\nChewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members.\nIf you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at Chewy, please contact\n.\nTo access Chewy’s Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here: https://www.chewy.com/app/content/privacy).",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T22:31:10.000Z"
  },
  "company": {
    "name": "Chewy",
    "link": "https://www.linkedin.com/company/chewy-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}