{
  "job": {
    "title": "Site Reliability Engineer (Remote Europe)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Who We Are\nElement is the startup that employs the core team behind matrix.org — the leading project for secure, open decentralised communication.\nMatrix’s mission is to make messaging as open as email — allowing everyone to choose where their data is hosted, enjoy private conversations thanks to advanced encryption, and ultimately be in control of their own communication.\nMatrix powers our flagship messaging apps for the web, iOS & Android, along with Element Matrix Services, our SaaS platform for personal & professional use.\nWe build things for everyone, and we know we can’t succeed without a diverse team. Our hiring process is designed to give candidates the best chance to show us what you can do. If we ever fall down on this, please let us know.\nWe are a small team today of five engineers working hard at transforming how operations and infrastructure is done within the organisation. We come from various backgrounds and are today a remote-first team with all of us working from different countries across Europe and the UK.\nAs part of our day-to-day operations, we use or touch on (in no particular order) AWS, UpCloud, Postgres, Grafana, Prometheus, Loki, Elasticsearch, PagerDuty, Python, AWS EKS, Red Hat OpenShift, GitLab, GitHub, Ansible, AWX, Terraform, Keycloak, Linux, Containers, Golang, HAProxy, Nginx to name a few.\nWe are presently in the process of working towards our tomorrow. And we want to bring more team members along for this journey. We want to work with collaborative and kind people who do not mind experimenting with the unknown.\nOur general approach is to treat people like adults and acknowledge that by being flexible we create an environment for people to do their best work. For more details here is our manifesto. That said specific points that differentiate us.\nElement does not discriminate on the basis of race, sex, colour, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T06:19:40.000Z"
  },
  "company": {
    "name": "Element",
    "link": "https://uk.linkedin.com/company/element-hq"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "United States",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 42.93923,
    "longitude": -75.62005
  }
}