{
  "job": {
    "title": "Data Scientist - Listening Experience Insights",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Daily Mix to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them.\nWe are looking for an enterprising Data Scientist professional who is passionate about using data to understand human behavior, translating those insights into meaningful experiences. You have a keen mind for product and the analytical and statistical skills to develop and deliver the insights that drive teams toward impactful solutions. You thrive in highly collaborative environments, working alongside User Research, Product, Design, and Engineering.\nSpotify is an equal opportunity employer. You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what’s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It’s in our differences that we will find the power to keep revolutionizing the way the world listens.\nSpotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world’s most popular audio streaming subscription service with a community of more than 345 million users.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-16T21:25:11.000Z"
  },
  "company": {
    "name": "Spotify",
    "link": "https://se.linkedin.com/company/spotify"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 116000,
    "max_value": 149000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}