{
  "job": {
    "title": "Sr. Software Engineer - AI Platform",
    "industry": "Computer Software,Consumer Services,Information Technology and Services",
    "description": "Engages with stakeholders across teams to lead the development and maintenance of backend services and solutions to support user-facing products, downstream services, or infrastructure tools and platforms used across Uber.\nAt Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world!\nWe welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have a curiosity, passion and collaborative spirit, work with us, and let’s move the world forward, together!\nUber is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\nIf you have a disability or special need that requires accommodation, please let us know by completing this form.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T22:04:00.000Z"
  },
  "company": {
    "name": "Uber",
    "link": "https://www.linkedin.com/company/uber-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": "USD",
    "min_value": 167000,
    "max_value": 225000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}