{
  "job": {
    "title": "Software Engineer (Infrastructure) - AfroTech Conference",
    "industry": "Internet,Information Technology and Services",
    "description": "To be considered for the AfroTech Conference sponsorship applicants must pass the Technical Screen.\nVirtual onsite interviews for the position below will be conducted pursuant to our participation in the\nAfroTech Conference.\nIf you are interested in a Software Engineer (Applications) role at LinkedIn but are not registered for the\nabove event, please apply here https://careers.linkedin.com/Teams/Engineering\nLinkedIn was built to help professionals achieve more in their careers, and every day millions of people\nuse our products to make connections, discover opportunities and gain insights. Our global reach means\nwe get to make a direct impact on the world’s workforce in ways no other company can. We are much\nmore than a digital resume – we transform lives through innovative products and technology.\nCreating economic opportunities for every member of the global workforce is a responsibility we all share.\nTo truly transform the global economy, we must evolve the way we hire and enable our talent to serve\npeople of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is\nproud to be an equal opportunity employer.\nAs part of our world-class software engineering team, you will be charged with building the\nnext-generation infrastructure platforms for LinkedIn — including but not limited to: an application and\nservice delivery platform, massively scalable data storage and replication systems, and a cutting-edge\nsearch platform. You will work and learn among the best, putting to use your experience in distributed\ntechnologies and algorithms, your great API and systems-design sensibilities, and your passion for writing\ncode that performs at an extreme scale. LinkedIn has already pioneered well-known open-source data\ninfrastructure projects like Voldemort, Kafka, and Azkaban – come join our Data team and share the\nknowledge with a broader community while making a real impact within our company.\nResponsibilities:\nThe ideal candidate will help scale LinkedIn's infrastructure to handle massive growth in\nmembership, traffic, and data as we continue to experience dramatic growth in the usage of\nour products with a focus in one or more of the areas below:\n• Data Infrastructure: A focus on building and supporting large scale systems and tools that\nenable the generation of insights and data products on all of LinkedIn's internal and external\ndata via self-serve computing, reporting solutions, and interactive querying.\n• Search, Networks and Analytics: Build and operate the platform that powers all of search at\nLinkedIn—responding to thousands of queries per second with target latencies in tens of\nmilliseconds. The goal is to provide and run in 24/7 production environment a platform that\nenables search quality engineers to rapidly innovate, experiment, and improve relevance—\nwhile at the same time remaining constantly available and performant to our users.\n• Service: Provide the technical platform for all of LinkedIn Engineering to build services,\nwhich are the essential unit of development and deployment.\n• Relevance Infrastructure: Deliver the systems and algorithms that generate and serve feeds\nof professionally relevant activities and content.\nBasic Qualifications:\n• B.S. in Computer Science or related technical discipline, or related practical experience.\n• Relevant programming experience\nPreferred Qualifications:\n• 2 + years of relevant work experience\n• MS or PhD in Computer Science or related technical discipline\n• Experience building distributed, Internet-scale systems.\n• Experience building and applying frameworks for one or more of the following: caching,\nqueuing, RPC, parallelism, and/or distributed knowledge.\n• Thorough knowledge of multi-threading, concurrency, and parallel processing technologies.\n• Experience with industry, open-source projects, and/or academic research in large-data,\nparallel, and distributed systems.\n• Published work in academic conferences or industry circles.\nYou will Benefit from our Culture:\nWe strongly believe in the well-being of our employees and their families. That is why we offer generous\nhealth and wellness programs and time away for employees of all levels\nEqual Opportunity Statement\nLinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.\nLinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.\nIf you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.\nReasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:\n-Documents in alternate formats or read aloud to you\n-Having interviews in an accessible location\n-Being accompanied by a service dog\n-Having a sign language interpreter present for the interview\nA request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.\nLinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.\nPay Transparency Policy Statement\nAs a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.\nGlobal Data Privacy Notice for Job Candidates\nThis document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:45:51.000Z"
  },
  "company": {
    "name": "LinkedIn",
    "link": "https://www.linkedin.com/company/linkedin"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Sunnyvale",
    "region": "CA",
    "postal_code": "94085",
    "street_address": null,
    "latitude": 37.389164,
    "longitude": -122.01792
  }
}