{
  "job": {
    "title": "Data Scientist",
    "industry": "Insurance,Research",
    "description": "The Research, Analytics and Development team has a great opportunity for a\n. As a Data Scientist, you will serve as a technical and thought leader on this diverse and highly skilled team. You will design and develop inventive solutions to drive innovation and delivery of organizational value. You’ll analyze large datasets to further develop underwriting, marketing, claims, application and product optimization. You’ll work in a highly collaborative, team environment, and collaborating with multiple stakeholders. You will assist management in the communication of insights and the implementation of impactful data science solutions across the organization. The successful candidate leads the research of new business concepts, new products, new technologies, new data, and stays on the cutting-edge of innovation of the insurance industry. You’ll develop algorithms to target specific business objectives and create other business opportunities. Works with different functional teams, identifies and encourages innovation opportunities, and translates business needs to projects. Designs resource allocation processes to take potential innovations forward from the seed stage to development.\nNote: The safety of our associates, both current and future, is GEICO’s highest priority. At this time, most of our associates are working remotely due to the current COVID-19 pandemic. Candidates who are selected for this position will be trained remotely and must be able to work from home in a designated work area. Once GEICO determines it is safe for associates to return to the office, candidates may be required to work in our Chevy Chase, MD office.\nAs a full-time Data Scientist, you’ll enjoy our\n* to help secure your financial future and preserve your health and well-being, including:\nGEICO is an equal opportunity employer. GEICO conducts drug screens and background checks on applicants who accept employment offers.\nThe equal employment opportunity policy of the GEICO Companies provides for a fair and equal employment opportunity for all associates and job applicants regardless of race, color, religious creed, national origin, ancestry, age, gender, pregnancy, sexual orientation, gender identity, marital status, familial status, disability or genetic information, in compliance with applicable federal, state and local law. GEICO hires and promotes individuals solely on the basis of their qualifications for the job to be filled.\nGEICO reasonably accommodates qualified individuals with disabilities to enable them to receive equal employment opportunity and/or perform the essential functions of the job, unless the accommodation would impose an undue hardship to the Company. This applies to all applicants and associates. GEICO also provides a work environment in which each associate is able to be productive and work to the best of their ability. We do not condone or tolerate an atmosphere of intimidation or harassment. We expect and require the cooperation of all associates in maintaining an atmosphere free from discrimination and harassment with mutual respect by and for all associates and applicants.\n#DI-AM",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-14T13:46:46.000Z"
  },
  "company": {
    "name": "GEICO",
    "link": "https://www.linkedin.com/company/geico"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 84000,
    "max_value": 142000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Chevy Chase",
    "region": "MD",
    "postal_code": "20861",
    "street_address": null,
    "latitude": 38.98284,
    "longitude": -77.08646
  }
}