{
  "job": {
    "title": "Product Developer - Apparel",
    "industry": "",
    "description": "At KUIU, we are committed to crafting the lightest, most advanced mountain hunting clothing and equipment on earth. We live it. We breath it. And as part of the KUIU product team, you obsess over it. The Product Developer is responsible for developing and commercializing product within KUIU’s product portfolio. With direction from the Chief Merchandising Officer and Product Managers they will create tech packs, bills of materials, etc. and oversee the product commercialization process from brief kickoff to bulk production. ESSENTIAL JOB RESPONSIBILITIES: • Create and maintain tech packs throughout development process. • Perform daily communications with vendors and suppliers. • Assist in the sourcing and development of new trims, treatments, embellishments, and construction techniques. • Monitor quality control standards for trims, construction techniques, and finished products. · Fully evaluate development samples, including measuring, evaluating overall quality, construction, materials, and tech pack adherence. · Lead fittings in partnership with Tech Design. · Evaluate component and garment costing in partnership with Sourcing and Product Management. · Assists throughout wear test process for assigned styles. · Keep development on track, hitting all milestones and deadlines. REQUIREMENTS:  Bachelor’s degree or equivalent work experience is preferred  2+ years of consumer product development preferred  Competent with Microsoft Office and Adobe Creative Suites  Experience with PLM systems preferred  Awareness of consumer trends, competition and business processes.  Needs to work well independently, possess keen attention to detail, have excellent follow through skills and be pro-active.  Should be quick, collaborative and creative.  Need to be able to thrive in a deadline driven environment.  Have ability to multi-task and handle multiple projects at once.  Must have strong communication skills (verbal and written) and work well within a team environment",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:28:09.000Z"
  },
  "company": {
    "name": "KUIU",
    "link": "https://www.linkedin.com/company/kuiu-inc."
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Dixon",
    "region": "CA",
    "postal_code": "95620",
    "street_address": null,
    "latitude": 38.44556,
    "longitude": -121.822495
  }
}