{
  "job": {
    "title": "Software Engineer - Core Onboard Software",
    "industry": "Information Technology and Services,Computer Software,Automotive",
    "description": "Software Engineer, Onboard Software\nOur core onboard software engineers work closely with robotics engineers to develop safe, secure, and performant software solutions used across multiple engineering teams, providing reliable and well-designed libraries for use throughout the system. As an engineer on Motional's middleware team, you will implement and optimize middleware in high-performance, production-grade C++ and work in a complex and growing software ecosystem where new features are being added and evaluated rapidly and cross-functional collaboration is essential.\nThe Motional Pittsburgh office is located in the new Hazelwood Green development at 4734 Second Avenue, a culmination of the city's goal of restoring an economic driver to the neighborhood in a thoughtful, inclusive, and sustainable way. With views along the Monongahela river, the Pittsburgh office is in the heart of this new state of the art development.\nOur team is commercializing a world-class driverless system. The Motional team is behind some of the industry's largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world's first robotaxi pilot, and operation of the world's most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group and Aptiv, Motional is fundamentally changing how people move through their lives.\nHeadquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on Twitter, LinkedIn, Facebook, Instagram and YouTube.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:16:34.000Z"
  },
  "company": {
    "name": "Motional",
    "link": "https://www.linkedin.com/company/motionaldrive"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 69900,
    "max_value": 145000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Pittsburgh",
    "region": "PA",
    "postal_code": "15235",
    "street_address": null,
    "latitude": 40.44217,
    "longitude": -79.99496
  }
}