{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
    "description": "Position Senior Software EngineerSr. Java develper\nLos Angeles, CA\nLong term\nC2C or W2\nBachelor's Degree in Computer Science Engineering or equivalent experience required.\n7+ years of software development experience.\n7+ years of Java server-side design and development experience.\nHighly proficient in J2EE, Spring, Spring Boot and Hibernate.\nDistributed Caching (Redis), Queuing technologies (ActiveMQ, Kafka), Elastic Search.\nExcellent knowledge of RESTful APIs.\nExperience with Data Model, SQL, and No-SQL.\nExcellent knowledge of Microservices Architecture and implementation.\nExperience with GitHubBitbucket, Jira, Scrum, SonarCloud and CICD processes.\nWorking knowledge of Linux.\nExperience working on software-as-a-service (SaaS), large scale distributed systems and relationalNo-SQL databases.\nExperience working in a small team setting along with offshore development team.\nStrong verbal and written communication skills proven ability to lead both vertically and horizontally to achieve results thrives in a dynamic, fast-paced, environment and do what it takes to deliver results.\nCommitted to security practices in policy and delivery.\nShow vigilance in reporting of information, security vulnerabilities whether personal devices, corporate assets, services offered to customers, or office environment.\nWilling to participate in additional security and privacy trainings.\nWilling to be a model citizenmentor in security practices for Greenlots.\nExperience with AWS, RDS, Docker, Kubernetes.\nExperience in Electric Grid management solutions.\nExperience in Angular or similar JavaScript frameworks.\nThanks,\nRaj\n4880 Stevens Creek Blvd. Ste 202, San Jose, CA 95129\nPhone\nEmail",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:03:23.000Z"
  },
  "company": {
    "name": "Zenaide Technologies, Inc.",
    "link": "https://www.linkedin.com/company/zenaide-technologies-inc."
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}