{
  "job": {
    "title": "Software Engineer, Backend",
    "industry": "Health, Wellness and Fitness",
    "description": "We have a simple mission at Calm: To make the world a happier and healthier place. The heart of Calm is digital but the brand is expanding offline into a variety of products and services that bring more peace, clarity and perspective into people’s busy lives. Calm is passionate about helping people take care of their minds and we believe that Calm can become one of the most valuable and meaningful brands in the world.\nCalm is the #1 consumer brand for digital health, with over 100 million downloads (100K new per day). We weren named Apple’s App of the Year and the world’s first mental health unicorn. Inc. 5000 cited Calm as the 19th Fastest Growing Private Company in America and we were voted the ‘World’s Happiest App’ by the Center for Humane Technology.\nCheck out the Calm Careers Page to learn more about the mission, our values, and hear personal stories from our employees.\nCalm was co-founded by Alex Tew (Million Dollar Homepage) and Michael Acton Smith (Mind Candy, Moshi Monsters, Firebox).\nCalm’s Engineering team contributes directly to the company mission to make the world a happier and healthier place. As a backend engineer working on the B2B product area, you will be delivering experiences that provide more values to Calm’s fast-growing B2B user base and help bring mental wellness to more organizations.\nYou will work up and down the stack across a wide number of technologies and third party tools, mainly using tools like Typescript, Nodejs and Postgres.\nYou would collaborate with partners across the company, from Marketing and Content to Data, Product and Design and have plenty of opportunities to learn and grow alongside our B2B business’ growth.\nWe believe that mental health is health, and every person should be considered in the discussion. That’s why we’re proud to be an equal opportunity workplace, committed to equal employment opportunity regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or any other characteristic protected by applicable federal, state or local law.\nCalm is deeply committed to diversity, equity and inclusion, both in our hiring practices and in our experiences as a Calm employee. We strive to create a mindful and respectful environment where everyone can bring their authentic self to work, and experience a culture that is free of harassment, racism, and discrimination.\nCalm is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. Please inform Calm’s Recruiting team if you need any assistance completing any forms or to otherwise participate in the application process.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-03T18:53:49.000Z"
  },
  "company": {
    "name": "Calm",
    "link": "https://www.linkedin.com/company/calm-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}