{
  "job": {
    "title": "Senior Staff Engineer- IT Site Reliability Engineer",
    "industry": "Electrical/Electronic Manufacturing,Computer Software,Semiconductors",
    "description": "Samsung is a world leader in Memory, LCD and System LSI technologies. We are currently looking for exceptional software and hardware talent to join our Samsung Austin R & D Center (SARC) in Austin, TX and our Advanced Computing Lab (ACL) in San Jose, CA. SARC was established in Austin, TX in 2010 to be one of Samsung’s strategic investments in high performance low power ARM based device technology. Presently our GPU design teams, located in Austin (SARC) and San Jose (ACL), are developing a GPU that will be deployed in Samsung mobile products.  Our System IP team located in Austin (SARC) is working on Coherent Interconnect and memory controller architectures.\nAs a Site Reliability Engineer you will be a highly experienced, skilled, and driven engineer with a strong understanding of the CI/CD lifecycle, cloud native technology, and legacy software systems. You have likely been an application Software Engineer in the past and have gained a deep understanding of infrastructure and operations, or have been a Systems Administrator with extensive experience across technologies who has spent the last few years learning modern automation and cloud native infrastructure skills.\nYou must enjoy working alongside solution owners, systems architects and software engineers to maintain and improve a highly available, highly-scalable IT infrastructure platforms.\nYou must be able to troubleshoot production issues, implement automation tools and frameworks (CI/CD pipelines), collaborate with team members to improve the existing and develop new engineering tools, optimize company’s computing architecture, manage infrastructure, and design and conduct security, performance, and availability tests.\nYou will report to the Enterprise IT Senior Manager and work in close collaboration with Networking, Data Services, Engineering (CAE), and InfoSec.\nKey responsibilities include:\nMinimum requirements:\nPreferred qualifications:\n* Please visit  Samsung membership  to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click   here .\n* Samsung Electronics America, Inc. and its subsidiaries are committed to employing a diverse workforce, and  provide Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, gender identity, status as a protected veteran, genetic information, status as a qualified individual with a disability, or any other characteristic protected by law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T05:49:09.000Z"
  },
  "company": {
    "name": "Samsung Electronics America",
    "link": "https://www.linkedin.com/company/samsung-electronics-america"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "Texas Metropolitan Area",
    "postal_code": "78723",
    "street_address": null,
    "latitude": 30.276316,
    "longitude": -97.70931
  }
}