{
  "job": {
    "title": "React Native Engineer",
    "industry": "Financial Services",
    "description": "React Developer\nRemote\n$50 - $66/hour\nReactJS, React Native, JavaScirpt\nIf you are a React Developer and you're looking for a new career opportunity, with a company that has been listed as a Top 5 workplace in Austin for 3 years running, then this message is for you!! THIS IS A REMOTE POSITION! This is a contract position that will last until the end of the year. Hourly Rate of 50-66 per Hour!\nWe're are building an automated loan system for commercial size financial institutions, and we provide a financial software piece that streamlines our products as well as solutions through the software.\nFor this role, we are looking for Engineers who can design, implement, integrate, test, and deliver software applications leveraging our proprietary framework.\nSo, if this sounds like something you'd be interested in pursuing, please continue reading on!!\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\n$50-66/ Hour\nWork Full Remote\nSo, if you are a React Native Engineer with experience you may either\nOr\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nSteve.Nash@CyberCoders.com\nSteve Nash - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:31:34.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 61200,
    "max_value": 77100,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}