{
  "job": {
    "title": "Software Developer I",
    "industry": "Health, Wellness and Fitness,Hospital &amp; Health Care,Medical Practice",
    "description": "The Development Group at Phoenix Childrens develops leading edge solutions for healthcare problems using a wide range of technologies. We provide a wide variety of outcome-focused, innovative and cost-saving applications that allow Phoenix Childrens to provide unsurpassed quality of care to patients no matter how complicated or difficult their problem. Utilizing Microsoft Visual Studio and the .NET Framework (VB.NET/C#), successful developers in this position will produce cutting edge, robust, enterprise level web applications, web services, Windows forms, and mobile applications (iOS/Windows Store) on a variety of platforms and devices. This position requires a self-motivated individual with excellent written and communication skills, and exposure to a broad range of technologies, including web applications (ASP.NET, HTML5, JavaScript, CSS, responsive web design), client applications (Windows Forms), mobile applications (iOS, Xcode, Cocoa Touch, Objective-C, WinJS, XAML/C#), and other technologies (MS SQL Server, SSIS, Powershell, Reporting Services). Key responsibilities will require collaboration with Healthcare professionals and Development team members to analyze business situations, determine the appropriate technologies needed, and produce working solutions. Significant emphasis is placed upon developer creativity, adherence to established Development coding standards, and ability to overcome difficulties.",
    "employment_type": "OTHER",
    "date_posted": "2021-09-02T05:48:06.000Z"
  },
  "company": {
    "name": "Phoenix Children's Hospital",
    "link": "https://www.linkedin.com/company/phoenix-childrens-hospital"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Phoenix",
    "region": "AZ",
    "postal_code": "85009",
    "street_address": null,
    "latitude": 33.448204,
    "longitude": -112.072586
  }
}