{
  "job": {
    "title": "Biometrics Analyst SME",
    "industry": "Information Technology and Services,Defense &amp; Space,Aviation &amp; Aerospace",
    "description": "The Biometrics SME will provide technical support to the PM DoD Biometrics Chief Engineer. Provide testing capabilities in support of the DoD acquisition process by allowing anyone to test devices and or software against the Department’s biometric standards, ensuring not only the best technology in Soldier’s hands, but assuring the best infrastructure is there to support that technology. Additionally, provide SME and engineering, knowledge, skills and techniques to the enterprise products within the PM DoD Biometrics portfolio, including NATO support.\nThe minimum years of related experience required:\nOutside of the above, other certifications, licenses, or clearances include:\nMAG Aerospace (MAG) is an Equal Opportunity/Affirmative Action Employer and is committed to Diversity and Inclusion. We encourage diverse candidates to apply to our positions.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\nClick below for the “EEO is The Law” and “Pay Transparency Nondiscrimination” supplement posters.\nhttps://www.dol.gov/agencies/ofccp/posters\nMAG Aerospace (MAG) is committed to providing an online application process that is accessible to all, including individuals with a disability, by offering an alternative way to apply for job openings. This alternative method is available for those who cannot otherwise complete the online application due to a disability or need for accommodation.\nMAG provides reasonable accommodation to applicants under the guidance of the Americans with Disabilities Act (ADA), Section 503 of the Rehabilitation Act of 1973, the Vietnam-Era Veterans’ Readjustment Assistance Act of 1974, and certain state and/or local laws.\nIf you need assistance due to a disability, please contact the MAG Aerospace Recruiting email:\nApplicant.Assist@magaero.com or call (703) 376-8993.",
    "employment_type": "PART_TIME",
    "date_posted": "2021-08-03T03:29:41.000Z"
  },
  "company": {
    "name": "MAG Aerospace",
    "link": "https://www.linkedin.com/company/magaerospace"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Belvoir",
    "region": "VA",
    "postal_code": "22712",
    "street_address": null,
    "latitude": 38.85912,
    "longitude": -77.82029
  }
}