{
  "job": {
    "title": "Software Engineer, New Graduate",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Over the coming years, biotech will fundamentally rewrite the way we live. Gene editing and cell therapy are dramatically changing how we treat cancer and other major illnesses. Biofuels and biomaterials are transforming the cars we drive, the clothes we wear, and the makeup of everyday objects. Crop science and synthetic biology are producing sustainable and ethical food. Benchling's mission is to accelerate the research that propels us towards this reality, and magnify its impact, through modern software.\nEvery day, scientists around the world use Benchling's applications, platform, & analytics in their efforts to solve humanity's most pressing problems. For these scientists, Benchling is the central technology they use to conduct their research. Our customers include pharmaceutical giants, leading biotechs, and the world's most renowned research institutes.\nCheck out our engineering blog for some examples of past work. Here are some other examples of recent and future projects:\nBenchling welcomes everyone. We believe every member of our team enriches our diversity and inclusion by broadening our ways of problem-solving for future challenges. Even if you don't meet 100% of the qualifications for this job, we strongly encourage you to apply.\nIn following best practices and safety protocols, all Benchling employees are expected to work remotely until we are further advised that it is safe for employees to resume work in their respective office locations.\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We also consider for employment qualified applicants with arrest and conviction records, consistent with applicable federal, state and local law, including but not limited to the San Francisco Fair Chance Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T05:05:43.000Z"
  },
  "company": {
    "name": "Benchling",
    "link": "https://www.linkedin.com/company/benchling"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 115000,
    "max_value": 155000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}