{
  "job": {
    "title": "Software Engineer I",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "We’re all about connecting hungry diners with our network of over 300,000 restaurants nationwide. Innovative technology, user-friendly platforms and streamlined delivery capabilities set us apart and make us an industry leader in the world of online food ordering. When you join our team, you become part of a community that works together to innovate, solve problems, grow, work hard and have a ton of fun in the process!\nWe are looking for entry level engineering talent to join our organization in the\n! Grubhub is a place where authentically fun culture meets innovation and teamwork. We believe in empowering people and opening doors for new opportunities. If you’re looking for a place that values strong relationships, embraces diverse ideas–all while having fun together–Grubhub is the place for you!\nGrubhub is an equal opportunity employer. We welcome diversity and encourage a workplace that is just as diverse as the customers we serve. We evaluate qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. If you’re applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an email to campusrecruiting@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T18:26:24.000Z"
  },
  "company": {
    "name": "Grubhub",
    "link": "https://www.linkedin.com/company/grubhub-seamless"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York County",
    "region": "NY",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 40.75325,
    "longitude": -74.00381
  }
}