{
  "job": {
    "title": "Data Engineer - Cloud",
    "industry": "Information Technology and Services,Computer Software,Management Consulting",
    "description": "CapTech is a team of master builders, creators, and problem solvers who help clients grow efficient, successful businesses. We unite diverse skills and perspectives to transform how data, systems, and ingenuity enable each client to advance what’s possible in a changing world.\nAs perceptive partners, our U.S-based consultants find inspiration in the unknown and enjoy getting our hands dirty solving our clients’ myriad of challenges. Across industries and business goals, we fuse technical depth and analytical prowess with creative savvy to move clients forward. This drive helps each organization use technology, management, and insight to turn ideas into action. Together, we create outcomes that exceed the expected — which is one of the reasons we’ve been on the Inc. 500/5000 list for over a decade.\nCapTech Data Engineering consultants enable clients to build and maintain advanced data systems that bring together data from disparate sources in order to enable decision-makers. We build pipelines and prepare data for use by data scientists, data analysts, and other data systems. We love solving problems and providing creative solutions for our clients. Cloud Data Engineers leverage the client’s cloud infrastructure to deliver this value today and to scale for the future. We enjoy a collaborative environment and have many opportunities to learn from and share knowledge with other developers, architects, and our clients.\nSpecific responsibilities for the Data Engineer – Cloud position include:\nTypical experience for successful candidates includes:\nSuccessful candidates usually have demonstrable experience with technologies in some of these categories:\nAdditional Information\nWe provide challenging and impactful opportunities in our client work and internal teams, while keeping individual interests in mind. We want everyone at CapTech to be able to envision a lifelong career here, which is why we offer a variety of career paths based on your skills and passions. As a CapTecher, you will experience exciting and rewarding roles that help you grow and make a difference, while having fun along the way.\nAt CapTech we offer a competitive and comprehensive benefits package including, but not limited to:\nCapTech is an equal opportunity employer committed to fostering a culture of equality, inclusion and fairness — each foundational to our core values. We strive to create a diverse environment where each employee is encouraged to bring their unique ideas, backgrounds and experiences to the workplace. For more information about our diversity, Inclusion and belonging efforts, click HERE.\nAt this time, CapTech cannot transfer nor sponsor a work visa for this position. Applicants must be authorized to work directly for any employer in the United States without visa sponsorship.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T03:09:34.000Z"
  },
  "company": {
    "name": "CapTech Consulting",
    "link": "https://www.linkedin.com/company/captechlistens"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Reston",
    "region": "VA",
    "postal_code": "22096",
    "street_address": null,
    "latitude": 38.960186,
    "longitude": -77.3545
  }
}