{
  "job": {
    "title": "Senior Scientist - Protein Sciences",
    "industry": "Biotechnology",
    "description": "If you are a Senior Scientist - Protein Sciences with experience, please read on!\nWe are an immunotherapy company developing T cell receptor therapies to help cure cancer. Our platform is driving therapeutics solutions to make them come true. You will have an opportunity make an impact on patient lives with this opportunity.\nTop Reasons to Work with Us\nWhat You Will Be Doing\nAs the Scientist in Protein Sciences, you will be engineering and purifying antibodies and t-cell receptors from high-throughput expression. You will generate yeast-display libraries and design selection protocols. You will also manage a team of research associates and manage external collaborations.\nWhat You Need for this Position\nPhD in relevant field\nYeast and/or Phage display experience\nMolecular biology skills (PCR, gel electrophoresis)\nProtein Biology skills (Ni-NTA purification, FPLC Purification, His-tag purification)\nKnowledge of 2+ of the following: structural biology, immunology, protein engineering.\nNGS Data Analysis experience\nHT protein purification protocol development experience\nLiquid handling robot experience\nWhat's In It for You\nSo, if you are a Senior Scientist - Protein Sciences with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nAlexander.Charles@CyberCoders.com\nAlexander Charles - Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:34:27.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "South San Francisco",
    "region": "CA",
    "postal_code": "94083",
    "street_address": null,
    "latitude": 37.65568,
    "longitude": -122.41248
  }
}