{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Biotechnology,Pharmaceuticals",
    "description": "Schrödinger’s mission is to revolutionize drug discovery through the use of breakthrough computational methods. We are currently looking for outstanding individuals to join our drug discovery group and contribute to our rapidly expanding portfolio of drug discovery collaborations.\nOur drug discovery group of around 60 scientists includes designers, modelers, computational chemists, medicinal chemists, crystallographers, biochemists, and biologists. The group is supported by more than 100 software developers and engineers. Three of the programs we’ve worked on in the past 7 years have progressed into the clinic and an additional one is expected to enter clinical trials this year. For recent news on one of these programs, go to this website.\nIf you are interested in a career combining science and technology on drug discovery projects, we are eager to hear from you.\nSchrödinger understands it’s people that make a company great. Because of this, we’re prepared to offer a competitive salary, stock options, and a wide range of benefits that include healthcare (with dental and vision), a 401k, pre-tax commuter benefits, a flexible work schedule, and a parental leave program. We have catered meals in the office every day, a company culture that is relaxed but engaged, and over a month of paid vacation time. Our Administrative and Human Resources departments also plan a myriad of fun company-wide events.\nWe've been working remotely from across the world over the past few months because the health and safety of our employees is paramount. Nonetheless, we have kept Schrödinger's outstanding culture going through a series of online fitness classes, trivia nights, happy hours, and so much more.\nSound exciting? Apply today and join us!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T06:26:06.000Z"
  },
  "company": {
    "name": "Schrödinger",
    "link": "https://www.linkedin.com/company/schr-dinger"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Portland",
    "region": "OR",
    "postal_code": "97268",
    "street_address": null,
    "latitude": 45.516018,
    "longitude": -122.68143
  }
}