{
  "job": {
    "title": "CNC / LTCC Technician (2nd/3rd shift) - Temp-to-Hire",
    "industry": "Semiconductors",
    "description": "If you are a CNC Operator, LTCC Technician, or have experience with screen printing, punching tape, or electrical testing, please read on!\nWorking here gives you the opportunity to work with cutting edge technology, have a direct influence on next generation products hitting the market and drive the overall growth and development of the semiconductor industry. We are a fast-paced, agile, growing company that values diversity of thought and constantly strives for a more diverse, inclusive environment. We are looking for enthusiastic, talented individuals who can thrive in a changing and challenging environment.\nWhat You Will Be Doing\nThe Low Temperature Cofired Ceramic (LTCC) technology can be defined as a way to produce multilayer circuits with the help of single tapes, which are used to apply conductive, dielectric and/or resistive pastes on. These single sheets have to be laminated together and fired in one step all.\nWhat You Need for this Position\nWILL PROVIDE TRAINING\nMust be willing to work weekends! Shifts available:\n2nd Shift : 2pm-10:30pm\n3rd Shift: 10pm - 6:30am\nWhat's In It for You\nHourly Rate: $25 - $30/hour depending on experience\nTemp-to-Hire position (possibility of full-time conversion after 6 months)\nMedical, Dental, Vision and 401k benefits available\nCOVID-19: We are committed to the safety of our employees. We have ample safety protocols in place, including social distancing, safety training and appropriate screenings for all on-site personnel and visitors.\n______\nIf you feel you are a good fit for this position, please apply here or email your resume to meghan.medrick@cybercoders.com\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nMeghan.Medrick@CyberCoders.com\nMeghan Medrick - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:28:09.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Baldwin Park",
    "region": "CA",
    "postal_code": "91706",
    "street_address": null,
    "latitude": 34.08538,
    "longitude": -117.96036
  }
}