{
  "job": {
    "title": "Junior Data Scientist",
    "industry": "Computer Software",
    "description": "is hiring a\nto join our growing product team! Our ideal candidate has a strong background in Data Science and Statistics.\nSiteZeus is a location intelligence SaaS platform based out of Tampa, FL and founded in 2013. We are a remote organization focused on company culture, industry changing technology, and employee value. Our customers use SiteZeus to make better decisions about where to build their next physical locations, and how to optimize their investment in existing locations. We empower brands to pick the very best locations by employing the very best people and giving them the tools to succeed.\n- $50,000 - $85,000\nSiteZeus may consider candidates it deems as overqualified or underqualified. Such candidates may be considered at salary numbers higher or lower than the listed range.\nThis is a Remote (work from home) position.\nBelow is our hiring process for this position. We will reach out or send a rejection notice to most candidates within 1-5 business days of applying. SiteZeus promises to value your time and professionalism in every step of the process.\nSiteZeus is proud to be an equal opportunity employer that celebrates diversity, culture, and the human experience. We go above and beyond to ensure that all team members feel comfortable about who they are and the contributions they make to our mission. Our team is highly encouraged to find a balance that allows for optimal fulfillment at work and home.\nAll applicants must be legally authorized to work within the United States. All roles may require prolonged periods of sitting at a desk, working on a computer, and corporate communication skills. Further, SiteZeus takes physical health seriously and has processes in place to minimize the spread of Covid-19 at its Tampa HQ. Degree requirements and preferences may be substituted for bonified work history or relevant experience.\nPowered by JazzHR\nPIDG5909os",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T07:22:04.000Z"
  },
  "company": {
    "name": "SiteZeus",
    "link": "https://www.linkedin.com/company/sitezeus"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Tampa",
    "region": "FL",
    "postal_code": "33675",
    "street_address": null,
    "latitude": 27.947424,
    "longitude": -82.45878
  }
}