{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Biotechnology,Research",
    "description": "Generate Biomedicines, Inc. is a Flagship backed, privately-held biotechnology company on a mission to reimagine the drug discovery process to one of deterministic, data-driven generation. We pursue this audacious vision because we believe in the unique and revolutionary power of generative biology to radically transform the lives of billions, with an outsized opportunity for patients in need. Generate will be successful by constantly turning innovative ideas into methods, technologies, and therapeutics that solve some of the most difficult challenges with developing medicines. We are seeking collaborative, relentless problem solvers that share our passion for impact to join us!\nGenerate was founded by Flagship Pioneering. Flagship Pioneering conceives, creates, resources, and develops first-in-category life sciences companies to transform human health and sustainability. Since its launch in 2000, the firm has applied a unique hypothesis-driven innovation process to originate and foster more than 100 scientific ventures, resulting in over $30 billion in aggregate value. The current Flagship ecosystem comprises 37 transformative companies, including: Moderna Therapeutics (NASDAQ: MRNA), Rubius Therapeutics (NASDAQ: RUBY), Indigo Agriculture, and Sana Biotechnology.\nWe are seeking a creative and motivated computational scientist to expand and apply Generate’s machine learning platform to the next wave of machine generated biomedicines. You will collaborate across Generate’s platform, protein sciences, and project teams to drive new explorations in areas including, but not limited to gene therapies and cell therapies. You will expand, build upon, and contribute to Generate’s core code base while applying the existing technology to new platform development and technological capabilities. The successful candidate will be a generalist computational scientist with a natural affinity towards an exploration mindset and pushing technology into unknown biology.\nFlagship Pioneering and our ecosystem companies are\nregardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T04:11:10.000Z"
  },
  "company": {
    "name": "Flagship Pioneering",
    "link": "https://www.linkedin.com/company/flagship-pioneering"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Cambridge",
    "region": "MA",
    "postal_code": "02239",
    "street_address": null,
    "latitude": 42.36525,
    "longitude": -71.10502
  }
}