{
  "job": {
    "title": "Data Scientist",
    "industry": "Accounting,Information Technology and Services,Management Consulting",
    "description": "Research & Insights, Deloitte Services LLP\nWe are looking for a teammate who will bring a blend of thoughtful, data driven curiosity and pragmatism. If you want to both design and deploy impactful, data-driven research to a global audience, then we want you on our team.\nData Science and Survey Advisory Services, Research & Insights Data Scientists play a key role developing research products that work to change perspectives on major business and government issues. Our Data Scientists are involved in all stages of the research process including working with internal clients to define research projects, research execution, presenting findings, and co-authoring public facing research reports. Strong candidates will be both thorough and creative in their research approaches, comfortable with public speaking, precise & concise writers, and able to both deliver and receive candid feedback.\nOur Data Scientists play a key role in generating research into pivotal phenomena impacting US businesses and the US government. Our Data Scientists are required to occasionally travel (a few times a year at most) to attend offsite meetings, conferences, and/or training sessions.\nRequired Skills and Capabilities:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-14T18:08:51.000Z"
  },
  "company": {
    "name": "Deloitte",
    "link": "https://www.linkedin.com/company/deloitte"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Phoenix",
    "region": "AZ",
    "postal_code": "85009",
    "street_address": null,
    "latitude": 33.448204,
    "longitude": -112.072586
  }
}