{
  "job": {
    "title": "Federal - Software Engineer Analyst",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Accenture Federal Services, helping our federal clients tackle their toughest challenges while unleashing their fullest potential…and then some. What makes our approach so unique? Operating from the nation’s capital, we bring together commercial innovation and leading-edge technologies to deliver an integrated and interactive experience that far exceeds expectations. How? Our passion meets purpose! Through our diverse culture and inclusive thinking, we embrace our employees' ideas taking them from concept to practical solutions. Not to mention, we sleep well at night knowing our work directly impacts and improves the way the world works. We keep our tech smarts sharp by providing abundant training and certification opportunities. Are you ready to learn and grow in a career, while making a difference?\nEnvisioning how to use technology to make the world a better place. You see the potential for technology everywhere, from solving problems to capturing new opportunities. And you are ready to put that kind of innovative thinking to work. You see the art of the possible and have the drive and critical thinking skills to make it happen.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:01:47.000Z"
  },
  "company": {
    "name": "Accenture Federal Services",
    "link": "https://www.linkedin.com/company/accenturefederalservices"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}