{
  "job": {
    "title": "Data Scientist/Machine Learning Engineer, NLP",
    "industry": "Information Technology and Services,Computer Software",
    "description": "This Jobot Job is hosted by Christina Finster\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nOur client's mission is to provide Earth’s 7.3 billion citizens with control of their complete health information and give them the choice of sharing it with whomever they want.\nPerks\nOn a mission to revolutionize healthcare\nCulture of doers\nVenture-backed, Series A equity\nGenerous Benefits, Discretionary Time Off\nIn this role, you will be working with other data scientists and engineers to help build our unstructured data extraction pipeline. You will be responsible for leveraging the latest machine learning and natural language processing technology to structure and normalize data from medical records. The ideal candidate will have no issue digging into messy data, working with clinical subject matter experts to develop annotation guidelines to produce high-quality machine learning models.\n2+ years experience prototyping and deploying production NLP / Machine Learning models\n3+ years experience with Python and solid software development skills\nFamiliarity with common NLP/ML frameworks (Spacy, Pytorch, TensorFlow, Keras)\nFluency in state-of-the-art machine learning techniques including Transformers, CNNs, RNNs to solve NLP tasks like Named Entity Recognition, Information Extraction, Named Entity Linking.\nExcellent ability to communicate technical information to non-technical audiences\nOnly accepting US Based applicants at this time\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T21:31:16.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}