{
  "job": {
    "title": "Software Engineer, New Grad (0-1 years of experience)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "You just joined the industry and started exploring how your software skills can accelerate workflows. You think — can I do more than this — can I help the transformation of industries at a pace faster than my efforts singularly?\nAirtable’s mission is to bring the power of software development to everyone. We are developing a toolkit that our customers can leverage to build solutions without writing code. It has been extremely rewarding to see what our users are accomplishing with this toolkit. From coordinating manufacturing to 3D printing pipelines, we see a variety of use cases on Airtable. Our goal is to make this toolkit even more powerful while keeping the experience easy to comprehend. To achieve this ambitious goal, we need growth-minded engineers who are passionate about Airtable's mission.\nAt Airtable, you’ll join a highly talented and experienced team with diverse backgrounds, ready to move fast and ship high-quality features in collaboration with customer-facing teams. We practice inclusion, foster psychological safety, and proactively look to increase diversity on a variety of dimensions. You will have the opportunity to learn and grow, and your work enables Airtable’s mission of democratizing software engineering.\nAirtable is working on the next computer revolution: one where anyone – even without technical training – can create customized applications that fit their needs, build more interconnected teams, and take part in a growing community of people who share what they create. Founded in 2012 and headquartered in San Francisco, Airtable powers teams at more than 250,000 organizations around the world. Our most recent funding round valued Airtable at $5.77 billion and raised $270 million in additional capital, and we're just getting started!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T04:14:13.000Z"
  },
  "company": {
    "name": "Airtable",
    "link": "https://www.linkedin.com/company/airtable"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 91800,
    "max_value": 199800,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}