{
  "job": {
    "title": "Sr. Engineer, Kubernetes Platform-2",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSr. Engineer, Kubernetes Platform-2\nDistributed Platforms represents the next phase in the advancement of our digital transformation and is a significant evolution for MasterCard. We continue to grow our Platform as a Service organization to support aggressive growth plans. MasterCard is seeking a Sr. Software Engineer to be part of implementation of Kubernetes Service as well as other core services need to operationalize Kubernetes. This position requires a working knowledge of what it takes to stand up on-prem/off Platforms like Kubernetes and understands how elastic runtimes support distributed compute and storage needs.\nExperiences\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nEvery person working for, or on behalf of, Mastercard is responsible for information security.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:22:32.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}