{
  "job": {
    "title": "Machine Learning/NLP Engineer",
    "industry": "Pharmaceuticals",
    "description": "The Pfizer Machine Learning and Intelligent Assistance Team, builds, delivers and maintains the products, platforms and capabilities that enable Pfizer Business Units to leverage intelligent automation solutions to effectively engage/collaborate with teams internally and our customers externally. We build advanced AI technology solutions at a global scale that positively impact Pfizer business performance. Pfizer is accelerating the use of AI technologies across our entire enterprise.\nWe are looking for a natural language processing (NLP) engineer to join the Intelligent Solutions Team to scale and help us improve our NLP products and create new efficient self-learning NLP applications and products.\nYou will need to apply state of the art NLP and ML techniques, build robust pipelines to enable end to end intelligent solutions for unique business problems. You will be responsible for developing the NLP vision for new projects and will need a keen understanding of NLP/ML models, solutions and technologies. Finally, you will also assist in evangelizing AI/ML/NLP across Pfizer and promote adoption and enablement of NLP solutions across Pfizer by providing education, guidance and mentorship to junior members of the team and the broader Pfizer digital and business community.\nThe ideal candidate will be passionate about health care, software engineering, machine learning, NLP and stay up-to-date with the latest developments in the field.\nRole Responsibilities\nStrong Analytical Thinking and Problem Solver.\nFlexibility to work across multiple time zones (i.e.: EST, PST, GMT, IST)\nLast Date to Apply for Job: 9/20/2021\nEligible for Employee Referral Bonus\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\nInformation & Business Tech",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-26T23:51:39.000Z"
  },
  "company": {
    "name": "Pfizer",
    "link": "https://www.linkedin.com/company/pfizer"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Utica-Rome Area",
    "region": null,
    "postal_code": "13501",
    "street_address": null,
    "latitude": 43.09009,
    "longitude": -75.2616
  }
}