{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Shamrock Trading Corporation is the parent company for a family of brands in transportation services, finance and technology. Headquartered in Overland Park, KS, Shamrock has consistently been named “Best Places to Work” by the\nWe also have offices in Chicago, Dallas, Laredo, Midland, Nashville, and Atlanta.\nWith an average annual revenue growth of 25% since 1986, Shamrock’s success is attributed to three key factors: hiring the best people, cultivating long-term relationships with our customers and continually evolving in the marketplace.\nShamrock Trading Corporation is looking for a Site Reliability Engineer to join the Development team. The Site Reliability Engineer will focus on collaborating with software developers and other IT staff members to design new internal solutions that increase operational efficiency. An ideal candidate will be a detail-oriented problem solver with proven experience. The Site Reliability Engineer should be familiar with multiple CI/CD processes and tools and be able to guide developers in the SDLC.\nAt Shamrock we hire bright, ambitious people and give them the tools they need to be successful. By investing in training and development, we hope to become a long-term career for employees, where there are always opportunities for advancement. Shamrock also offers a premier set of benefits for employees and their families:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-18T05:41:58.000Z"
  },
  "company": {
    "name": "Shamrock Trading Corporation",
    "link": "https://www.linkedin.com/company/shamrock-trading-corp-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 84600,
    "max_value": 122000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Overland Park",
    "region": "KS",
    "postal_code": "66214",
    "street_address": null,
    "latitude": 38.97482,
    "longitude": -94.6836
  }
}