{
  "job": {
    "title": "Senior Software Engineer, Presentation",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology\nSo you’ve got an amazing chart that will change the way people think, make decisions, or do their work. But how will you share it with others? Will you build a dashboard that people can use to understand and evaluate progress? Will you add beautiful animated transitions on your viz to help share your insight in the most compelling narrative? Will you tell a beautiful and visually compelling story around your data? Or perhaps you will build an application-like product that will elevate your consumers’ insights to a whole new level!\nOn the Presentation team we are building these capabilities into Tableau, and we need your help to make it happen! We design and develop features to allow users to express themselves in exciting new ways, giving our customers the flexibility to see and understand their data and tell data stories in the form that works best for them. As a part of the this team, you will be developing user experiences that drive some of the most visually impactful aspects of Tableau.\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\nand\nare Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.\nand\ndo not accept unsolicited headhunter and agency resumes.\nand\nwill not pay any third-party agency or company that does not have a signed agreement with\nor Salesforce.org.\nSalesforce welcomes all.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:34:53.000Z"
  },
  "company": {
    "name": "Salesforce",
    "link": "https://www.linkedin.com/company/salesforce"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}