{
  "job": {
    "title": "Site Reliability Engineer, Americas",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "This role is an opportunity for a hands-on technologist with a passion for Linux to build a career with Canonical and drive the success with those leveraging Ubuntu and open source products. If you have an affinity for open source development and a passion for technology, then you will enjoy working with some of the best people in the industry at Canonical.\nThe IS Team at Canonical supports and maintains all of Canonical's production services. Members of the team use real-life operational experiences to contribute to product improvements. The team is in charge of running services used by over 60 million Ubuntu users.\nAs an SRE you'll be in a unique position to improve Canonical products and the open-source technologies they're based on. You'll do this by providing critical feedback to developers on how their products operate at scale as well as writing code, submitting bugs, and working with other teams within the company. You will also be encouraged to develop and submit fixes and enhancements directly and to collaborate with development teams during the design and implementation phases.\nYou'll be part of a global team of SREs that work together and support each other to provide the best possible services to our company, Canonical's customers and the Ubuntu Community.\nCanonical is a growing, international software company that works with the open-source community to deliver Ubuntu -- the world's #1 cloud operating system. Our mission is to realize the potential of free software in the lives of individuals and organisations. Our services are helping businesses worldwide to reduce costs, improve efficiency and enhance security with Ubuntu.\nWe offer:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T17:16:28.000Z"
  },
  "company": {
    "name": "Canonical",
    "link": "https://uk.linkedin.com/company/canonical"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Columbus",
    "region": "OH",
    "postal_code": "43272",
    "street_address": null,
    "latitude": 39.96276,
    "longitude": -82.99629
  }
}