{
  "job": {
    "title": "Data Science Enthusiast",
    "industry": "Insurance",
    "description": "If you are a Data Science Enthusiast with experience or interest in the Insurance industry, please read on!\nWe have been delivering a whole new generation of model-driven solutions and have set the pace for Data Visualization within the Insurance industry. As one of the largest enterprise insurance companies in the United States of America, we have the freedom to explore external data sources and new machine learning techniques .our team is designing and creating unique data-driven solutions for the foundational arm of our enterprise. We have a state-of-the-art computing environment with a solid suite of machine learning tools and packages, a model deployment platform, and a large group of well-trained professionals at various levels to support you. Life insurance has already started undergoing a huge change. This is a chance to be part of and actually to drive, the continued transformation of an industry. Is this not why we became data scientists?\nTop Reasons to Work with Us\nTraditional benefits for corporate employees like medical, dental, and vision care and a 401(k) savings plan but we also offer some unique perks , such as\nWhat You Will Be Doing\nWhat You Need for this Position\nSo, If you are a Data Science Enthusiast with experience or interest in the Insurance industry, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nPatrick.Tafua@CyberCoders.com\nPatrick Tafua - Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:38:04.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}