{
  "job": {
    "title": "Lead Software Engineer",
    "industry": "Nonprofit Organization Management,Insurance,Financial Services",
    "description": "Position at ProAg\nProAg has an exciting opportunity for a Lead Software Engineer to join our team. Are you looking for an opportunity to apply the advantages of technology and dedicate importance to ensure our software packages are the easiest and most efficient in the industry? Bring your passion for innovation to an Agile environment to help serve quality software products to our farmers, agents, and re-insurers.\nWhen viewed from 30,000 ft the development lead role serves the feature teams so that they can work at a higher level. It does so by providing estimates to business stakeholders and support to feature teams. Reporting to the Software Development Director, your mission will be to enable feature teams to be more productive and efficient.\nThis position will be in ProAg’s Maple Grove, MN office.\nWhile our nation weathers economic storms, ProAg, a member of the Tokio Marine HCC group of companies, is positioned as a financially strong and well-capitalized insurer. We’re known for our quick response and fast, accurate claims settlement. We understand how important this is because many of us are farmers and ranchers ourselves. With more than 90 years of service to our agents & insureds, we stand committed to continuing the principles that ProAg was founded on: Integrity, Loyalty and Customer Service.\nThe Tokio Marine HCC Group of Companies offers a competitive salary and employee benefit package. We are a successful, dynamic organization experiencing rapid growth and are seeking energetic and confident individuals to join our team of professionals. The Tokio Marine HCC Group of Companies is an equal-opportunity employer. Please visit www.tokiomarinehcc.com for more information about our companies.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T22:45:57.000Z"
  },
  "company": {
    "name": "ProAg",
    "link": "https://www.linkedin.com/company/proag"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": "USD",
    "min_value": 76200,
    "max_value": 106000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Maple Grove",
    "region": "MN",
    "postal_code": "55340",
    "street_address": null,
    "latitude": 45.09812,
    "longitude": -93.444534
  }
}