{
  "job": {
    "title": "Machine Learning Infrastructure Software Engineer",
    "industry": "Construction,Machinery",
    "description": "Engineering\nWhether it be groundbreaking products, best in class solutions or creating a lifelong career, you can do the work that matters at Caterpillar. With a 95-year legacy of quality and innovation and 150 locations in countries around the world, your impact spans the globe.\nWhen you join Caterpillar, you are joining a team of makers, innovators and doers. We are the people who roll up our sleeves and do the work to build a better world. We don’t just talk about progress and innovation. We make it happen. And we are proud of that, because it helps our customers build and power the world we live in – the roads, hospitals, homes and infrastructure. Without a dedicated workforce Caterpillar could not effectively meet our customer’s needs. Join us.\nAs a Machine Learning Infrastructure Engineer, you will be responsible for developing and deploying a robust full-stack pipeline that can support various perception/planning/prediction projects. In this role, you will build up various tools that will optimize efficiency when working with large data sets. This includes developing Data Stores, implementing Data Visualization utilities, and deriving quantifiable metrics to support the Machine Learning pipeline. Your actions will directly contribute to the development of safer, more efficient machines for Caterpillar's customers. Basic qualifications includes building and supporting the tools, scripts, and processes for managing data and training pipelines for machine learning.\nAs a Machine Learning Infrastructure Engineer, you will be responsible for developing and deploying a robust full-stack pipeline that can support various perception/planning/prediction projects. In this role, you will build up various tools that will optimize efficiency when working with large data sets. This includes developing Data Stores, implementing Data Visualization utilities, and deriving quantifiable metrics to support the Machine Learning pipeline. Your actions will directly contribute to the development of safer, more efficient machines for Caterpillar's customers. Basic qualifications includes building and supporting the tools, scripts, and processes for managing data and training pipelines for machine learning.\nExtracting, processing, and organizing raw data (images, lidar)\nSubmitting images to external vendors for annotation\nRetrieving image annotations from external vendors\nNormalizing and integrating these annotations into our infrastructure.\nProviding basic analytics, such as total number of datasets, frames, and annotations.\nInteractive ML dataset creation and management.\nSupport for data visualization tools\nML model training, evaluation, and deployment.\nBachelors in Computer Science, Engineering, Mathematics, or an equivalent discipline\n3+ years experience in ML pipeline development/setup/maintenance\nAWS S3 and SageMaker\nExperience in Linux environments\nScala and scripting languages\nPython and creating/managing Jupyter notebooks\nDocker/containers\nDatabase configuration, scripting\nMasters in Computer Science, Engineering, Mathematics, or an equivalent discipline\nFamiliarity with ROS\nExperience with Node.js and React\nExposure to with ML/deep learning, computer vision, perception algorithms\nExperience working with data annotation vendors\nExperience integrating with CI/regression testing frameworks\nThe location for this position is Mossville, IL or San Francisco, CA\nRelocation assistance is not available for this position. Any relocation costs would be incurred by the selected candidate\nThis position may require less than 10% travel\nOur goal at Caterpillar is for you to have a rewarding career. Our teams are critical to the success of our customers who build a better world.\nHere you earn more than just a salary because we value your performance. We offer a total rewards package that provides benefits on day one (medical, dental, vision, RX, and 401K) along with the potential of an annual bonus.\nAdditional benefits include paid vacation days and paid holidays (prorated based upon hire date).\nPlease frequently check the email associated with your application, including the junk/spam folder, as this is the primary correspondence method. If you wish to know the status of your application – please use the candidate log-in on our career website as it will reflect any updates to your status.\nFor more information, visit caterpillar.com. To connect with us on social media, visit caterpillar.com/social-media\nEEO/AA Employer. All qualified individuals - Including minorities, females, veterans and individuals with disabilities - are encouraged to apply.\nNot ready to apply? Submit your information to our Talent Network here.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-30T05:36:37.000Z"
  },
  "company": {
    "name": "Caterpillar Inc.",
    "link": "https://www.linkedin.com/company/caterpillar-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 83800,
    "max_value": 158000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Mossville",
    "region": "IL",
    "postal_code": "61552",
    "street_address": null,
    "latitude": 40.816647,
    "longitude": -89.5687
  }
}