{
  "job": {
    "title": "Full Stack Software Engineer - React/C#",
    "industry": "Computer Software",
    "description": "If you are a react/C# developer looking for a small, close knit team where you can work remoote, please read on!\nTop Reasons to Work with Us\nWhat You Will Be Doing\nFull-stack software development\nWorking closely with the engineering team, QA, and product users on a highly functional agile team\nLeading and guiding a team of junior and mid-level developers and test engineers\nEnsuring system health and fixing defects\nSolving difficult problems through research and innovation\nWhat You Need for this Position\nWhat's In It for You\nSo if you are a software engineer with the above experience, please apply today or email me directly at danny.gross@cybercoders.com.\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nDanny.Gross@CyberCoders.com\nDanny Gross - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:01:00.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Philadelphia",
    "region": "PA",
    "postal_code": "08051",
    "street_address": null,
    "latitude": 39.95106,
    "longitude": -75.16562
  }
}