{
  "job": {
    "title": "Software Engineer",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "At Flexa, our mission is to make payments more efficient and accessible for everyone. Our team is passionate about the transformative power of digital currencies, but we’re also not daunted by starting from scratch to make the world a better place. So every day, we re-build and reconsider the very concept of what it means to use money while we enable faster, safer, and more private payments to help merchants streamline checkout, save money, and delight customers.\nOn the Flexa engineering team, we trust and support each other to write software that works and that we each fully understand, and we encourage (continuous) self-deployment. We also expect each other to take the time needed to build software thoughtfully and maintainably. We’re comfortable with modern tool chains, technologies, and practices, and we strive to continuously learn and improve our infrastructure and techniques.\nWe are currently looking for a software engineer to help us design, develop, and deploy the software and services that help make Flexa the leading retail payments network for digital assets. Our development process is lightweight and productive, and revolves around our mutual respect for each other as well as our individual dedication to building high-quality products. You may be a fit for this position if you have a strong background or interest in building successful APIs, SDKs, and other systems; you have comfort with the full breadth of the software development lifecycle; you practice exceptional attention to detail; and you’re comfortable learning new technologies and systems.\nWhat you’ll do\nFlexa was founded in 2018 and is headquartered in New York City. To learn more about how Flexa is building a better, all-digital payments network, visit us at flexa.network.\nBuilding a diverse and inclusive workplace where we can all learn from each other’s experiences is core to our values at Flexa. We are an equal opportunity employer, and welcome people of different backgrounds, abilities, experiences, and perspectives to our team. Women, minorities, individuals with disabilities, and protected veterans are encouraged to apply.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-26T03:29:12.000Z"
  },
  "company": {
    "name": "Flexa",
    "link": "https://www.linkedin.com/company/flexahq"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "United States",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 42.93923,
    "longitude": -75.62005
  }
}