{
  "job": {
    "title": "Software Engineer - Vehicle Engineering",
    "industry": "Automotive,Renewables &amp; Environment,Utilities",
    "description": "Tesla’s Vehicle Engineering team is currently seeking a software engineer to focus on improving our in-house manufacturing and supply chain computer vision platform. As well, this role will be able to contribute to many of our other purpose-built applications that automate and improve the process of designing, building, and delivering our products, globally.\nTesla’s Vehicle Engineering team, in general, owns the centralized technical aspects of our multi-continent Gigafactory network and product line. The systems we work on include Tesla’s most important programs, such as Plaid, Cybertruck, cell production and new factories. The software team is responsible for making these systems and operations every bit as intelligent and dynamic as the products themselves.\nAs a software engineer on the Vehicle Engineering team, you will be in a product ownership role, leveraging whatever tech you feel fits best, (e.g., gRPC, Kafka, Lambda’s, containerized deployments running in AWS and Kubernetes On-Prem) to re-imagine how global Gigafactory network should operate. Knowledge of networking, computer architecture, and computer science fundamentals, like data structures and algorithms, working with HMI/PLCs and similar IOT devices are highly desired traits. The ideal candidates will carry the product from conception all the way through customer delivery and refactoring, embracing issues that inevitably arise in complex industrial and scientific environments. The role will require the confidence to flex into all aspects of software engineering, as needed, to make the final product successful.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T08:14:50.000Z"
  },
  "company": {
    "name": "Tesla",
    "link": "https://www.linkedin.com/company/tesla-motors"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 109000,
    "max_value": 147000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Fremont",
    "region": "CA",
    "postal_code": "94537",
    "street_address": null,
    "latitude": 37.5502,
    "longitude": -121.98083
  }
}