{
  "job": {
    "title": "Data Scientist - Research and Economics, Earnings Policy",
    "industry": "Computer Software,Consumer Services,Information Technology and Services",
    "description": "Our policy data scientists work with our policy issue experts around the world, equipping them with data and insights to inform our public policy positions. The Economics team produces in-house research and collaborates with world-leading academics to understand our marketplace and improve our products.\nWe are seeking data scientists to drive research into how people use our platform to make money. In this role, you would be part of the Earnings team within Research and Economics, which is responsible for addressing thorny policy and business challenges impacting Uber globally.\nAt a minimum, you will need to be able to use an understanding of economics and econometrics in applied research and use SQL/R/Python to clean and analyze data. Projects will primarily focus on analyzing net earnings for drivers and delivery people and then evangelizing this knowledge using tools like dashboards and presentations. In particular, the role requires an ability to understand the economics of Uber’s marketplace and the complexities of geospatial and time-based variation in earnings. Interested candidates should have a customer service mentality as well as the ability to independently handle cross-functional projects.\nUber’s best-in-class technology provides outstanding economic opportunity for over 3 million people around the world. This role requires humility and dedication to getting the facts right so that we can do the right thing for our earners.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T00:00:00.000Z"
  },
  "company": {
    "name": "Uber",
    "link": "https://www.linkedin.com/company/uber-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 169000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}