{
  "job": {
    "title": "REMOTE Sr Software Engineer - Python, React, PostgreSQL, GraphQL",
    "industry": "Hospital &amp; Health Care",
    "description": "If you are a REMOTE Senior Software Engineer with experience, please read on!\nWe are looking for a Senior Software Engineer to join our team in Overland Park, KS! You will work independently on complex assignments and assists in coming up with appropriate procedures on new assignments. You'll also assist in serving as a resource to both internal and 3rd party team members on higher level issues as well as analyzing and designing specs of junior team members.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nThis job is open to telecommute candidates.\nApplicants must be authorized to work in the U.S.\nSo, if you are a REMOTE Senior Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNick.Valenti@CyberCoders.com\nNick Valenti - Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:32:31.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Overland Park",
    "region": "KS",
    "postal_code": "66214",
    "street_address": null,
    "latitude": 38.97482,
    "longitude": -94.6836
  }
}