{
  "job": {
    "title": "Systems Engineer - MEMs Prototyping",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Systems Engineer with experience of developing schematics and low level firmware programming, please read on!\nWe are a global leader in micro-electronic machines industry. Our products have continued to impact the creativity and efficiency of electronics developed in the world. As electronics continue to become, thinner, smaller and more compact, our development teams will be right there with the right solution. Our timing solutions are second to none and our development teams continue to push the envelope on innovation. We hope our next hire will share the same desire and passion.\nWhat You Will Be Doing\nWhat You Need for this Position\nSo, if you are a Systems Engineer with a desire to impact technology please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nPatrick.Tafua@Optello.com\nPatrick Tafua - Executive Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:24:50.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}