{
  "job": {
    "title": "Sensing Systems Engineer",
    "industry": "Consumer Electronics",
    "description": "The Camera Systems Engineering Group is responsible for the systems-level analysis, design and development of new camera features and technologies for performance enhancement. The team is seeking an exceptional systems engineer with broad skills to lead research projects.\nExpertise with sensing systems (preferably in magnetic sensing)\nExpertise in MATLAB and familiarity with Python\nExperience with signal processing, preferably in MATLAB\nExperience with magneto-static simulations of CAD using FEA methods.\nExperience with analog and digital electronics\nExperience in system-level requirements and documentation\nBroad knowledge of engineering concepts (device behavior, data analysis, and systems modeling) and associated tools: MATLAB, JMP\nFamiliarity with control systems\nFamiliarity with digital camera and optics technology\nFamiliarity with CMOS image sensor technology\nExposure to optical concepts and optical design\nExcellent written and verbal communication skills\nGreat interpersonal skills - the ability to collaborate across groups\nSelf-motivated, able to lead projects independently\nDuties include performing the systems-level analysis and modeling of sensing and imaging systems, the design and construction of prototypes to guide systems development and assess user impact, and the definition of system level tests for parametric specifications. Candidates should be highly skilled in several of these areas:\n- Performing the systems-level analysis and modeling of sensing and imaging systems using Matlab\n- Defining and documenting systems architecture, requirements, use case analysis, and tests for camera features and technologies\n- Creating subsystem specifications by analyzing / modeling / characterizing electrical, optical, and optoelectronic components\n-  Defining subsystem and system level tests to characterize and/or guarantee parametric specifications\n-  Designing and performing laboratory experiments, and documenting the results\n-  Using computer control (Matlab, Python, etc..) to automate repetitive measurements.\n-  Managing project deliverables and schedules to meet commitments to product development teams\nBS/MS/PhD in a relevant field (EE or Physics) or equivalent\nRole Number: 200107323",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:37:52.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}