{
  "job": {
    "title": "Principal AI Consultant",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Infosys is seeking a\nfor its AI and Automation team. In this role, you will help manage Cognitive Automation Projects, participate in requirements gathering sessions, and work with team members to identify requirements such as AS IS Process and automation opportunities. You'll articulate and explain the architecture options to a technical audience (IT), including advantages and constraints, and will apply knowledge of technologies, applications, methodologies, processes and tools to manage end to end automation projects.\nRequired Principal AI Consultant Qualifications\nPreferred Principal AI Consultant Qualifications\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation.\nWith over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\nUSA\nArizona, Connecticut, Indiana, North Carolina, Rhode Island, Texas\nHartford, CT, Indianapolis, IN, Phoenix, AZ, Providence, RI, Raleigh, NC, Richardson, TX\nInfosys Limited\nArtificial Intelligence\nTechnology|Artificial Intelligence|Artificial Intelligence - ALL, Technology|Data Science|Machine Learning\nITL USA",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:22:10.000Z"
  },
  "company": {
    "name": "Infosys",
    "link": "https://in.linkedin.com/company/infosys"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Greater Hartford",
    "region": null,
    "postal_code": "06101",
    "street_address": null,
    "latitude": 41.77158,
    "longitude": -72.67429
  }
}