{
  "job": {
    "title": "Manufacturing Process Engineer - Electronics, PCBs",
    "industry": "Construction,Information Technology and Services,Financial Services",
    "description": "Job Title: Manufacturing Process Engineer\nSalary: $70-95K +/- based on experience\nLocation: Warrendale, PA - At times, you may have the option to work remote\nTop Reasons to Work with Us\nWe are a a high technology company and a recognized world leader in the design and manufacture of state-of-the-art electron microscopy equipment.\nWhat You Will Be Doing\nThe focus area of this position is on electronic system assembly and test. You will plan, direct, and coordinate the manufacturing process for our products. In addition, you will develop, evaluate, and improve manufacturing methods, utilizing knowledge of product design, materials/parts, tooling/production equipment capabilities, assembly methods, and quality control standards Provides manufacturing standards and process specifications to assure achievement of manufacturing and cost objectives.\nWhat You Need for this Position\nSo, if you are a Manufacturing Process Engineer $70-95K with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nAshley.Upchurch@CyberCoders.com\nAshley Upchurch - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:27:44.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Warrendale",
    "region": "PA",
    "postal_code": "15095",
    "street_address": null,
    "latitude": 40.65321,
    "longitude": -80.079506
  }
}