{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSenior Software Engineer\nWho is Mastercard?\nMastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential.\nOur decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.\nMastercard Cyber and Intelligence (C&I) develops and delivers world-class risk, security products, and services for Mastercard customers across the globe. As part of this organization, the Strategic Data Generation team is responsible for:\nRole\nThe Senior Software Development Engineer’s responsibilities include gathering user requirements, defining system functionality and writing code in various languages (Ruby, Elixir, and Python). Our ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment.\nUltimately, the role of the Senior Software Engineer is to build high-quality, innovative and fully performing software that complies with coding standards and technical design.\nExperiences\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T18:37:56.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 85000,
    "max_value": 139000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Salt Lake City",
    "region": "UT",
    "postal_code": "84101",
    "street_address": null,
    "latitude": 40.758476,
    "longitude": -111.888145
  }
}