{
  "job": {
    "title": "Technical Lead Manager, ML in Planning",
    "industry": "Information Technology and Services,Computer Software,Automotive",
    "description": "We're Cruise, a self-driving service designed for the cities we love.\nWe’re building the world’s most advanced, self-driving vehicles to safely connect people to the places, things, and experiences they care about. We believe self-driving vehicles will help save lives, reshape cities, give back time in transit, and restore freedom of movement for many.\nCruisers have the opportunity to grow and develop while learning from leaders at the forefront of their fields. With a culture of internal mobility, there's an opportunity to thrive in a variety of disciplines. This is a place for dreamers and doers to succeed.\nIf you are looking to play a part in making a positive impact in the world by advancing the revolutionary work of self-driving cars, join us.\nManeuvers Teams at Cruise build the core decision making technologies that drive Cruise’s fleet of autonomous vehicles (AV). Our algorithms that enable the AV drive safely and comfortably, when we should make a lane change, and which gap to take in an unprotected left. Together with your team, you will develop novel solutions to the planning problem, beyond the state-of-the-art in literature. You will work closely with Perception, Prediction, and other Robotics teams to integrate your features to the road to maximize impact.\nThe Tech Lead Manager (TLM) will grow a team of engineers while also collaborating with other Tech Leads, Engineering Managers, and TLM’s on the technical roadmap for Maneuvers. Your team will deliver new technologies to the road in a fast-paced research-to-production environment.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:58:00.000Z"
  },
  "company": {
    "name": "Cruise",
    "link": "https://www.linkedin.com/company/getcruise"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}