{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Consumer Electronics",
    "description": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. We are looking for the right Site Reliability Engineer to help us take our efforts to the next level.\nIn this role, you will be part of the core data infrastructure team for the Video Computer Vision organization. You will be a core contributor in our SRE team to develop and maintain a modern deployment system for cloud services and applications. You will be responsible for system bringup, deployment, reliability, security and service scalability. This role is highly multi-functional and you will work very closely with various highly skilled software development / ML teams developing cutting edge algorithms.\n3+ years in managing Site Reliability Engineering teams and supporting mission critical applications\n5+ years managing large fleet of *nix systems\n3+ years of Hybrid Cloud (data center, AWS, GCP, Azure)\n5+ years with configuration management tools such as Ansible or Terraform\n2+ years of programming experience (preferably Python)\n2+ years of managing Relational and NoSQL Databases\n2+ years of building fully automated CI-CD pipelines\nYou should also be self-directed, analytical, and work well in a team environment.\nYour core responsibility is to provide operational support of multiple cloud based applications with an emphasis on deployment, security, scalability and reliability running on AWS and Apple infrastructure. Operations tech stack: Ansible, Terraform, Go, Python, Prometheus, with some bash scripting. Common technologies include: Django, Docker, Kubernetes, Postgres, Redis, and Cassandra. We make have a hybrid infrastructure and make use Amazon Web Service extensively along with home-grown compute clouds.\nWhat qualities will make you successful? We are looking for a driven and dedicated Site Reliability Engineer possessing hands-on experience with:\n-  Core Operations experience with Linux, Ansible (or similar), Docker, Kubernetes, Postgres.\n-  Engage various software development teams to collaborate and build services from the ground up\n-  Expertise in networking with an emphasis on security\n-  Experience building systems both on-premise (data center) and on public cloud (AWS, GCP or Azure welcome)\n-  Working knowledge of deploying microservices (Django, Go, JVMs’)\n-  Have worked with schedulers such as Kubernetes, AWS ECS or EKS.\n-  Ability to write code in one of many high level languages (Python preferred)\n-  Vast experience using Linux with knowledge of kernel/system tuning\n-  Last but not least, you are battle-tested and have a few interesting production tales\nBS/MS in Computer Science/Computer Engineering (or equivalent experience).\nRole Number: 200238427",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-28T09:07:09.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}