{
  "job": {
    "title": "Software Development Engineer I",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSoftware Development Engineer I\nMastercard works to connect and power a sustainable and inclusive global economy. Software engineers at Mastercard build the systems that process transactions, analyze data and detect fraud to gain insight into the direction of the economy on behalf of our customers. We are focused on building simple, safe and smart solutions that instill trust in every interaction. Our industry expertise is enhanced by our commitment to being a force for good in the world and to doing well by doing good.\nMastercard relies on our global workforce to help us achieve our goal of building a sustainable, inclusive global economy. We cultivate an environment for all employees that respects their strengths, views, and experiences through a global and collaborative culture of inclusion and a sense of belonging.\nMastercard software engineering teams are obsessed with security, reliability, and performance and driven to deliver solutions that delight our customers. We are looking for talented software engineers to develop advanced technologies and applications that are revolutionizing payments.\ncustomers and important problems?\nthat attracts and retains the most talented engineers around the world?\nmatch our values such as flexible work hours, paid volunteer days,\ncharitable matching, and tuition assistance?\ngrowing your skills and career?\ndiversity, feel valued, respected, and who can bring their authentic selves to\nwork? Learn more at Mastercard’s Corporate Sustainability Report.\nThe Software Development Engineer I is a full time role within Mastercard Launch, a cohort based, graduate development program designed to build the skills you’ll leverage most as an innovator in the payments space. Eligibility requires that you currently be a graduating senior, pursuing a relevant degree.\ndesign, and maintainability.\nrollout.\ndependencies, build, and deployments.\ncompleting degree in December of 2021 or May 2022.\nfuture sponsorship to work in the US.\nscience concepts.\nas Java, JavaScript, C#, Python, etc.\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nEvery person working for, or on behalf of, Mastercard is responsible for information security.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T05:18:12.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}