{
  "job": {
    "title": "Software Engineer I",
    "industry": "Medical Devices",
    "description": "At Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\nDesign, develop and test software applications for programming implantable Boston Scientific products. Conducts work for research and/or development projects as part of a cross functional team.\nWhat we’re looking for:\n488758\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T02:08:33.000Z"
  },
  "company": {
    "name": "Boston Scientific",
    "link": "https://www.linkedin.com/company/boston-scientific"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Arden Hills",
    "region": "MN",
    "postal_code": "56304",
    "street_address": null,
    "latitude": 45.057384,
    "longitude": -93.18286
  }
}