{
  "job": {
    "title": "Senior Site Reliability Engineer (Remote)",
    "industry": "Information Technology and Services,Computer Software",
    "description": "This Jobot Job is hosted by Pegah Shakeri\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $150,000 - $200,000 per year\nWe’re looking for problem solvers, innovators, and dreamers who are searching for anything but business as usual. Like us, you’re a high performer who’s an expert at your craft, constantly challenging the status quo.\nWe are a fantastic company that believes in taking care of its employees. If hired, you will be rewarded with an offer that will include\nPosition Overview\nYou’ll be working on a new team that will create the observability systems and practice for our Cloud. Help build the practice as well as design, architect, build and manage systems for metrics, logs and tracing. You’ll also be an evangelist with stakeholders on SRE concepts and practices. Create a center of excellence for observability!\nWhat you’ll do\nCreate the observability architecture for metrics, logs, and tracing systems for our Cloud.\nDesign, Manage and operate the observability system.\nEvangelize tools and practices with engineering, architecture and customer service teams as a subject matter expert.\nBuild dashboards, and escalation systems for production engineering, customer service and engineering teams\nEnsure stakeholder teams are using the tools in the best way, make iterative improvements through problem solving, empathy and communication\n4+ years expertise with metrics, time-series, logging and/or distributed tracing\nThe team will offer Observability as a service\n3+ years experience with building observability systems using products like Elastic Search, splunk, datadog, Prometheus, TICK stack, Grafana, kibana (your choice)\n4-5+ years programming and software development – python, java, go, .NET or any other language\n1 or more years experience working with cloud providers like AWS, GCP or Azure\nWorking knowledge of SDLC concepts\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T21:06:59.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}