{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Defense &amp; Space",
    "description": "If you are a Senior Software Engineer with experience, please read on!\nWe are an employee owned company in the simulation space that is responsible for providing software solutions to both government and commercial industries! If you are looking for a great company with a ton of career growth and the chance to work on very interesting projects than this is the role for you! We offer a strong compensation package, are employee owned ( so what you say and do is actually implemented), great leadership team and a ton of career growth opportunities!\nWhat You Will Be Doing\nDesign and develop new customer facing applications\ndevelop critical software components\nLead the testing of developed subsystems\nManage the software configuration\nAssist in the development of test plans.\nWhat You Need for this Position\nSo, if you are a Senior Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nKeith.Ellis@CyberCoders.com\nKeith Ellis - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T17:41:01.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Oviedo",
    "region": "FL",
    "postal_code": "32766",
    "street_address": null,
    "latitude": 28.67029,
    "longitude": -81.20848
  }
}