{
  "job": {
    "title": "Data Engineer",
    "industry": "Information Technology and Services",
    "description": "HDFS, HBase, YARN, SPARK, Oozie and shell scripting\nBackground in all aspects of software engineering with strong skills in parallel data processing, data flows, REST APIs, JSON, XML, and micro service architecture.\nHands on design and development in Java/Core Java related technologies\nHands on design and development experience on big data related technologies - Spark, Hadoop, Hive, MapReduce & Webservices\nHands on experience in RDBMS technologies and concepts\ngood knowledge of writing SQL and interacting with RDBMS and NoSQL database - HBase programmatically.\nHands on experience working with Teradata, Netezza, Oracle, DB2 databases\nStrong understanding of File Formats - ORC, Parquet, Avro File formats.\nHands-on programming/scripting experience skills - UNIX shell, Python, Perl, and JavaScript.\nWorked on large data sets and experience with performance tuning and troubleshooting.\nKnowledge of Spark, Spark Streaming, Spark SQL, and Kafka is a plus.\nExperience working in the healthcare domain is a plus\nAbility to work in a fast-paced delivery environment\nStrong communicator\nAbility to work independently with minimum involvement from client SMEs\nExperience working with Databricks, Snowflake, Big Query or Red Shift\nExperience working on one or more cloud platforms such as GCP, AWS or Azure\nOverall information technology experience\nETL and ELT tools\nExperience as a data engineer",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:32:45.000Z"
  },
  "company": {
    "name": "Source Technology",
    "link": "https://uk.linkedin.com/company/source-technology-ltd"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}