{
  "job": {
    "title": "Leon Springs Seafood - Perishables Rep - Part-Time",
    "industry": "Food &amp; Beverages,Food Production,Retail",
    "description": "H-E-B needs energetic and motivated Partners willing to work hard and have fun while making our Customers feel welcome. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first.\nAs a Perishable Representative, you are responsible for providing a well-stocked and well-maintained department while providing superior customer service. You will prepare, package, and merchandise fresh product on a daily basis, while maintaining all department and food safety / sanitation standards.\nOnce you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that makes H-E-B The Greatest Omnichannel Retailing Company.\nHEART FOR PEOPLE... commitment to work hard to make sure People come first?\nHEAD FOR BUSINESS... a strong sense of how what you do affects our Customers and our success?\nPASSION FOR RESULTS... initiative to step up and do what needs doing?\nWhat is the work?\nPeels, cuts, and chops fresh fruits and vegetables\nPrepares fresh specialty drinks and food products specific to the Aguas department\nDesigns floral arrangements; provides a variety of fresh, quality products\nDesigns and executes merchandising programs\nTracks seasonal record when appropriate\nCuts, trims, and prepares meat for service meat counter and self-service counter\nEnsures proper product rotation and storage\nMaintains coolers and freezers\nWeighs, prices, and packages selections\nOperates power meat prep and process equipment\nStocks and rotates product to ensure freshness\nAssists floral department when needed\nCommunicates product knowledge to customers by explaining and providing samples\nCuts, wraps, and prices produce to be placed on sales floor\nMaintains signing program\nKnowledgeable about various fish and shellfish\nWeighs, prices, and packages selections\nMaintains coolers and freezers\nWhat is your background?\nDo you have what it takes to be a fit as an H-E-B Perishable Representative?\nCan you...\nreach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, twist, pinch, perform fine motor movements\n05-2014\nPerishables Rep\nVariable Hours\nPart-time\nUS-TX-San Antonio\nAug 2, 2021, 11:59:00 PM",
    "employment_type": "PART_TIME",
    "date_posted": "2021-08-03T03:27:24.000Z"
  },
  "company": {
    "name": "H-E-B",
    "link": "https://www.linkedin.com/company/heb"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Antonio",
    "region": "TX",
    "postal_code": "78266",
    "street_address": null,
    "latitude": 29.42517,
    "longitude": -98.49461
  }
}