{
  "job": {
    "title": "Software Systems Engineer II",
    "industry": "Automotive,Electrical/Electronic Manufacturing,Mechanical or Industrial Engineering",
    "description": "Collaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to\nwith us.\nToyota’s Connected Technologies Department is looking for a passionate and highly-motivated Software Systems Engineer II.\nThe primary responsibility of this role is to develop and design software to create maintainable, tested code while complying to Toyota’s SDLC practices.\nReporting to the Software Development Engineer - Manager, the person in this role will support the Connected Technologies department's objective to deliver amazing and personal cockpit experiences that are beautifully designed, relevant, intuitive, convenient, and predictive.\nDuring your interview process, our team can fill you in on all the details of our industry-leading benefits and career development opportunities. A few highlights include:\nOur success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. Respect for all is our North Star. Toyota is proud to have 10+ different Business Partnering Groups across 100 different North American chapter locations that support team members’ efforts to dream, do and grow without questioning that they belong. As a company that has been one of DiversityInc’s Top 50 Companies for Diversity and a member of The Billion Dollar Roundtable supporting minority and woman-owned suppliers for over 10 years, we are proud to be an equal opportunity employer that celebrates the diversity of the communities where we live and do business.\nApplicants for our positions are considered without regard to race, ethnicity, national origin, sex, sexual orientation, gender identity or expression, age, disability, religion, military or veteran status, or any other characteristics protected by law.\nHave a question or need assistance with your application? Check out the How to Apply section of our careers page on Toyota.com.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:19:35.000Z"
  },
  "company": {
    "name": "Toyota North America",
    "link": "https://www.linkedin.com/company/toyota-north-america"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}