{
  "job": {
    "title": "Data Engineer - New Grad",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Ripple is the world’s only enterprise blockchain solution for global payments. Today the world sends more than $155 trillion across borders, however, the underlying infrastructure is dated and flawed. Ripple solves this problem. We connect banks, payment providers, corporations, and digital asset exchanges via RippleNet to provide one frictionless experience to send money globally. Ripple’s distributed financial technology outperforms today’s banking infrastructure by driving down costs, increasing processing speeds and delivering end-to-end visibility into payment fees, timing and delivery.\nRipple is growing rapidly and we are looking for a results-oriented and passionate Software Engineer to help build our data platform. The platform enables everyone in the company to make data driven strategic decisions. You have a passion for the craft of software engineering and take pride in applying those skills to data challenges.\nRipple enables payments everywhere, every way, for everyone using the power of blockchain and crypto. By joining Ripple’s growing, global network (RippleNet), financial institutions can process their customers’ payments anywhere in the world instantly, reliably and cost-effectively. Banks and payment providers can use the digital asset XRP to further reduce their costs and access new markets. With offices in San Francisco, Washington D.C., New York, London, Mumbai, Singapore, São Paulo, Reykjavik and Dubai, Ripple has hundreds of customers around the world.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T05:58:48.000Z"
  },
  "company": {
    "name": "Ripple",
    "link": "https://www.linkedin.com/company/ripple-labs"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}