{
  "job": {
    "title": "Software Engineer (Remote)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Fleetio is a modern software platform that helps thousands of organizations around the world manage a fleet. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. We recently raised a $21M Series B round and are on an exciting trajectory as a company. You can learn more about it here.\nWe're looking for a Full Stack Software Engineer to join our growing engineering team and help us build amazing features for our customers. The ideal candidate is someone who has professional software development experience, takes high ownership, can work independently with minimal guidance, is highly driven and motivated to deliver value.\nWhat you'll be doing\nYou’ll collaborate with other Engineers, Product Managers, Designers, and the Customer Success team to implement features and help solve escalated support cases. About 80% of your time will be spent working on new features and 20% will be spent investigating and fixing bugs.\nWhat's in it for you\nOur team\nOur Engineering and Product teams are structured as autonomous squads that execute within one focal area toward a defined product vision. We're hardcore believers in easy-to-use software and our main goal as Product Engineers is to quickly and continuously deliver meaningful value to our customers. We've optimized our CI/CD tools and processes to get code into our production environments easily, resulting in an average of 40 deploys per week. Learn more about our Engineering Team and the interview process here.\nConsidered a plus\n.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T16:26:28.000Z"
  },
  "company": {
    "name": "Fleetio",
    "link": "https://www.linkedin.com/company/fleetio"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 46400,
    "max_value": 84800,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Birmingham",
    "region": "AL",
    "postal_code": "35226",
    "street_address": null,
    "latitude": 33.522858,
    "longitude": -86.80771
  }
}