{
  "job": {
    "title": "New Grad: Embedded Software Engineer",
    "industry": "Computer Networking,Electrical/Electronic Manufacturing,Telecommunications",
    "description": "Control Plane Embedded Software Development Engineer – San Jose - Full time\nWe believe in the power of people. We are a network strategy and technology company that is motivated by making a difference in people lives – their productivity, their creativity, their health and comfort. That’s why our engineers design and implement technologies that allow people to do great things.\nWith customer, proven capabilities, the Ciena Packet Control Plane team is enhancing and advancing Routing and MPLS capabilities to take advantage of worldwide market opportunities as Service Providers virtualize their networks, unify their legacy networks, and prepare for 5G. The next generation product delivers virtualized routing to integrate with SDN and NFV technologies.\nWe’re looking for a motivated and talented individual, interested in beginning their career in development and support for advanced Routing and MPLS features and learning SDN, NFV and virtualized routing systems. You will work with a diverse team contributing to next generation IP/MPLS routing capabilities for a virtualized routing system focused on service provider, carrier grade capability, scale and reliability.\nCiena is a network strategy and technology company with a passion to provide an experience, to you and our customers that is as rewarding as the outcome. We attract the best and brightest– those with outstanding talent, motivation, and the right attitude to contribute to our success. Our culture balances our openness and informality with professionalism and trust and is built on the foundation of our core values: Customer First, Integrity, Velocity, Innovation, and Outstanding People.\nCiena enables everyone to have a voice and a network that supports them while on the journey to discovering their passion and purpose. We trust each individual to do what they can to reach their full potential and make an impact on the business, whenever, wherever they are in the world. With Ciena’s highly innovative, forward-thinking business practices, we reward people for pushing the boundaries. Unlock your potential at Ciena!\nAs part of our commitment to diversity and inclusion, we want to foster an environment that values and respects all individual’s strengths, perspectives, ideas, and ability to meet the needs of our customers globally. Ciena values the diversity of its workforce and respects its employees as individuals, regardless of race, ethnicity, religion, gender, age, national origin, disability, sexual orientation, veteran or marital status or any other category protected by applicable law. We do not tolerate any form of discrimination. Ciena is also committed to compliance with all fair employment practices regarding citizenship and immigration status. If contacted in relation to a job opportunity, you should advise Ciena in a timely fashion of the specific accommodation measures required for you to be assessed in a fair and equitable manner.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T06:07:23.000Z"
  },
  "company": {
    "name": "Ciena",
    "link": "https://www.linkedin.com/company/ciena"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}