{
  "job": {
    "title": "Machine Learning Engineer 4",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nAdobe is looking for a Machine Learning Engineer who will apply AI and machine learning techniques to big-data problems to help Adobe better understand, lead and optimize the experience of its customers. Partnering with the business units, the candidate will be building various products that address challenging business problems through our customers’ full lifecycle, from customer analytics to marketing media optimization.\nBy using predictive models, experimental design methods, and optimization techniques, the candidate will be working on the research and development of exciting projects like real-time online media optimization, sales operation analytics, customer churn scoring and management, customer understanding, product recommendation and customer lifetime value prediction.\nIdeal candidates will have a strong academic background as well as technical skills including applied statistics, machine learning, data mining, and software development. Familiarity working with large-scale datasets and big data techniques would be a plus.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-19T22:01:55.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}