{
  "job": {
    "title": "data scientist - Seattle, WA or remote",
    "industry": "Consumer Goods,Food &amp; Beverages,Retail",
    "description": "Now Brewing - Data Scientists! #tobeapartner\nFrom the beginning, Starbucks set out to be a different kind of company. One that not only celebrated coffee and the rich tradition, but that also brought a feeling of connection. We are known for developing extraordinary leaders who share this passion and are guided by their service to others.\nThe data scientist will support growth at Starbucks by expanding the reach and scale of forecasting and measurement capabilities to support future planning and decision measurement. In this role, you’ll leverage statistical analysis, time series methods, machine learning, product development, data visualization, and storytelling. Day-to-day work will balance providing short-term analytical guidance and supporting long-term forecasting and measurement product development. You will also have the opportunity to collaborate and immerse with teams across Starbucks, including finance, demand planning, store development, marketing, and loyalty.\nAs a data scientist, you will…\nJoin us and be part of something bigger. Apply today!\nStarbucks and its brands are an equal opportunity employer of all qualified individuals.\nWe are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.\nQualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-28T00:00:00.000Z"
  },
  "company": {
    "name": "Starbucks",
    "link": "https://www.linkedin.com/company/starbucks"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 70500,
    "max_value": 135000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}