{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Maze is a Series A funded startup building the future of rapid testing for modern teams. We're backed by some of the world's best funds and have an extensive advisory network.\nWe're on a mission to empower modern teams to build better user experiences by testing and learning rapidly with real users. To do this, we've partnered with the world's biggest design tools, including Adobe XD, Figma, InVision, Sketch, and Marvel. We power over 40,000 brands globally, including IBM, Logitech, Pipedrive, Uber, Greenpeace, and Braze.\nWe're a fully remote team working across 23 countries. You'll be joining a passionate team whose resumes include Canva, Figma, GitLab, Google, InVision, Typeform and Zendesk.\nWhat you will do\nAs a part of the Site Reliability Engineering (SRE) team you will work to build design and architect the infrastructure of Maze. Your day-to-day will be working to ensure our platform applications are reliable and healthy.\nYour scope will be as follow :\nTechnologies\nHere is our technology stack we use within our team\nMandatory skills are AWS Cloud, Kubernetes. Programming languages required are node.js and golang.\nConsider this our wish-list. We know there will be great candidates that don't meet every one of these criteria—if you're passionate about the role and feel that your experience prepares you to do it, we'd love to hear from you.\nWhy Maze is unique",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-26T17:11:26.000Z"
  },
  "company": {
    "name": "Maze",
    "link": "https://fr.linkedin.com/company/mazedesign"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}