{
  "job": {
    "title": "Software Engineer",
    "industry": "Capital Markets,Computer Software,Financial Services",
    "description": "Maven is building the university of the future - empowering the world's creators to offer cohort-based courses directly to their audiences. Courses on Maven have community at their core, focus on active learning, and are available anywhere in the world.\nOur team has raised $25 million from incredible investors including Andreessen Horowitz, First Round, Naval, and Arlan Hamilton, and we've launched sold-out courses with instructors like Li Jin, Anthony Pompliano, Lenny Rachitsky, and Sahil Lavingia.\nWe're the leading player in a massive and growing market, but are still early enough for you to make a big impact. Join us!\nThe Role\nYou will be one of the first 10 engineers at the company, owning features end-to-end, becoming an expert on parts of our product, and building the platform that powers the best cohort-based-courses on the market.\nIf you don't meet these criteria but are still excited about Maven, reach out anyway - we'd love to hear from you.\nWe're growing quickly but we're still a startup, and you'll have the opportunity to shape how we work. So far we've looked for teammates who:\nCome Build With Us\nWe're a fully remote company with employees in New York, Toronto, Austin, the Bay Area, and beyond. Anyone within 1 hour of US time zones is welcome.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T01:27:00.000Z"
  },
  "company": {
    "name": "Maven",
    "link": "https://www.linkedin.com/company/maven-hq"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}