{
  "job": {
    "title": "Senior GNC Engineer - Launch Vehicle and Spacecraft - GNC",
    "industry": "Defense &amp; Space",
    "description": "If you are a Senior GNC Engineer - Launch Vehicle and Spacecraft with experience, please read on!\nWhat You Will Be Doing\nDevelop the algorithms that run within the flight software to control rockets and orbital spacecraft\nWrite simulations, running on high-powered PC to simulate the physics of the rocket, flying it virtually into orbit and port that into hardware in the loop test bed, including real flight hardware.\nWhat You Need for this Position\nSo, if you are a Senior GNC Engineer - Launch Vehicle and Spacecraft with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRichard.Marion@CyberCoders.com\nRichard Marion - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:11:56.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Oakland",
    "region": "CA",
    "postal_code": "94612",
    "street_address": null,
    "latitude": 37.80483,
    "longitude": -122.27248
  }
}