{
  "job": {
    "title": "Software Engineer I",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "NCR Corporation (NYSE: NCR) is a leading software- and services-led enterprise provider in the financial, retail and hospitality industries. NCR is headquartered in Atlanta, Georgia, with 36,000 employees globally. NCR is a trademark of NCR Corporation in the United States and other countries.\nSoftware Engineer - Dot Net developer\nLocation- Addison, TX\nWorking on the NCR Payments Gateway Team by working with team of software engineers to provide new features and functionality to the existing and next generation applications\nSupporting production by triaging and managing hot fix releases and defects throughout the development life cycle including testing and deployment.\nFacilitate requirements refinement and design sessions and translate information gathered in those sessions into business processes, system design documents, and models\nWorking with various communication and security protocols to improve the quality of the product.\nREQUIRED (0-3 Years of Experience)\nC#.NET Development\nWeb UI Development (HTML, CSS, etc.)\nDatabase Development (MSSQL, TSQL)\nStored Procedures, Triggers, Joins, Unions, Analyzing Execution Plans, Query Debugging, Creation and Maintenance of Indexes, Replication Methodologies\nObject-Oriented Programming\nAutomated Unit Testing (NUnit, etc.) and understanding of QA\nAgile methodologies and frameworks (Scrum, Kanban, Lean, etc.)\nMulti-Threading\nGarbage Collection\nMemory Management\nPayment Processing Systems\nReal Time Transaction Processing Systems\nWindows and/or Linux OS Administration\nScripting Languages (Powershell, Python, Bash, etc)\nDesign Patterns (Pub/Sub, Asynchronous/Synchronous, Singleton, Factory, Broker, MEP (Message Exchange Patterns), etc.)\nNginx/Kestral\nISTIO/Service Mesh\nVisual Studio 2019 or Eclipse IDE\nPutty\nPostman\nFiddler\nGIT\nBasic Networking and Understanding of Load Balancing Algorithms\nBusiness Driven Development (BDD) and Test Driven Development (TDD) Practices\nSOLID Programming Principles\nDelivering Enterprise Level Solutions\nStrong communication skills and desire to learn.\nOffers of employment are conditional upon passage of screening criteria applicable to the job.\nIntegrated into our shared values is NCR's commitment to diversity and equal employment opportunity. All qualified applicants will receive consideration for employment without regard to sex, age, race, color, creed, religion, national origin, disability, sexual orientation, gender identity, veteran status, military service, genetic information, or any other characteristic or conduct protected by law. NCR is committed to being a globally inclusive company where all people are treated fairly, recognized for their individuality, promoted based on performance and encouraged to strive to reach their full potential. We believe in understanding and respecting differences among all people. Every individual at NCR has an ongoing responsibility to respect and support a globally diverse environment.\nTo ALL recruitment agencies: NCR only accepts resumes from agencies on the NCR preferred supplier list. Please do not forward resumes to our applicant tracking system, NCR employees, or any NCR facility. NCR is not responsible for any fees or charges associated with unsolicited resumes.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-16T11:25:14.000Z"
  },
  "company": {
    "name": "NCR Corporation",
    "link": "https://www.linkedin.com/company/ncr-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Addison",
    "region": "TX",
    "postal_code": "75001",
    "street_address": null,
    "latitude": 32.968605,
    "longitude": -96.83004
  }
}