{
  "job": {
    "title": "Remote Senior Software Engineer (EC2, Docker, Rancher)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Senior Software Engineer coming from a background including AWS (EC2), Docker & Rancher - please read on!\nThis will be a full time role offering a generous base salary + 5-10% performance bonus + amazing (full) benefits!\nWe have offices located in Stamford, CT and Dana Point, CA. This role will be REMOTE.\nOur team is about 70 people in size (We've been steadily growing since our inception 13 years ago!)\nWe are a profitable, web-based financial research and media company providing information centering around investment.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a Senior Software Engineer (EC2, Docker, Rancher) looking for fully remote, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nBobby.June@Optello.com\nBobby June - Recruiting Manager - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:26:03.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Stamford",
    "region": "CT",
    "postal_code": "06928",
    "street_address": null,
    "latitude": 41.051926,
    "longitude": -73.539474
  }
}