{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
    "description": "StackPath is a platform of secure Internet services built at the cloud's edge. StackPath services enable developers to build protection and performance into any cloud-based solution—from apps, to games, web sites, and beyond—without needing cloud security and delivery expertise of their own. More than 800,000 customers already use StackPath services, ranging from early-stage enterprises to Fortune 100 organizations. Headquartered in Dallas, Texas, StackPath has offices across the U.S. and around the world.\nFor more information follow StackPath at www.fb.com/stackpathllc and www.twitter.com/stackpath.\nThe StackPath Site Reliability Engineering (SRE) team combines software, systems and network engineering to deploy and run a portfolio of high-performance edge services including CDN, WAF and Compute. SRE’s daily focus is on the availability, change velocity, performance and capacity of customer-facing services and supporting internal systems.\nOn the SRE team you will have the opportunity to apply your experience against systems at scale – where a single week can involve shifting terabits of traffic between sites, deploying configuration changes to shave milliseconds off billions of requests, or enabling a new software feature on thousands of systems using automated tooling you designed and built.\nThis role will report to our: VP Site Reliability Engineering\nIf your experience and qualifications match our current needs, a member of our human resources team will contact you. We look forward to hearing from you.\nStackPath collects and processes personal data submitted by job applicants in accordance with our Privacy Policy",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-14T01:30:50.000Z"
  },
  "company": {
    "name": "StackPath",
    "link": "https://www.linkedin.com/company/stackpath"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}