{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Banking,Financial Services",
    "description": "As a Barclays App Support Lead you will be working in the Fraud Landscape in Cards & Payments Run the Bank Team within Dedicated Services organization and will be directly accountable for providing L2 application support. You will get the opportunity to provide SME assistance to other Technology & Operations Teams, driving project engagement to onboard new changes into production and continually identify opportunities to automate and make Cards & Payments Technology estate reliable.\nBarclays is one of the world's largest and most respected financial institutions, with 329 years of success, quality and innovation behind us. We've helped millions of individuals and businesses thrive, creating financial and digital solutions that the world now takes for granted. An important and growing presence in the USA, we offer careers providing endless opportunity.\nAt Barclays, we are proud to be redefining the future of finance and here at Whippany we are defining the future of the workplace and the future of the way we work and live. We are creating a unique community, one of four strategic tech-enabled hubs that will redefine opportunity for everyone who works here. Whatever you do at Whippany, you’ll have every chance to build a world-class career in this world-class environment.\n90282603",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T17:16:40.000Z"
  },
  "company": {
    "name": "Barclays",
    "link": "https://uk.linkedin.com/company/barclays-bank"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 96500,
    "max_value": 130000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Whippany",
    "region": "NJ",
    "postal_code": "07981",
    "street_address": null,
    "latitude": 40.824894,
    "longitude": -74.41804
  }
}