{
  "job": {
    "title": "Software Engineer",
    "industry": "Internet",
    "description": "Software Engineer FreeWill is an award-winning, social-good startup that has raised more than $2 billion for high impact nonprofits since we were founded in 2017. We’ve been featured in the New York Times, Forbes, Oprah’s magazine, and have even been named to Town & Country’s “Top 50 Philanthropists” list. All of this is because we’ve figured out how to make some powerful (but complicated!) ways to donate much easier and more accessible. Our products make things easier for the donors who want to change the world and for nonprofits doing heroic work around the planet. In the last 3 years, we’ve grown from 5 people to 95+ (all smart, tenacious, and kind), and continue to grow quickly. We’d love to have you be a part of this adventure. Job description We are looking for an ambitious software engineer who wants to make impact at a mission-driven company. This role can be remote or based out of New York City. Competitive comp & equity. Flexible start date. Unfortunately, we can’t sponsor H1Bs at this time. Roles & Responsibilities Work on a modern stack, including React, Node.js, TypeScript, PostgreSQL, and AWS Own the design and development of new features for FreeWill web applications Learn and grow in a collaborative environment, sharing knowledge through code reviews, pair programming, 1-1 conversations, and broader team trainings Interact closely with a diverse team across legal, growth, design, and product Contribute ideas to improve our product, technology, and team practices Gain knowledge of end-of-life planning and nonprofit fundraising – what currently is working, what is not, and what tech can do to help fix it Technical Skills 2+ years professional experience Bachelor’s degree in Computer Science or related technical field, or equivalent training, fellowship, or work experience Familiarity with databases, API design, automated testing, debugging, and web front ends Other Important Traits Intense curiosity Scrappiness and grit Focus on continuous learning Comfort with ambiguity Benefits In addition to helping raise $1T for high impact nonprofits and a kind and joyful work environment, full time employees at FreeWill are eligible for the following benefits: Work from home $120 monthly stipend to outfit your home office or cover utility bills Unlimited PTO Staff holidays and FreeDays (periodic one day office closures to rest and refresh) Company stock options 401k Medical/Dental/Vision (some single coverage medical plans are 100% employer paid, subsidized rates for spousal, parent-child, and family coverage) Free One Medical membership Paid parental leave Book policy: We’ll cover any reasonably priced books that will make you better at your job (i.e how to excel in sales) or improve the FreeWill community (i.e. books on anti-racism). FreeWill is an equal opportunity employer and we value diversity. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are a remote-first company that’s able to hire in 47 states and D.C. Unfortunately, we are unable to hire in Colorado, Alabama, or Louisiana at this time. We also can’t sponsor working visas, so all applicants will need to have work authorization in the US. Excited about our mission? Success in serving nonprofit partners requires our dedication to building a diverse, equitable, and inclusive team. We encourage people from underrepresented backgrounds and all walks of life to apply. We can’t wait to learn with and from you.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T00:56:15.000Z"
  },
  "company": {
    "name": "FreeWill",
    "link": "https://www.linkedin.com/company/freewill"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 83600,
    "max_value": 180400,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York City Metropolitan Area",
    "region": null,
    "postal_code": "10021",
    "street_address": null,
    "latitude": 40.748295,
    "longitude": -73.98556
  }
}