{
  "job": {
    "title": "Senior Software Engineer (Node.js)",
    "industry": "Entertainment",
    "description": "NBCUniversal's Operations & Technology, Media Engineering group is responsible for the design, implementation, and operation of services key to the processing and delivery of content for NBCUniversal’s consumer-facing digital products and experiences. Our group of product managers, software engineers, software quality engineers, and operations folks are based in New York City Area, Los Angeles, Belarus and points in between. We are looking for an experienced  Node.js  software engineer with a broad background to participate in the ongoing development of a very large microservices-based system. We have a very collaborative environment and a distributed team and we need an experienced engineer who can influence and educate their fellow technologists. We are a mature Agile/Scrum shop and work in two-week sprints. The  Senior Software Engineer  will: • Develop highly scalable services following a microservice architecture. • Design, develop and deliver software on progressive and growing platforms, primarily using  AWS, Lambda and Node.js. • Implement and troubleshoot, suggest necessary features and identifying enhancement opportunities. • Complete tasks as part of an agile team and adapt to dynamic business requirements. • Closely partner with other Software Engineers and Software Quality Engineers and engage in team efforts. • Work with architecture and engineering teams to produce high-quality technology solutions. Qualifications/requirements: • Must have a bachelor's degree in computer science or equivalent work experience. • Must have  5+ years  of experience in the field. • Must have hands-on experience building serverless applications using  AWS, Lambda and Node.js  using best practices. • Must have hands-on experience with AWS cloud infrastructure as well as different AWS services such as  Lambda, SQS, SNS, Kinesis, DynamoDB, Elasticsearch, API Gateway, CloudFormation • Must have hands-on experience with  NoSQL  databases as well as with relational databases. • Must have hands-on experience building low latency and high throughput transactional services with continuous integration and automation testing. • Must have experience leading software development teams that have automated QA testing in an Agile/Scrum setting. • Must have experience collaborating and contributing insights to solution design, ensuring success of the product and adherence to enterprise architecture principles.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-12T00:03:50.000Z"
  },
  "company": {
    "name": "NBCUniversal Media, LLC",
    "link": "https://www.linkedin.com/company/nbcuniversal-inc-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 92500,
    "max_value": 169000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Englewood Cliffs",
    "region": "NJ",
    "postal_code": "07632",
    "street_address": null,
    "latitude": 40.880516,
    "longitude": -73.951256
  }
}