{
  "job": {
    "title": "Principal Engineer Test",
    "industry": "Civil Engineering",
    "description": "US CITIZENSHIP REQUIRED FOR THIS POSITION: Yes\nRELOCATION ASSISTANCE: No relocation assistance available\nCLEARANCE TYPE: Secret\nTRAVEL: No\nPeraton Global Health & Financial Solutions sector is seeking an experienced software test engineer to join our team of qualified, diverse software development professionals. The qualified applicants will become part of Peratons application development team helping the Financial Crimes Enforcement Network (FinCEN) safeguard the U.S. financial system from the abuses of financial crime. FinCEN carries out its mission by receiving and maintaining financial transaction data, analyzing and disseminating that data for law enforcement purposes, and building global cooperation with counterpart organizations in other countries and associated international bodies. The Peraton team currently supports FinCENs on premises Bank Secrecy Act (BSA) Electronic Filing System by providing application development and operation services to collect, validate, and process financial transaction data from various types of financial organizations throughout the US and oversees. FinCEN has expanded the scope of the above system to include the collection of Beneficial Ownership data (as part of the Corporate Transparency Act included in the 2021 National Defense Authorization Act) within a secure AWS gov-cloud environment.\nThe candidate is experienced in writing software to validate the quality of software systems and front-end functionality, as well as some experience in either front-end or back-end development in J2EE. The candidate shall support the lead developer with front-end and/or back-end development as needed and create automated tests, tools and systems to make sure that products and processes run as expected.\nTo be considered for this position, the candidate must minimally meet the knowledge, skills, and abilities listed below:\nWe are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:46:27.000Z"
  },
  "company": {
    "name": "Peraton",
    "link": "https://www.linkedin.com/company/peraton"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": "USD",
    "min_value": 64800,
    "max_value": 77100,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Vienna",
    "region": "VA",
    "postal_code": "22184",
    "street_address": null,
    "latitude": 38.903484,
    "longitude": -77.26282
  }
}