{
  "job": {
    "title": "Software Engineer (Early Career - Python)",
    "industry": "",
    "description": "At Aquatic, we are actively recruiting for a Software Engineer in our Chicago office. In this role you will work within our research technology team, giving you the opportunity to learn from some of the best engineers in the financial services industry. Youll work collaboratively to build systems that are critical to the success of our company.\nAquatic Capital\nAquatic is a quantitative trading and investment company recently launched by Jon Graham. Prior to founding Aquatic, Jon was a Partner and Senior Managing Director at Citadel, where he worked for more than 13 years. At Citadel, Jon held numerous senior positions over the years, including head of Statistical Arbitrage and Equity High Frequency, culminating in leading the highly successful Global Quantitative Strategies business.\nUncluttered by legacy platforms and processes, Aquatic develops systematic investment strategies, enabled by a leading-edge research and development platform. The vision is simple: to build a world class, quantitative trading company with a collaborative team of highly capable researchers and engineers.\nThis role represents a unique opportunity to join a distinguished and hugely successful quantitative investment manager at the foundational level of building a world class operation from scratch. The firms culture will be shaped by collaboration, meritocracy, ambition, and calm determination.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-02T16:43:19.000Z"
  },
  "company": {
    "name": "Aquatic Capital Management",
    "link": "https://www.linkedin.com/company/aquatic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}