{
  "job": {
    "title": "Data Engineer",
    "industry": "Nonprofit Organization Management,Financial Services,Real Estate",
    "description": "ICAST is a national non‐profit that delivers green upgrades in multifamily housing that tackles our affordable housing, climate change and social equity crisis. ICAST is the nation’s premier service provider to apartment communities that serve low-to-moderate income (LMI) residents. We value education that motivates people to act, leading to results that foster local economic development, environmental stewardship, and social responsibility in under‐served communities. By 2025, we aim to serve 100,000 LMI households annually by reducing their utility costs by $270 Million, reduce Carbon emission by 1.5 million tons, create 2,000 sustainable jobs and invest over $100 Million in local communities. We are looking for the smartest, entrepreneurial, and committed new team members who wish to make a difference.\nYou consider yourself an overachiever. Are looking to leave your mark on society. Are an out-of-the-box thinker. Strive to be efficient and productive at all times. Are dedicated to saving the planet and helping others less fortunate than you. And are passionate about ICAST’s mission.\nYou are a Data Engineer with solid technical and interpersonal skills responsible for developing and managing business intelligence and analytics solutions critical to running our business. This includes solution design and development, data acquisition and development of all queries and visuals to provide solutions that are intuitive, intelligent, and interactive. You will be responsible for writing advanced queries and developing reporting capabilities not limited to dashboards, reports or data extracts. The Data Engineer will be part of all phases of the development lifecycle including gathering and analyzing user/business requirements, system design, implementation, testing, and operational support.\nUSA - Remote\nIT Manager\nMid-senior\n70K-120K (DOE)",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-24T05:07:40.000Z"
  },
  "company": {
    "name": "ICAST (International Center for Appropriate &amp; Sustainable Technology)",
    "link": "https://www.linkedin.com/company/icast"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Denver",
    "region": "CO",
    "postal_code": "80247",
    "street_address": null,
    "latitude": 39.738453,
    "longitude": -104.984856
  }
}