{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Automotive,Financial Services",
    "description": "Who We Are\nCollaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to Dream. Do. Grow. with us.\nWho We’re Looking For\nThe Systems Design & Architecture Engineer will be responsible for monitoring and gathering customer feedback on services – understand what our customers want and why they use our products. In addition, this person is also responsible for planning future generation services and define use cases, manage product development lifecycle from requirements to production support.\nWhat You’ll Be Doing\n• Handle communication with Toyota and Lexus division members, research issues.\n• Perform proof of concepts, handle new service launches and kaizen opportunities.\n• Coordinate changes and product improvements with other platforms.\n• Partner with development teams and technology leads to work on sequence diagrams, architecture, API development, specifications.\n• Understand customer experience of current services, identify areas of improvements, drive change across systems.\n• Monitor service performance to determine issues, root causes, and corrective actions.\n• Create, update, and maintain product documentation, including product decks, test plans, interface specifications, and reporting.\n• Responsible for improvements to remote services products in the Toyota and Lexus application.\n• Responsible for the end-to-end customer experience for new product launches.\n• Responsible for handling and owning issues that require big picture thinking and decision-making.\n• Coordinating with stakeholders for joint decisions and making critical improvements.\n• Being able to frame business challenges and work cross-functionally to solve those problems using innovative approaches.\n• Adopt and adapt to new technologies, tools, agile processes as needed.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T19:24:22.000Z"
  },
  "company": {
    "name": "Toyota North America",
    "link": "https://www.linkedin.com/company/toyota-north-america"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Plano",
    "region": "TX",
    "postal_code": "75093",
    "street_address": null,
    "latitude": 33.019695,
    "longitude": -96.697586
  }
}