{
  "job": {
    "title": "DevOps / Site Reliability Engineer",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\nAre you a passionate operations engineer? Want to work on solving large scale problems? Come join us to help build best in class CI/CD solutions and in implementing complex software applications across Corporate Systems Engineering at Apple. Our DevOps engineering team develops and deploy software which ensures that Apple’s corporate applications are delivered accurately, reliably and with speed. We support both open source and home-grown technologies to provide internal Apple developers with the best possible CI/CD platform. In this role you will have the unique opportunity to own and improve tooling for best of the class large-scale CI/CD platform and help build modern software systems.\nThe DevOps engineering team is part of the engineering operations team for corporate systems. This team is directly responsible to build, manage and expand on tools that enable software releases in a fast paced enterprise environment. We operate in on-premise, private, and public cloud (AWS, GCP etc.) environments. As a DevOps Engineer, you will be partnering closely with software development teams and infrastructure teams. And, be responsible for building and supporting CI/CD platforms, automating repeatable infrastructure needs, environment buildout, software build and releases, creating automated solutions, installing and configuring application software, and upkeep of systems through patching, upgrades, monitoring, and maintenance support.\nExperience designing and working with modern Continuous integration and deployment solutions.\n1-3 years of experience in DevOps/SRE, systems engineering, build/release/deployment automation.\nExperience with hosted services in a high-volume enterprise environment\nImplementing applications in private/public cloud infrastructure and container technologies, like Kubernetes and Docker.\nExceptional analytical and troubleshooting skills in complex Unix/Linux systems environment and applications implementations.\nExperience designing and building CI/CD pipeline with tools such as Terraform, CloudFormation, Ansible, and Kubernetes toolset (e.g, kubectl, kustomize).\nExcellent understanding of microservices architecture.\nDevelop full-fledged software tooling to deliver programmable infrastructure & environments (infrastructure as code).\nDemonstrated ability to write programs using a high-level programming languages or scripting, such Java, Python, Shell, Golang.\nExperience with logging infrastructure and using tools such as Splunk, Logstash, or Kibana.\nExperience with networking load balancers such as Ngnix, Netscaler, HAProxy.\nOperational experience with public cloud (AWS, GCP) platforms through migrations, scaling operations.\nBackground building distributed, server-based infrastructure supporting a high volume of transactions in a mission critical environment.\nDemonstrated ability to work on small, focused teams to complete critical milestones under pressure with tight deadlines.\nExperience with Kafka, MongoDB, Cassandra and Oracle is highly desirable.\nPassion for driving automation into how software development and delivery is done.\nExperience on Mac OS, iOS (mobile apps) desirable.\nExcellent written and verbal communication skills.\nPartner with global teams, development teams and infrastructure teams.\nIn-Depth knowledge on AWS services including VPC, IAM, EC2, EKS, CloudWatch, S3, RDS, Route53.  Experience in similar services for GCP is preferred.\nWorking experience with Spinnaker or Tekton is a plus.\nAWS Cloud Architect and/or Certified Kubernetes Administrator (CKA) certifications are highly desired.\nWorking in DevOps engineering team will expose you to a variety of challenges. Our team enables CI/CD capabilities for large numbers of applications by building, tuning and supporting highly available system. You will be working closely with U.S. and India based teams and in a multi-vendor resourcing model. As member of this team you will be empowered to work across multiple tools to improve and expand the capabilities the team has to offer. This may include:\nDesign and implement new software to streamline manual operations\nTriage production issues along with other operational team members\nConduct root cause analysis of critical issues\nExpand the capacity and performance of the system\nMaintain primarily Linux and other types of systems\nBachelor’s in Computer Science or equivalent.\nThe ideal candidate will be a self-motivated, hands-on, dynamic and detail oriented individual with a strong technical background.\nRole Number: 200281860",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-17T05:28:15.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}