{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Management Consulting",
    "description": "CapTech is a team of master builders, creators, and problem solvers who help clients grow efficient, successful businesses. We unite diverse skills and perspectives to transform how data, systems, and ingenuity enable each client to advance what’s possible in a changing world.\nAs perceptive partners, our U.S-based consultants find inspiration in the unknown and enjoy getting our hands dirty solving our clients’ myriad of challenges. Across industries and business goals, we fuse technical depth and analytical prowess with creative savvy to move clients forward. This drive helps each organization use technology, management, and insight to turn ideas into action. Together, we create outcomes that exceed the expected — which is one of the reasons we’ve been on the Inc. 500/5000 list for over a decade.\nCapTech Machine Learning Engineers are responsible for designing and implementing data-driven solutions for our clients, with specific focus on building and deploying scalable machine learning systems in enterprise environments. CapTech employees enjoy a collaborative environment and have many opportunities to learn from and share knowledge with other CapTech analysts, architects, and our clients.\nAdditional Information\nWe provide challenging and impactful opportunities in our client work and internal teams, while keeping individual interests in mind. We want everyone at CapTech to be able to envision a lifelong career here, which is why we offer a variety of career paths based on your skills and passions. As a CapTecher, you will experience exciting and rewarding roles that help you grow and make a difference, while having fun along the way.\nAt CapTech we offer a competitive and comprehensive benefits package including, but not limited to:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T03:08:00.000Z"
  },
  "company": {
    "name": "CapTech Consulting",
    "link": "https://www.linkedin.com/company/captechlistens"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}