{
  "job": {
    "title": "Software Engineer, New Grad",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Contracts are the atomic unit of business - everything important that a company does involves a contract: sales, purchases, hires, everything. Every company, in every country, in every industry runs on contracts, but managing these contracts slows companies down and costs them millions of dollars.\nAt Ironclad, we’re reimagining contracts. We’re turning them from rate limiters on the business to accelerators. Ironclad is the #1 contract lifecycle management platform for innovative companies. L’Oréal, Staples, MasterCard, and other leading innovators use Ironclad to collaborate and negotiate on contracts, accelerate contracting while maintaining compliance, and turn contracts into critical carriers of operational business intelligence. It’s the only platform flexible enough to handle every type of contract workflow, whether a sales agreement, an HR agreement or a complex NDA.\nIronclad’s innovation and work culture has been recognized by Forbes’ 50 Most Promising AI Companies in 2021, Fortune’s Best Small & Medium Workplaces 2021, Fast Company’s 2020 Best Workplaces for Innovators, Glassdoor’s best Machine Learning startup, Enterprise Tech 30 List, and is backed by leading investors like Accel, Y Combinator, Sequoia, and Bond. For more information, visit www.ironcladapp.com or follow us on LinkedIn and Twitter.\nEngineering @ Ironclad\nAs an Engineering New Grad, you’ll have the opportunity to learn quickly and grow with a world-class team of engineers. You'll work cross-functionally to identify business problems and architect, build, and verify solutions. You'll build a platform that lets lawyers scale themselves and their businesses 100x more effectively. At Ironclad, we’ve built a product that brings a two thousand year old profession into the digital age, and you’ll play a pivotal role in driving the foundation forward.\nWe seek engineers with strong coding fundamentals and a track record of shipping high quality products. We work in a highly collaborative environment, and strive to foster a positive, inclusive culture. We’re in hypergrowth, tripling our team size at all levels and offer remote work flexibility. If you’d like to join us on our mission to build the product that legal teams love, let’s talk!\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-15T05:05:05.000Z"
  },
  "company": {
    "name": "Ironclad, Inc.",
    "link": "https://www.linkedin.com/company/ironclad-inc-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}