{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Apparel &amp; Fashion,Internet,Retail",
    "description": "In this role, you will be building the next generation ML systems that transform the way people find what they love. As a Machine Learning Engineer, your focus will be on building, productionizing and scaling of machine learning models, and promoting engineering excellence.\nYou will get the opportunity to work with data scientists and engineers, as well as lead work cross-functionally with Strategy, Product, Merchandising, Marketing, and Engineering partners to build and enhance those capabilities.\nMultiple teams are looking for machine learning engineers.\nAt Stitch Fix, we’re about personal styling for everybody and we believe in both a service and a workplace where you can be your best, most authentic self. We’re the first fashion retailer to combine technology and data science with the human instinct of a Stylist to deliver a deeply personalized shopping experience. This novel juxtaposition attracts a highly diverse group of talented people who are both thinkers and doers. All of this results in a simple, powerful offering to our customers and a successful, growing business serving millions of men, women, and kids. We believe we are only scratching the surface on our opportunity, and we’re looking for incredible people like you to help us carry on that trend.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-12T04:09:10.000Z"
  },
  "company": {
    "name": "Stitch Fix",
    "link": "https://www.linkedin.com/company/stitch-fix"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}