{
  "job": {
    "title": "Senior Site Reliability Engineer, SRE",
    "industry": "Internet",
    "description": "Twitter is what’s happening and what people are talking about right now. For us, life's not about a job, it's about purpose. We feel real change starts with conversation. Here, your voice matters. Come as you are and together we'll do what's right (not what's easy) to serve the public conversation.\nSREs (Site Reliability Engineers) work on improving the availability, scalability, performance and reliability of Twitter’s production services.\nOur core infrastructure receives hundreds of millions of tweets per day and serves tens of billions of API requests. We also serve over 2+ billion search queries per day, render 100M+ ad impressions, and process hundreds of terabytes of log and interaction data daily!\nAs a member of the organization you will be dedicated to improving the reliability of our end-to-end platform. Your work will integrate directly with Twitter's products. You will investigate sophisticated and difficult operational issues; from the software, systems, automation, and process perspectives. You will understand the challenges around integrating disparate infrastructures into a new facility, processes and procedures.\nThis is an opportunity to work with open-source technologies and the wider SRE community, and actively participate in the vision to move away from high operational cost tasks such as break/fix, cluster migrations, new service buildouts, abuse, etc. Our team contributes to services that can shrink and expand based on demand, self heal, automatically rollout, etc.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T01:16:57.000Z"
  },
  "company": {
    "name": "Twitter",
    "link": "https://www.linkedin.com/company/twitter"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}