{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Commercial Real Estate,Computer Software",
    "description": "Berkadia, a joint venture of Berkshire Hathaway and Jefferies Financial Group, is a leader in the commercial real estate industry, offering a robust suite of services to our multifamily and commercial property clients. Powered by deep relationships and industry-changing technology, our people sell, finance, and service commercial real estate, providing support for the entire life cycle of our clients’ assets. Our unique ownership structure allows us to put the client’s interests first and creates a marketplace that delivers a superior experience.\nThe Software Engineer will provide technical leadership within team responsible for architecting, adapting, and implementing software solutions that support enterprise-wide business strategies and objectives.\nApplicants who require accommodations to participate in the interview process should contact the Talent Acquisition Team to arrange for such accommodations by emailing: Talent.Acquisition@Berkadia.com\nBerkadia does not share salary ranges in its job postings. Any salary-related information you see posted externally has not been provided or verified by Berkadia and may not be accurate.\nBerkadia is an equal opportunity employer and affords equal opportunity to all applicants and employees for all positions without regard to race, color, religion, gender, national origin, age, disability, veteran status or any other status protected under local, state or federal laws.\nBy applying to this job opportunity you are acknowledging Berkadia's Privacy Policy. Applicants have rights under Federal Employment Laws. Please click the following links for more information: EEOC, Employee Rights under the FMLA, EPPA.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T01:51:28.000Z"
  },
  "company": {
    "name": "Berkadia",
    "link": "https://www.linkedin.com/company/berkadia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 61300,
    "max_value": 116000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Midvale",
    "region": "UT",
    "postal_code": "84047",
    "street_address": null,
    "latitude": 40.610794,
    "longitude": -111.90804
  }
}