{
  "job": {
    "title": "Scientist Research, Discovery Chemistry – Peptide Research.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Janssen Research & Development, LLC, a division of Johnson & Johnson's Family of Companies is recruiting for a Scientist, Discovery Chemistry - Peptide Research to be located in Spring House, PA.\nAt the Janssen Pharmaceutical Companies of Johnson & Johnson, we are working to create a world without disease. Transforming lives by finding new and better ways to prevent, intercept, treat and cure disease inspires us. We bring together the best minds and pursue the most promising science. We are Janssen. We collaborate with the world for the health of everyone in it. Learn more at www.janssen.com and follow us @JanssenGlobal. Janssen Research & Development, LLC is part of the Janssen Pharmaceutical Companies.\nJanssen Research & Development, LLC, is seeking an experienced, highly skilled, and motivated chemist with expertise in peptide drug discovery, design and synthesis, to work in our laboratories for the position of Scientist, Discovery Chemistry. We are seeking a chemist with outstanding organic and peptide synthesis expertise to advance peptide drug discovery programs toward the clinic. In this position, with significant opportunities for laboratory-based program leadership, the successful candidate will partner with both internal and external chemistry teams to generate innovative solutions to synthetic and medicinal chemistry challenges within the context drug discovery projects. She/he will maintain close interactions with computer-assisted design scientists, biologists, pharmacologists, and pharmaceutical development scientists. Strong people and mentoring skills and the ability to thrive in a team and goal driven environment are key attributes.\nJohnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability.\nUnited States-Pennsylvania-Spring House-Welsh & McKean Roads\nJanssen Research & Development, LLC (6084)\nR&D\n2105956520W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T03:28:13.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Spring House",
    "region": "PA",
    "postal_code": "19477",
    "street_address": null,
    "latitude": 40.183796,
    "longitude": -75.23387
  }
}