{
  "job": {
    "title": "Staff ML Engineer - ML, NLP, Tensorflow",
    "industry": "Consumer Goods",
    "description": "If you are a Staff ML Engineer with experience, please read on! We are looking for someone who has extensive experience and expertise in designing and implementing ML training pipelines as we improve and scale our AI NLP solution. As our Staff Engineer, you will serve as the ML specialist and guide other engineers to tackle complex algorithmic and architectural challenges.\nWhat You Will Be Doing\n\" Investigate and experiment with new model architecture to improve existing ML model and training pipelines, run-time inference and performance improvements\n\" You will creatively balance the demands of production-level software engineering with exploratory research and development\n\" Work with teams to develop and improve machine learning pipeline that goes all the way from R&D to at-scale deployment\nWhat You Need for this Position\n\" Extensive experience working with, developing, and maintaining production-level Python\n\" You have some C++ experience\n\" Hands-on experience with ML model deployment and inference in a production setting\n\" Experience using TensorFlow, PyTorch, MxNet or similar tools\n\" Ability to build NLP data pipelines and perform data transformations to fit deep learning models for language learning\n\" Experience with sequence-to-sequence neural networks (e.g. LSTMs, GRUs, Transformers, etc.) in any domain\nSo, if you are a Staff ML Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nStephen.Maroda@CyberCoders.com\nStephen Maroda - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:05:49.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Mountain View",
    "region": "CA",
    "postal_code": "94040",
    "street_address": null,
    "latitude": 37.39008,
    "longitude": -122.08139
  }
}