{
  "job": {
    "title": "Solutions Engineer - Enterprise Software, Microsoft Azure, DAC",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Solutions Engineer with experience in the education industry, please read on!\nWe are a quickly growing education based software company looking to add a Solutions Engineer to our team! The ideal candidate would possess enterprise software experience, at least 5 years of technical experience (preferably in One Card or Commerce (POS) ), and an understanding of enterprise-class systems, design, and architecture.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nWe are actively interviewing for this role, so please APPLY TODAY!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nShauna.Hillegas@Optello.com\nShauna Hillegas - Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:24:55.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Phoenix",
    "region": "AZ",
    "postal_code": "85009",
    "street_address": null,
    "latitude": 33.448204,
    "longitude": -112.072586
  }
}