{
  "job": {
    "title": "Data Science Engineer",
    "industry": "Hospitality,Internet,Restaurants",
    "description": ": Full-time\n: San Francisco, CA\n: Data Science\nOur team is looking for someone passionate about Machine Learning with a strong background in Software Engineering. The ideal candidate has worked on production APIs, implemented ML models, managed ETL pipelines, and they feel comfortable learning.\nYour primary goal is to support production APIs that serve ML models that make great recommendations, search results, and content for diners.\nThe ideal candidate has all of these requirements. That’s asking a lot, if you feel that you’re a good fit for some of the requirements but you want to learn the others, we’d like to talk to you.\nOpenTable, part of Booking Holdings Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, seating more than 25 million diners per month via online bookings across approximately 60,000 restaurants.\nSince its inception in 1998, OpenTable has seated more than 1.5 billion diners in over 20 countries. The Company is headquartered in San Francisco, California, and the OpenTable service is available throughout the United States and Canada, Germany, Japan, Mexico, the UK, and many more locations.\nWe are an equal opportunity employer and value diversity at our Company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nAs an employee of OpenTable, you will be part of a global network that includes OpenTable and KAYAK's portfolio of metasearch brands, including momondo, Cheapflights, Swoodoo, checkfelix, and Mundi. Many employees are dedicated to one brand, but we all have the benefit of using each other's strengths and insights. Together, we're able to help people experience the world through dining and travel.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T06:05:11.000Z"
  },
  "company": {
    "name": "OpenTable",
    "link": "https://www.linkedin.com/company/opentable"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}