{
  "job": {
    "title": "Software Engineer",
    "industry": "",
    "description": "Role: Software Engineer\nWe are seeking a Software Engineer who will be responsible for developing and maintaining one of our community-supported products. You will have the exciting challenge of designing and building robust and scalable software using a cutting-edge technology stack as we seek to unlock the value of our music data and modernize our products and user experience. The role works as part of an Engineering team and assists this team with estimation and prioritization of development efforts, participating in architectural planning discussions.  Our engineers tackle highly complex technical challenges in collaboration with our product and design teams to solve for a variety of problems ranging in complexity and scope.  Our engineers have an opportunity to make significant impacts to our architecture and product features as well as our performance and scalability.\nNeed to Have:\nBachelor's degree (BA/BS) from four-year college or university in math\\computer science related field, or equivalent work experience.\nExtensive experience working with production systems; troubleshooting, performance tuning, optimizing, refactoring, etc.\nExtensive experience with Python and MySQL\nDeep understanding of Software Engineering processes such as version control, build and configuration management, automated deployments, automated testing, etc.\nNice to Have:\n•\tKnowledge of Javascript, React and eCommerce applications would be a plus.\n•\tPossess knowledge of the functions, operation, and mission of the business.\n•\tComfort working in an agile software development process that is highly agile and iterative.\n•\tAbility to operate by Discogs principles of:\n•\tResults driven: Relentlessly pursue our goals and honor our commitments\n•\tCommunication: Ask questions, share observations, state facts\n•\tAdaptability: Embrace failure through experiential learning, move forward\n•\tImpact: Contribute to the story of Discogs' success\nInterested please share your resumes to murali@quadrantresource.com",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T01:56:56.000Z"
  },
  "company": {
    "name": "Quadrant Resource ",
    "link": "https://www.linkedin.com/company/quadrant-resource-llc_2"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Portland",
    "region": "OR",
    "postal_code": "97268",
    "street_address": null,
    "latitude": 45.516018,
    "longitude": -122.68143
  }
}