{
  "job": {
    "title": "Senior Product Engineer - RF / MEMS - Test Validation",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Senior Product Engineer with RF or MEMS experience, please read on!\nWe are an established Digital Micro Switch technology company creating a scalable product development platform to create ground-breaking changes in high-powered switching applications in the world of Industrial Power Electronics, Communications and Internet of Things (IoT).\nOur product in 99x more reliable and functional than the competition, and we guarantee our product up to 3 BILLION cycles. No other product/company out there comes close to this kind of guarantee on switching products.\nTop Reasons to Work with Us\nWe are now in a phase of significant growth, doubling the company as we move to our Series C round of funding, and are on target to triple our revenue quarter-over-quarter.\nWhat You Will Be Doing\nInnovation and problem solving in RF Power Systems manufacturing, test, quality, & supplier assessment and development\nAnalyze manufacturing test data to drive design improvements of HW or test automation to improve yield\nInterface as the central resource with design, test, application, software and marketing teams as the product(s) move from design to completion and distribution\nproduct engineering tasks such as studies and reviews on quality as well as driving yield improvement and cost reduction projects\nDeveloping production and characterization test specifications\nyield enhancement, test time reduction\nWhat You Need for this Position\nDetailed knowledge and experience with RF or MEMS switches\nSo, if you are a Senior Product Engineer with RF or MEMS experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRichard.Marion@Optello.com\nRichard Marion - Recruiting Manager - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:12:13.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Irvine",
    "region": "CA",
    "postal_code": "92717",
    "street_address": null,
    "latitude": 33.68591,
    "longitude": -117.82472
  }
}