{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Join us as we pursue our disruptive vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most significantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\nSplunk's Cloud Services group is looking for a Site Reliability Engineer to help lead, design and build the next generation of our large scale cloud offering. You will be working on core services and applications that form the primitives for our current and future cloud service offerings. Site Reliability Engineers in this role will be engaging with multiple service owners across the platform to teach and implement modern interpretations of SRE, observability, Chaos Engineering and DevOps. This role is highly visible and impactful to the organization and will help shape Splunk's Engineering culture for years to come. Your job, in a nutshell, is to make every team around you better... including your own!\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\nFor job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.\n(Colorado only*) Minimum base salary of $80,000. You may also be eligible for incentive pay + equity + benefits.*Note Disclosure per sb19-085 (8-5-201 et seq).",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-07T07:05:15.000Z"
  },
  "company": {
    "name": "Splunk",
    "link": "https://www.linkedin.com/company/splunk"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Raleigh",
    "region": "NC",
    "postal_code": "27699",
    "street_address": null,
    "latitude": 35.781303,
    "longitude": -78.64168
  }
}