{
  "job": {
    "title": "Software Quality Assurance Engineer",
    "industry": "Logistics and Supply Chain",
    "description": "Everstream Analytics delivers a range of predictive analytics solutions that enable supply chain and logistics professionals around the world to get in front of costly delays and disruptions. For far too long, companies have been playing a never-ending game of catch-up with events outside their control – weather, supplier issues, port strikes, political unrest, a global pandemic… you name it. If you want to get ahead of it all, you’ve got to think bigger, see further, and act sooner. That’s the Everstream Analytics approach. Through our unique capabilities, companies like Google, Schneider Electric, Unilever, and Campbell’s can grow and protect more revenue.\nOur ability to deliver uniquely valuable insights comes from our world-class team, the support of our strategic partners and Investors and what we’ve learned from our clients through developing data-driven solutions for global brands. Everstream Analytics. Get in front of what’s ahead.TM\nWe recognize that to consistently deliver value to our clients we need to be outward looking and highly collaborative. The foundation for this is our culture, which emphasizes three core values: Trust, Transparency and Respect. We hold each other to these values and expect our clients to do so as well.\nEverstream’s power to deliver comes from the merger of two companies with unique capabilities and histories of groundbreaking innovation: Riskpulse and Resilience360.\nRiskpulse was created in 2007 to help companies combat the growing challenges of weather-related business continuity challenges. In 2015 Riskpulse merged with Earthrisk, adding advanced environmental data science capabilities, and setting the foundation for our advanced predictive analytics that we deliver today.\nResilience360 was incubated in DHL’s Global Innovation Center in 2012 following global catastrophes in 2011 to help DHL’s clients be better prepared for and responsive to supply chain disruptions and has grown into the leading supply chain risk management platform.\nIn 2018 Columbia capital committed $21 million to the growth of Resilience360 through organic growth and acquisitions and in 2019 led the acquisition of Riskpulse with Greenspring Associates joining the associated funding round. DHL remains a major shareholder. The two companies, teams and solutions came together in 2020 and in 2021 were relaunched as Everstream Analytics.\nThanks to our remarkable people we are at the forefront of change and bringing cutting-edge products and services to market. We focus on growth, so our people, our business, and our customers can achieve their full potential. Our culture is cultivated from resiliency, responsiveness and critical thinking and are integrated into every aspect of what we do. If you share in our passion to revolutionize the supply chain industry with disruptive technology, we want you to fast-forward your career at Everstream Analytics.\nEverstream Analytics is looking for a(n) Software Quality Assurance Engineer to join our Product Management team. This position will report directly to the Senior Manager Product Management for the global region. As a member of Product Management, you will join a passionate team of high performers, creating a disruptive, customer centric Supply Chain Risk Management product.\nAs a Software Quality Assurance Engineer at Everstream Analytics you will collaborate with other Product Management team members and cross-functional teams to support Product Management programs that build sustainable business operations. You’ll apply your skills and abilities to create a new chapter in Supply Chain Risk Management and end to end Supply Chain visibility.\nEqual Employment Opportunity and Diversity\nWe are committed to equal-employment principles, and we recognize the value of committed worksite employees who feel they are being treated in an equitable and professional manner. We strive to find ways to attract, develop and retain the talent needed to meet business objectives, and to recruit and employ highly qualified individuals representing the diverse communities in which we live.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T06:09:44.000Z"
  },
  "company": {
    "name": "Everstream Analytics",
    "link": "https://www.linkedin.com/company/everstreamai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Plantation",
    "region": "FL",
    "postal_code": "33004",
    "street_address": null,
    "latitude": 26.128277,
    "longitude": -80.24237
  }
}