{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Computer Software,Computer Networking,Computer &amp; Network Security",
    "description": "It’s an exciting time to be at Infoblox. Named a Top 25 Cyber Security Company by The Software Report and one of Inc. magazine’s Best Workplaces for 2020, we are leading the way to next-level DDI with our Secure Cloud-Managed Network Services, bringing next-level security, reliability, and automation to cloud and hybrid systems—all managed through a single pane of glass. Our success depends on bright, energetic, talented people who share a passion for building the next generation of networking technologies and having fun along the way.\nWe are looking for a Senior Software Engineer to join our team, reporting to the Senior Manager of Software Engineering. In this role, you will design leading edge, market disrupting cybersecurity solutions in our fast paced, high-functioning, global environment. You will specifically develop systems to distribute and manage large volumes of data used by governments and multinational corporations to defend their networks against cyber-attack.\nYou’re the ideal candidate if your passion involves writing high quality code for a cutting edge SaaS solution and value ongoing communication and socialization of amazing discoveries throughout a tight knit community of engineers.\nOur holistic benefits package includes coverage of your health, wealth, and wellness—as well as a great work environment, employee programs, and company culture. We offer a competitive salary and benefits package, including a 401k with company match and generous paid time off to help you balance your life. We have a strong culture and live our values every day—we believe in transparency, curiosity, respect, and above all, having fun while delighting our customers.\nSpeaking of a great work environment, here are just a few of the perks you may enjoy, depending on your location…\nWe’ve created a culture that embraces diversity, equity, and inclusion and rewards innovation, curiosity, and creativity. We achieve remarkable results by working together in a supportive environment that focuses on continuous learning and embraces change. So, whether you’re a software engineer, marketing manager, customer care pro, or product specialist, you belong here, where you will have the opportunity to grow and develop your career. Check out what it’s like to be a Bloxer. We think you’ll be excited to join our team.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:11:26.000Z"
  },
  "company": {
    "name": "Infoblox",
    "link": "https://www.linkedin.com/company/infoblox"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Tacoma",
    "region": "WA",
    "postal_code": "98406",
    "street_address": null,
    "latitude": 47.25308,
    "longitude": -122.44153
  }
}