{
  "job": {
    "title": "Software Engineer I",
    "industry": "Hospital &amp; Health Care",
    "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.\nLeading an active lifestyle is important to the many people we serve. In Abbott’s\ndivision, we’re advancing the treatment of heart and vascular disease through breakthrough medical technologies, As a global leader in\n, our breakthrough medical device technologies help restore people's health so they can get back to living their best lives, faster. We focus on innovative technologies that can improve the way doctors treat people with heart failure (HF).\n, you will be part of our\nproduct development team focused on planning and delivering of custom in-house embedded software applications developed for Implantable Devices meeting both short term and long-term goals of our patients. Located at our Burlington, MA site, you will contribute to embedded software projects that meet customers’ needs in terms of functionalities, performance, time, and cost.\nAt Abbott, you can have a good job that can grow into a great career. We offer:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T00:00:00.000Z"
  },
  "company": {
    "name": "Abbott",
    "link": "https://www.linkedin.com/company/abbott-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Burlington",
    "region": "MA",
    "postal_code": "01803",
    "street_address": null,
    "latitude": 42.504986,
    "longitude": -71.19583
  }
}