{
  "job": {
    "title": "Applied Machine Learning Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nThe Challenge\nCome join Adobe Stock to be a part of a highly motivated team developing innovative features! We are looking for an engineer who loves building delightful experiences for the creative professional by building and optimizing state of the art machine learning solutions, deep learning, content understanding, language understanding, and more. You will design and develop machine learning based approaches to deliver personalized and unique experiences to our customers.\nThe ideal candidate will have a blend of science and computer science skills with a proven track record of solving critical engineering problems through strong analytical/quantitative and engineering skills.\nWhat you'll do\nWhat you need to succeed\nAt Adobe, you will be immersed in an exceptional work environment that is recognized around the world. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely. If you’re looking to make an impact, Adobe's the place for you! Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\nAdobe is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.\nAdobe aims to make adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, please contact accomodations@adobe.com or (408) 536-3015.\nWhen you click Apply, Adobe will use the personal information you provide for recruiting and, at your request, to consider you for employment. See the Adobe Applicant Privacy Notice to learn more about your rights, and how Adobe shares and transfers your personal information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-24T10:00:22.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 120000,
    "max_value": 192000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}