{
  "job": {
    "title": "Data Scientist - Causal Inference and Econometrics",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "At Clarity AI, we are committed to bringing social impact to markets. We are a tech company started in 2017, leveraging AI and machine learning technologies to ensure environmental, social and governance dimensions are the focal point of decision making within financial markets.\nWe are now a team of more than 100 highly passionate individuals coming from all over the world. Together, we have established Clarity AI as a leading startup backed by investors and strategic partners such as Blackrock and Deutsche Börse who believe in us and share our goals. We have plans to continue growing our teams in Spain, the UK and the US this year so if you would like to join us on this rocket ship, keep reading!\nLOCATION New York City\nWhat are we looking for?\nWe like data scientists that work with data in a scientific way and that share our passion for bringing social impact to the markets and making a difference.\nAt Clarity you will help develop the “gold standard” to quantify social impact that will be used by investors, consumers and governments. Specifically, you will\nAs the ideal candidate for the position\nResponsibilities of the role include\nOur people are our main asset. We have built a unique team and we all share 3 differential aspects Excellence, Passion and Values\nWe are different. We work hard to become the best place to work and pride ourselves on our culture\nWe care about our employees and think they deserve the best.\nWe are a US company with a Spanish subsidiary. We have amazing offices in Madrid, London and New York City.\nClarity has received several awards\nPrivacy Policy\nResponsibility Clarity AI Inc. 160 Greentree Drive, Suite 101, City of Dover, County of Kent, Delaware 19904, United States.\nPurpose management of selection processes for new employees.\nLegitimation necessary processing for contract execution. Recipients company of the Clarity Group in the country that would carry out the contract or where position is being offered.\nRights the interested party may exercise the rights of access, rectification, opposition, limitation, suppression, portability and not to be the object of automated decisions according to the Privacy Policy.\nMore info to consult the privacy policy in detail, click on the following link (Privacy Policy)",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-14T00:59:56.000Z"
  },
  "company": {
    "name": "Clarity AI",
    "link": "https://www.linkedin.com/company/clarity-ai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "United States",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 42.93923,
    "longitude": -75.62005
  }
}