{
  "job": {
    "title": "Senior Software Engineer - Python, AWS, SQL",
    "industry": "Hospital &amp; Health Care",
    "description": "If you are a Senior Software Engineer with experience, please read on!\nThis is a full-time/permanent position, direct-hire with my client.\nWe are a computer vision company that develops real-time computer-aided detection and diagnostic tools for the healthcare industry. Recently receiving $15 million in funding, we are on track to be one of the fastest growing start ups out of MIT. We are looking for a solid Python engineer to come in and help us improve our products right away .\nWhat You Will Be Doing\nWhat You Need for this Position\nSo, if you are a Senior Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nChris.Cavish@CyberCoders.com\nChris Cavish - Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:46:40.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}