{
  "job": {
    "title": "Software Engineer, Data",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Point is a technology and design company that transforms everyday spending into a delightful and rewarding experience. We're re-thinking the payment experience with an emphasis on transparency, delight, and personalization.\nWith the best benefits of both debit and credit, Point Card earns you points on every purchase redeemable for instant cash-back. Point App works side by side with Point Card to create an elegant, easy-to-use experience.\nWe recently closed our $46.5 million Series B funding round. To learn more, see TechCrunch's coverage here.\nBacked by top investors like Peter Thiel (Valar Ventures) and Y Combinator, we're well-funded and ready to make a positive impact on people's daily lives.\nWe're looking for a\nto join our specialized team. We have the vision and resources, and need your talent and skills.\nPoint is looking for\nto join our focused, growing, and passionate team. We want engineers who orient around solving customer problems, who understand the tradeoffs between different technical approaches, and who believe that a reliable data platform is composed of individually testable components.\nAs the first\non the Data Platform team at Point, you'll help to architect and build Point's data platform and systems, managing ingestion, processing and storage, building scalable pipelines, and developing frameworks & tools to make data easily & efficiently available to downstream teams and systems.\nThis platform will be used by Point's data consumers to inform new consumer-facing features, help to refine the core card product and power evolutionary new ways for consumers to pay.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T07:22:21.000Z"
  },
  "company": {
    "name": "Point Card",
    "link": "https://www.linkedin.com/company/getpoint"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}