{
  "job": {
    "title": "DevOps / Site Reliability Engineer ",
    "industry": "Information Technology and Services",
    "description": "DevOps and Site Reliability Engineer (SRE) - Oracle SAAS Infrastructure Services Team U.S. Citizenship or U.S. Lawful Permanent Resident Status Required  due to supporting Federal Government customers Oracle is a leader in enterprise cloud applications powering many of the world’s largest organizations, and we’re in the process of revolutionizing our application user experiences with our new Redwood user interface components and enterprise-scale backend services. We are on a quest to provide the most productive platform with extremely fast, secure, and extensible REST services to back these user experiences. Our goal is to create a universal services and transaction services that is metadata-oriented and is simple to uptake, test, debug, and monitor. These services must be highly scalable and dynamic to meet the varying work loads for our customers.  We have many large scale customers who are ready to work with you on this fabulous journey. We’re looking for talented DevOps/SRE engineers to build, deploy and monitor the service on Oracle Cloud. If you have experience as a DevOps engineer supporting CI/CD, rollout, patching, monitoring enterprise scalable micro services using cloud native infrastructure please contact us right away. What You'll Do  Bringing in the right “DevOps” mindset among the teams developing software, conducting training on tools and processes that makes software development and testing easier. Participate in the entire software Lifecycle – development, testing, CI and production operations Automate release and deployment process from development to production rollout following CI/CD process using standard DevOps toolset Define, enforce and maintain metrics and quality gates for build promotion processes Take ownership of maintaining and managing the environments. Maintain separation between Dev, UAT, stage and production environments. Monitor and maintain the production service and infrastructure Participate in on-call/Pagerduty for the service Work with customers and ISVs and service developers to troubleshoot issues in production systems. Mentor new employees and software developers to increase quality of projects Required Knowledge and Skills B.S., M.S. in Computer Science, Electrical Engineering with 2-3 years of professional experience in Cloud Infrastructure and Cloud Solutions Professional work experience working on complex applications/services with DevOps Experience. Strong knowledge of Linux/UNIX Shell scripting, package management etc Hands on experience working with standard DevOps tools Kubernetes, Docker, Istio, Grafana, Helm Charts, Terraform Experience with Build Automation and Monitoring tools like Maven, ANT, Gradle, Jenkins bug tracking tools like JIRA Build Tools like Maven, ANT, Gradle,. Source control tools like Git, GitHub, SVN or equivalent Network configuration and management Knowledge of middleware components like Weblogic or Tomcat Knowledge of Python or Perl is desirable. Knowledge of Monitoring technologies (Enterprise Manager, Thousand Eyes, Prometheus) will be an advantage. Teamwork is key here. We are looking for developers who believe in the value of cross team collaboration. Excellent oral and written communication skills. Self motivated to continuously learn and improve.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-11T19:05:21.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco Bay Area",
    "region": null,
    "postal_code": "94112",
    "street_address": null,
    "latitude": 37.39271,
    "longitude": -122.042
  }
}