{
  "job": {
    "title": "Software Engineer, New Grad/Early Career - New York, San Francisco, Toronto",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Databases are the beating heart of every business in the world.\nCockroach Labs is the creator of CockroachDB, the most highly evolved cloud-native, distributed SQL database on the planet that scales fast, survives anything, and thrives anywhere. We created CockroachDB to unshackle teams from the constraints of their database. Join us on our mission to enable every developer to build world-changing applications!\nWe are looking for extraordinary backend, full-stack, and frontend engineers to join our team.\nYou Will\nThe Expectations\nIn your first 30 days, you will become an integrated member of our engineering team. We believe that it's essential for you to take this first month to become familiar with our technology and our company.\nAfter 3 months, you'll be integrated into the team. You will be comfortable contributing to the codebase for CockroachDB or CockroachCloud. You will begin to determine the parts of our product that most interest you and work with your manager to focus your efforts on projects that align with those areas and the product roadmap.\nAs our team grows, you will have the opportunity to shape the direction of development for Cockroach Labs products. We want our users to have a phenomenal experience using our products, and you play a crucial role in making our database offerings a joy to use.\nYou Have\nNote: Our interview process consists largely of programming in a real environment, and we'll be evaluating you on the skills listed above.\nThe Team\nYou will have the opportunity to report to a member of our engineering leadership team based on the project you work on at Cockroach Labs.\nPeter works on a bit of everything, from low-level optimization of code to refining the overall design. He was thrust into file systems early in his career at Inktomi and then learned the true meaning of scalability while working on Gmail and Colossus at Google. Before stepping into the office in the morning, he will have nursed his CrossFit addiction and dealt with the chaos of a three kid morning routine. You can set your watch by his daily departure at 4:30 pm to have dinner with his family.\nIsaac is responsible for the health of the engineering organization at Cockroach Labs. He partners closely with teams to ensure we have a balanced culture that promotes quality and innovation in pursuit of our goals. Before joining Cockroach Labs Isaac was in life sciences for 16 years with Medidata Solutions where he had a front row seat on the exciting ride from a 30 person startup to more than 2000 people worldwide. But the lure of distributed, resilient, and consistent SQL databases, along with the amazing technology and culture at Cockroach Labs proved too much. When not working he likes to draw, play the piano, and search NYC for cannoli's with his wife and kids\nOur Benefits\nCockroach Labs is proud to be an Equal Opportunity Employer building a diverse and inclusive workforce. If you need additional accommodations to feel comfortable during your interview process, please email us at accessibility@cockroachlabs.com.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-29T23:07:36.000Z"
  },
  "company": {
    "name": "Cockroach Labs",
    "link": "https://www.linkedin.com/company/cockroach-labs"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Greater Syracuse-Auburn Area",
    "region": null,
    "postal_code": "13202",
    "street_address": null,
    "latitude": 43.07904,
    "longitude": -76.16553
  }
}