{
  "job": {
    "title": "Software Engineer(Machine Learning / Data Scientist)",
    "industry": "Management Consulting",
    "description": "Through our dedicated associates, Conduent delivers mission-critical services and solutions on behalf of Fortune 100 companies and over 500 governments – creating exceptional outcomes for our clients and the millions of people who count on them.\nYou have an opportunity to personally thrive, make a difference and be part of a culture where individuality is noticed and valued every day.\nConduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law.\nPeople with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form. You may also click here to access Conduent's ADAAA Accommodation Policy.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-02T02:18:04.000Z"
  },
  "company": {
    "name": "Conduent",
    "link": "https://www.linkedin.com/company/conduent"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Lebanon",
    "region": "KS",
    "postal_code": "66952",
    "street_address": null,
    "latitude": 39.809875,
    "longitude": -98.55673
  }
}