{
  "job": {
    "title": "Machine Learning Engineer - HBO Max",
    "industry": "Entertainment",
    "description": "WarnerMedia is a powerful portfolio of iconic entertainment, news, and sports brands. We bring people, technology, and the world’s best storytellers together to drive culture and meaningful connection. We believe the enduring power of stories can open our eyes to the world, to each other, and to new and different perspectives.\nHBO Max is where storytelling takes center stage and where creatives find a home with the support and resources to do their best work, no matter the genre or format. Whatever the viewer wants to watch is front and center and more of what they crave is easily discovered. It is where our exclusive HBO Max Originals and iconic entertainment brands thrive, with HBO, Warner Bros., DC, Turner Classic Movies, Cartoon Network and more delivering the greatest array of series, movies and specials for audiences of all ages. HBO Max launched in the US in May 2020 and will launch in Latin America and Europe during 2021.\nJoin us. Shape your story here.\nAs a Machine Learning Engineer, you will be part of a talented Machine Learning (ML) group focused on developing innovative machine learning algorithms, scalable ML systems, and HBO Max applications.\nYou will focus on developing and deploying engineering systems such as customer life cycle models, audience segmentation systems, personalization and recommender systems, search, experimentation, and content AI solutions to drive user experience and growth.\nYou will partner closely with product, engineering, content, marketing, and research stakeholders across WarnerMedia to identify ML opportunities, accelerate AI innovation, and ensure the delivery of impactful solutions for the business.\nWarner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-15T13:54:21.000Z"
  },
  "company": {
    "name": "WarnerMedia",
    "link": "https://www.linkedin.com/company/warnermedia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 110000,
    "max_value": 153000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}