{
  "job": {
    "title": "Elasticsearch Engineer (Remote)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Elasticsearch Engineer\nFull Remote\n$130,000 $150,000/year\nElasticsearch, Python, Azure Functions\nWe are a 200 person extremely well-funded software company in the agricultural solutions space. We are focused on unlocking the global genetic potential of plants to enhance the sustainability of food, feed, fiber, and fuel production. We and our partners harness natural and novel genetic variation through breeding, trait development, etc. to develop products that accelerate crop improvement.\nWe have been ranked in the Inc. 5000 as one of the fastest growing companies for the past several years. We are currently in a major growth phase and hiring a Elasticsearch Engineer to help us improve our search functionality.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nOr\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nDanny.Herries@Optello.com\nDanny Herries - Lead Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:09:38.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Denver",
    "region": "CO",
    "postal_code": "80247",
    "street_address": null,
    "latitude": 39.738453,
    "longitude": -104.984856
  }
}