{
  "job": {
    "title": "Software Engineer",
    "industry": "Health, Wellness and Fitness,Medical Practice,Hospital &amp; Health Care",
    "description": "At Lockheed Martin, we are passionate about innovation and integrity. We believe that by applying the highest standards of business ethics and forward-thinking, everything is within our capacity - and yours as a Lockheed Martin employee. Lockheed Martin values your skills, training, education and background! Do you want to be part of an environment that encourages and supports employees to think big, perform with quality and build incredible products? We provide the resources, inspiration and focus - if you have the resourcefulness and courage to work hard, Then we want to build a better tomorrow with you. Come and experience your future! About our Mission As our newest team member, you will participate in the development of Special Test Equipment Software used in testing Avionics hardware units. In this role, you will design, code and integration/test software primarily in LabVIEW and C/C#. You will utilize strong analytical and trouble shooting skills. This position will be supporting a wide-range of Owego customers and contracts. Candidate needs to be a self-starter who is capable of understanding legacy LabVIEW applications and troubleshoot and make updates when necessary. Basic Qualifications:",
    "employment_type": "CONTRACTOR",
    "date_posted": "2021-07-11T23:52:34.000Z"
  },
  "company": {
    "name": "Resume-Library",
    "link": "https://www.linkedin.com/company/resume-library"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Owego",
    "region": "NY",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 42.10444,
    "longitude": -76.26333
  }
}