{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Internet,Marketing and Advertising",
    "description": "The Trade Desk is a global technology company with a mission to create a better, more open Internet for everyone through principled, intelligent advertising.\nHandling over 600 billion queries per day (more than 100X the query volume of search globally), our platform operates at unprecedented scale. We have also built something even stronger and more valuable: an award-winning culture based on trust, empathy, collaboration, and ownership. By working together across typical dividing lines, we are better as a team than any of us could be apart.\nDo you have a passion for solving hard problems at scale? Are you eager to join a trust-based, globally-connected team, where your contributions will make a meaningful difference?\nCome and see why Fortune Magazine consistently ranks The Trade Desk among best small-medium sized workplaces globally.\nWhat and how you can contribute is what’s important to us. Our consideration is not limited by the kind of education you have or the specific technologies you have experience with. Variety of technical challenge is one of the best things about working at The Trade Desk as an engineer, but we do not expect you to know every technology we use when you start. What we care about is that you can learn quickly and solve complex problems using the best tools for the job.\nOur culture runs much deeper than just having fun together (though, we do that well too...) – the people we want on our team are trust-builders, generous givers, scrappy problem solvers, and gritty pursuers of excellence.\nDoes this sound like you? If so, we welcome your application and the chance to meet you.\nIn accordance with Colorado law, the range provided is The Trade Desk’s reasonable estimate of the base compensation for this role. The actual amount may be higher or lower, based on non-discriminatory factors such as experience, knowledge, skills and abilities. The Trade Desk also offers a competitive benefits package. Click here to learn more.\nThe Trade Desk does not accept unsolicited resumes from search firm recruiters. Fees will not be paid in the event a candidate submitted by a recruiter without an agreement in place is hired; such resumes will be deemed the sole property of The Trade Desk. The Trade Desk is an equal opportunity employer. All aspects of employment will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T22:56:26.000Z"
  },
  "company": {
    "name": "The Trade Desk",
    "link": "https://www.linkedin.com/company/the-trade-desk"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 64600,
    "max_value": 109000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Ventura",
    "region": "CA",
    "postal_code": "93006",
    "street_address": null,
    "latitude": 34.28083,
    "longitude": -119.293106
  }
}