{
  "job": {
    "title": "Lead Site Reliability Engineer (REMOTE)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Lead Site Reliability Engineer looking for fully remote work, please read on!\nWe are a publicly traded, leading industrial technology company with roots in North America and Europe, along with a team of 12k+ employees. We're on a quest to become the #1 company in our sector and are looking for someone to Lead our new SRE Team to build fault tolerant systems and reliable software to help us design, deploy, scale, and maintain highly available distributed sensory networks and companion cloud applications.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a Lead Site Reliability Engineer looking for a change - please apply today - INTVs are being scheduled!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nBobby.June@Optello.com\nBobby June - Recruiting Manager - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T17:46:32.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}