{
  "job": {
    "title": "Back end / Machine learning Engineer",
    "industry": "Computer Software",
    "description": "Intellimize is redefining how people think about personalization and optimization. The company was founded in 2016 by an experienced ad tech marketer and two experienced machine learning experts who had previously worked at Yahoo, Twitter, and BrightRoll. We’re backed by leading early-stage investors including Amplify Partners, Homebrew, and Precursor Ventures. Intellimize intelligently optimizes websites for revenue driven leaders. Our machine learning automatically personalizes the buyer’s path to drive more web conversions. On average, our customers achieve 46% lift. We work with great companies like Drift, Looker, Unilever, Sumo Logic, Tableau, Emburse, and many more.\nWe believe everything we do flows from two things: making our customers wildly successful and having this be the best professional experience of our lives. This company is based on our customers achieving their goals, getting promoted, and getting up on stage saying great things about our work together.\nSince the COVID-19 pandemic, the team has been working fully remotely. While we plan to move back into a San Mateo office once it is safe to do so, the engineering team will continue to embrace a remote-first culture and workflow. We welcome candidates from anywhere in the US or Canada. Our core working hours are centered around the Pacific time zone.\nIntellimize optimizes websites to generate more revenue. We use machine learning to automatically optimize each buyer’s path to drive more web conversions. Our unique solution enables experimentation and personalization at an unparalleled scale, and it replaces traditional approaches to optimization such as A/B testing and rules-based personalization. These methods are too slow, require daily attention, and don’t automatically adapt to changes in behavior over time.\nWe’d also love it if you have experience with any of the following:\nWhat you will work on\nHere are a few recent and upcoming projects the team has worked on to give you a sense of the scope of this role\nWhy us?",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T17:07:01.000Z"
  },
  "company": {
    "name": "Intellimize",
    "link": "https://www.linkedin.com/company/intellimize"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}