{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Do you dream about creating a more sustainable future? At Uplight, we are motivating energy users and providers to accelerate the clean energy ecosystem. Working with over 90 of the world’s leading electric and gas utilities, Uplight provides an end-to-end customer energy experience. Uplight delivers personalized experiences that customers have now come to expect–improving satisfaction, increasing revenue, reducing the cost to serve, and contributing to carbon reduction goals. We are B Corp certified, enabling us to put our values into action by not only making decisions for the benefit of our shareholders, but also for our customers, environment, employees, and community.\nWe are seeking a\nto join our team and help us achieve our ambitious goals for our business and the planet.\nAs a member of the Measurement, Analysis, and Testing Hypotheses (MATH) team, you will be in the data trenches for multiple product lines across Uplight. MATH is the team that answers the question “How do we know our products are saving energy?” We work with stakeholders across the company to design experiments that allow us to attribute savings to our products, and we design and build the statistical models that allow for savings to be calculated. In addition, we work on taking insights generated from utility data and exposing it back to our customers in an easily digestible manner. We are a team currently largely located in Colorado.\nAs an experienced data scientist, you will be a contributor and teacher on day one. Your role will be part builder, part mentor, part communicator, and part peer-reviewer. MATH is a highly collaborative team, and you will be hands on with your teammates answering questions, building models, and helping out however you can. At the same time, you will own your own code, review and refine your teammates’ code, guide the team’s development process, and be the technical leader shaping future development efforts on the team. This is the perfect role for a data scientist with data engineering experience, or a data engineer with data scientist interests.\nIn addition to all the standard medical and dental benefits, that kick in Day 1, we:\nIn accordance with the Colorado Equal Pay for Equal Work Act, the approximate annual base compensation range is listed above. The actual offer, reflecting the total compensation package and benefits, will be determined by a number of factors including the applicant's experience, knowledge, skills, and abilities, as well as internal equity.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-07T01:38:22.000Z"
  },
  "company": {
    "name": "Uplight",
    "link": "https://www.linkedin.com/company/uplightenergy"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}