{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At Workiva, we want a diverse mix of talented engineers who are product builders. If you don’t want to settle for “just doing the ticket”, and if you want to be empowered to change the product to solve customer problems, you’ll love it here. The technologies you know before-hand, or the technologies you leverage while solving problems, matter less than making software that real people enjoy using.\nWe're an agile team committed to maintaining a positive, safe, supportive, and results driven team culture. We routinely work on improving performance, user efficiency, and user experience in the application. Workiva uses a tight feedback loop with customers to re-prioritize work accordingly in an Agile development process. We’re committed to solving real customer problems and use this feedback loop to ensure we’re delighting them with our solutions.\nThe team routinely works full-stack. The frontend is a web application leveraging Dart, HTML5, and CSS. The backend services are in Python, Java, and Kotlin, and deployed in a Cloud environment using Kubernetes and Amazon AWS. The technology is a detail - we are confident that engineers can and will learn.\nWorkiva wants every team and individual to have autonomy and ownership over their team’s deployment, production monitoring, and architecture. We facilitate this by helping individuals grow over time in expertise and with opportunities to lead. Since engineers collaborate with the rest of Workiva’s teams to build a cohesive product, leadership and communication skills lead to growth and opportunity here.\nEducation\nTravel Requirements\nWorking Conditions & Physical Requirements\nThe base pay range represents the low and high end of the hiring range for this job. Actual pay will vary and may be above or below the range based on various factors including but not limited to relevant skills, experience, and capabilities.\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created.\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems.\nwww.linkedin.com/showcase/workiva-life-and-careers/\nhttps://www.linkedin.com/company/workiva/\nhttps://www.workiva.com/careers/benefits\nWorkiva is an Equal Employment Opportunity and Affirmative Action Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation. Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email\n.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T16:44:01.000Z"
  },
  "company": {
    "name": "Workiva",
    "link": "https://www.linkedin.com/company/workiva"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 55600,
    "max_value": 90000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Scottsdale",
    "region": "AZ",
    "postal_code": "85266",
    "street_address": null,
    "latitude": 33.494907,
    "longitude": -111.92606
  }
}