{
  "job": {
    "title": "Sr. RF Design Engineer - Aerospace",
    "industry": "Defense &amp; Space",
    "description": "If you are a Sr. RF Design Engineer with experience, please read on!\nWhat You Will Be Doing\nDesign, Prototyping and Validation of RF Subsystems from concept, analysis, part selection, PCB layout and board bring-up\nLink budget analysis\nPerform simulations using HFSS or AWR/ADS\nElectrical Engineering, Embedded Software development\nIf you have mixed-signal experience in Software-Defined Radios, this is a huge plus!\nWhat You Need for this Position\nStrong understanding of RF fundamentals\nPCB layout using Altium or other design software\nSo, if you are a Sr. RF Design Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRichard.Marion@CyberCoders.com\nRichard Marion - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:11:54.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Oakland",
    "region": "CA",
    "postal_code": "94612",
    "street_address": null,
    "latitude": 37.80483,
    "longitude": -122.27248
  }
}