{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Hardware",
    "description": "As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live.\nAs part of IBM GTS Infrastructure services (IS), Resiliency Orchestration (RO) team is responsible to build software product, applications, data and infrastructure resiliency automation software and services for IBM enterprise customers having their applications spread across traditional systems, private cloud and public clouds like IBM, AWS, Azure and GCP.\nThe GTS IS team is seeking a Data Scientist. You will be working with an amazing team to execute and deliver analytic solutions. The right candidate will be excited by the prospect of optimizing or even re-designing our anomaly detection and correlation models. The solutions developed by you would be highly scalable and will be deployed on platforms like Kubernetes, VMware and public clouds.\nKyndryl_NorthAmerica\nThis position currently sits within Global Technology Services (GTS) Infrastructure Services (IS) or a shared services function supporting GTS.\nAs announced in October 2020, IBM intends that its managed infrastructure services business of the GTS organization will become an independent company named Kyndryl by the end of 2021, creating two distinct and powerful market-leading companies.\nTogether, we will advance the vital systems that power the digital economy. Serving over 4,600 technology-intensive, highly regulated customers, including over 75% of the Fortune 100, our people will design, run, and manage the most modern and reliable technology infrastructure that the world depends on today.\nWe will work flexibly and in partnership with our customers to amplify business outcomes while always pushing ourselves to improve and meet all opportunities. Come join our team of diverse, devoted, and empathetic technology experts who are at the center of discovering what’s next.\nPlease note: The final decision if this position will transition from IBM to Kyndryl is yet to be confirmed.\nWhat matters to you when you’re looking for your next career challenge?\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\nIn addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to\nIBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.\nWe consider qualified applicants with criminal histories, consistent with applicable law.\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-07T00:00:00.000Z"
  },
  "company": {
    "name": "IBM",
    "link": "https://www.linkedin.com/company/ibm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Raleigh",
    "region": "NC",
    "postal_code": "27699",
    "street_address": null,
    "latitude": 35.781303,
    "longitude": -78.64168
  }
}