{
  "job": {
    "title": "Data Science Internship",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Data is at the core of Outreach's strategy. It drives our customers and ourselves to the highest levels of success. We use it for everything from customer health scores and revenue dashboards, to operational metrics of our AWS infrastructure, to helping increase product engagement and user productivity through automated natural language understanding, to predictive analytics and causal inference via experimentation. As our customer base continues to grow, we are looking at new ways of leveraging our data to save our customers time and improve their sales efficiency. The key goal of the Data Science team is to transform how sales reps operate by enabling personalized guided selling. This requires a deep understanding of customer communication - emails threads and call/meetings transcripts, to extract useful information, determine the situation the deal is in and recommend next steps. As a member of the team, you will be on the ground floor, working directly with the VP of Data Science to define and implement our strategy for delivering on this vision. You will be responsible for delivering models, data-driven functionality, and end-user features based on these models that will be deployed into production, as well as analyzing the data to produce actionable insights and inform next steps.\nAnalyzing huge volumes of communication such as e-mails, phone call transcripts, meeting transcripts. The data velocity is in Terabytes.\nDeveloping highly efficient machine learning models and extracting insights and actions. I mplementing and testing prototypes on our large scale distributed data infrastructure. Closely working with Machine Learning Engineers to deploy your models and insights into production. Working with internal teams to validate your results and enable them to take action based on your insights. Rigorously measuring the impact of your work via data analysis and experimentation.",
    "employment_type": "TEMPORARY",
    "date_posted": "2021-07-09T20:23:13.000Z"
  },
  "company": {
    "name": "Outreach",
    "link": "https://www.linkedin.com/company/outreach-saas"
  },
  "education": {
    "required_credential": null
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}