{
  "job": {
    "title": "Software Development Engineer II",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSoftware Development Engineer II\nThe Cyber and Security Services team develops new capabilities for Mastercard's fraud prevention platform. We protect cardholders / card issuers and aim to eradicate credit card fraud. Our industry-leading platform processes billions of transactions per month with execution times literally 10X faster than you can blink. To enable us to uphold the high standard of these fraud and security applications we are looking for out-of-the-box thinkers to play a critical role in the upkeep and continual health of these products.\nThe Software Engineer role will ensure these products continue to meet the high expectations from our customers by notably improving existing functionality, updating stale or outdated functions, proactively adding scalability while continuing to add enhanced value to these products.\nROLE\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:23:10.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 77900,
    "max_value": 116000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}