{
  "job": {
    "title": "Signal Software Engineer (TS/SCI with FS Poly Required)",
    "industry": "Construction,Information Technology and Services,Financial Services",
    "description": "If you are a 5 year Signal Software Engineer with a TS/SCI and Full Scope Polygraph, please read on.\nWe're a small engineering contractor that supports clients in the commercial and government sectors with RF Engineering, Analog and Digital Hardware, Audio and Video DSP, application and embedded software engineering and more. We have offices in Maryland, Virginia and North Carolina and are currently looking for a Signal Software Engineer at one of these locations.\nAll candidates must have an active, TS/SCI clearance with a Full Scope Poly clearance in order to be considered.\nWhat's In It for You\nWhat You Will Be Doing\nWhat You Need for this Position\nBONUS POINTS\nSo, if you are a 5 year Signal Software Engineer with a TS/SCI and Full Scope Polygraph, please apply today.\nMore openings for Software Engineers, Scrum Masters, Network Engineers, Cyber Security Analysts, Database Engineers and System Engineers are available in California, New Jersey, Colorado, Maryland, Virginia and Washington DC.\nAll roles require a TS/SCI with CI Poly, TS/SCI with Full Scope Poly, TS/SCI with Poly or a Top Secret Clearance.\nEmail Daniel.Chavez@CyberCoders.com for details.\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nMelanie.McElwee@CyberCoders.com\nMelanie McElwee - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:21:20.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Annapolis",
    "region": "MD",
    "postal_code": "21403",
    "street_address": null,
    "latitude": 38.97829,
    "longitude": -76.49568
  }
}