{
  "job": {
    "title": "Software Engineer",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "Corporate overview\nHere at UKG, Our Purpose Is People. UKG combines the strength and innovation of Ultimate Software and Kronos, uniting two award-winning, employee-centered cultures. Our employees are an extraordinary group of talented, energetic, and innovative people who care about more than just work. We strive to create a culture of belonging and an employee experience that empowers our people. UKG has more than 13,000 employees around the globe and is known for its inclusive workplace culture. Ready to be inspired? Learn more at www.ukg.com/careers\nEEO Statement\nUltimate Kronos Group is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.\nView The EEO is the Law poster and its supplement.\nView the Pay Transparency Nondiscrimination Provision.\nUKG participates in E-Verify. View the E-Verify posters here.\nFor individuals with disabilities that need additional assistance at any point in the application and interview process, please emailor please call 1 (978) 250 9800.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T04:37:37.000Z"
  },
  "company": {
    "name": "UKG (Ultimate Kronos Group)",
    "link": "https://www.linkedin.com/company/ukg"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 72400,
    "max_value": 122000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Weston",
    "region": "FL",
    "postal_code": "33004",
    "street_address": null,
    "latitude": 26.100613,
    "longitude": -80.39994
  }
}