{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software",
    "description": "Lextegrity offers the leading enterprise software platform for global organizations aiming to prevent and detect fraud, corruption, sanctions violations and conflicts of interest. Our integrated platform combines continuous spend monitoring of data from systems like SAP, Oracle and Concur with workflow automation across multiple risk areas, ranging from third party due diligence to gifts and hospitality, donations and sponsorships and conflicts of interest.\nLextegrity is led by former in-house compliance and audit experts (ex-Pfizer, Avon, Mylan) who launched Lextegrity to build the dream software they wished they had when they were in-house. It is no coincidence that nearly 50% of Lextegrity’s customer base today has chosen it to enhance their compliance programs after a publicly-disclosed FCPA matter.\nLextegrity is growing rapidly, is well capitalized and has established partnerships with leading global ethics organizations, such as\nWe are looking for an innovative, risk-minded individual to join us in developing, enhancing and evolving our proprietary risk analyses and risk scoring algorithms. This individual will work with Lextegrity’s deep anti-bribery, corruption, and fraud experience, to evolve and expand our library of risk analyses within our innovative SaaS software solution for in-house compliance, audit and investigations teams.\nThe ideal individual has spent years using business data to find answers to difficult questions. The individual should be obsessed with using logic and data science techniques to extract information valuable for understanding and managing risk in a variety of areas relevant to compliance, audit, investigations and other risk oriented perspectives. The individual must have technical programming expertise with data and statistical oriented programming languages as well as databases, as they will develop analyses and models in our stack to the proof-of-concept stage, while working with engineering to support them in bringing the analyses/models to production.\nThis role will be a close partner to our Chief Analytics Officer, but also work closely with our CTO, Head of Product, CEO and possibly with our customers and partners. This is a critical role within Lextegrity.\nThis position will primarily be evaluated on the candidate's experience and perspectives in the areas of business/enterprise analytics with relation to data science. This is a remote work from home position but will involve significant collaboration with the broader Lextegrity team.\nQualifications (Plus):\nLextegrity is an equal opportunity employer and prohibits discrimination on the basis of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Must be authorized to work in the United States on a full-time basis. No phone calls or recruiters please.\nPowered by JazzHR\nxe9UaB5wCs",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T19:21:17.000Z"
  },
  "company": {
    "name": "Lextegrity",
    "link": "https://www.linkedin.com/company/lextegrity"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 119000,
    "max_value": 194000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}