{
  "job": {
    "title": "Application Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Meter is developing next-generation volumetric imaging technology. We are building a machine that can see inside of anything and cloud-based software for processing the complex, volumetric data that the machine produces. Our technology will give engineers, designers, and eventually medical practitioners more confidence in their processes and lower the barrier to high quality imaging and inspection tools.\nOur team of engineers includes world-class researchers, industrial designers, PhDs, founders of successful startups, and zero egos. We are backed by some of the top venture capital funds and angel investors in Silicon Valley and beyond. The company is headquartered in Cambridge, MA and has an office in San Francisco, CA.\nMeter is seeking a highly skilled Application Engineer to work with our early customers and prospects to help them achieve their technical and business objectives. You will also work with our Sales team guiding customers towards adopting Meter’s solution. This individual will play an important role in bringing accessible volumetric imaging to market.\nIf you are interested in joining a well-funded growth stage company this is the perfect opportunity for you to become a part of the Meter team.\nThis role will be located in Meter’s Boston office. You may be required to travel occasionally to Meter’s San Francisco office, depending on local, state and federal regulations and recommendations pertaining to COVID-19.\nMeter offers both competitive cash and equity compensation. We have a generous vacation policy as well as paid parental leave, health, dental, vision, retirement and commuter benefits.\nIn keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital domestic partner status, sexual orientation, gender identity, disability status, or veteran status. Above and beyond discrimination or harassment based on “protected categories,” Meter also strives to prevent other, subtler forms of inappropriate behavior from ever gaining a foothold in our company. Whether blatant or hidden, barriers to success have no place at Meter.\nReach out if you want to be a part of what we are building.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T23:00:27.000Z"
  },
  "company": {
    "name": "Meter",
    "link": "https://www.linkedin.com/company/meterinc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}