{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nThe Adobe Document Cloud Data Science team is looking for Machine Learning Engineers who can apply AI/ML techniques and help us build solutions that will drive the success of our Document Cloud business. Partnering with the business units, you will be working on the development of various data science models that address challenging business problems including acquisition, engagement, conversion and retention. You will have the opportunity to exercise creativity in problem solving by delivering inventive new solutions within our data ecosystem. We invite you to join a team of hardworking engineers to elevate our customer experiences to the next level.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-06T21:54:04.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Newton",
    "region": "MA",
    "postal_code": "02160",
    "street_address": null,
    "latitude": 42.338028,
    "longitude": -71.21158
  }
}