{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Weaveworks was founded in 2014 and we are the company behind popular Kubernetes tools like Flux, Scope, the official CLI for Amazon EKS called eksctl and the flagship enterprise product Weave Kubernetes Platform.\nOur mission is to help the world’s leading organizations to adopt Kubernetes and other Cloud Native technologies and working practices. Enterprises use our products and services to build better software and operate it reliably, at scale. Our approach brings together container-based application deployment, Kubernetes, and operations tooling in a model we call GitOps.\nWe want to bring an empathetic and collaborative engineer into one of our teams that focuses on a blend of open source and commercial code. We are building a product that enables organizations to operate with a GitOps mindset. This needs someone who is comfortable navigating sometimes unclear scenarios and is proactive in wanting to help figure things out. You will be helping to develop and maintain tools and products which make using cloud-managed and on-premise Kubernetes installations easy.\nWeaveworks is committed to diversity in its workforce and is proud to be an equal opportunity employer. Weaveworks considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. Weaveworks is an Affirmative Action and Equal Opportunity Employer.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T00:00:00.000Z"
  },
  "company": {
    "name": "Weaveworks",
    "link": "https://uk.linkedin.com/company/weaveworks"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}