{
  "job": {
    "title": "Sr. Principle Technologist Information Security",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "CAS uses intuitive technology, unparalleled scientific content and unmatched human expertise to help companies create groundbreaking innovations that benefit the world. As the scientific information solutions division of the American Chemical Society, CAS manages the largest curated reservoir of scientific knowledge, and for 115 years, has helped innovators mine, assess and apply that information to keep businesses thriving. The CAS team is global, diverse, endlessly curious and strives to make scientific insights accessible to innovators worldwide.\nCAS is currently seeking a Senior Security Principal Technologist: This position will be located in our Columbus, OH headquarters.\nAs our company grows and we expand our team, CAS is looking for an exceptional Senior Security Principal Technologist specialized in locking down our corporate assets and network. You'll be joining a team where you have real ownership and a charter to champion best practices, drive change, determine future policy and architecture, while providing the guidance on solutioning complex problems.\nYou will assess threats and vulnerabilities, analyze data and code, define measurable objectives, and drive implementations of security solutions. You will also be responsible for building and implementing testing tools and methodologies, including manual and automated processes, deployment, and monitoring.\nCAS offers a competitive salary and comprehensive benefits package, including a generous vacation plan, medical, dental, vision insurance plans, and employee savings and retirement plans. Candidates for this position must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future. EEO/Minority/Female/Disabled/Veteran",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T02:03:03.000Z"
  },
  "company": {
    "name": "CAS",
    "link": "https://www.linkedin.com/company/cas"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Columbus",
    "region": "OH",
    "postal_code": "43272",
    "street_address": null,
    "latitude": 39.96276,
    "longitude": -82.99629
  }
}