{
  "job": {
    "title": "Entry- Level Developer/Software Test Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "RTTS is the premier pure-play Quality Assurance and testing organization that specializes in Test Automation. Based in midtown Manhattan and serving Fortune 500 companies throughout the world since 1996, RTTS has assisted 700+ companies reach their continuous testing goals.\nRTTS also developed Query\n, QuerySurge is the smart Data Testing solution that automates the data validation & testing of Big Data, Data Warehouses, and Business Intelligence Reports. In forging strategic partnerships with leading software vendors IBM, Microsoft, Oracle, Cloudera, Teradata, SAP and other best-of-breed software providers, RTTS offers the foremost end-to-end solution that ensures application functionality, performance, and data validation and verification.\nFor more information visit us at www.rttsweb.com.\nUsing your strong analytical and coding skills, you’ll be responsible for implementing custom solutions using cutting edge automated functional and performance quality assurance tools to support complex software applications.\nAssignments vary in length depending on our clients’ needs, providing you with the opportunity to learn new technologies and gain valuable exposure to many areas of business while working with client teams and experienced RTTS mentors.\nMust possess an undergraduate or graduate level degree with a concentration in Computer Science, Information Technology or a related field.\nAdditional Information\n$60-70K, depending on experience. Excellent benefits package including medical, dental, 401K, paid vacation and holidays, continuous learning and more. You can expect:\nAll your information will be kept confidential according to EEO guidelines.\nIf you’d like to start your IT career with RTTS, you should know that:\nPlease enclose resume and cover letter.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T00:00:00.000Z"
  },
  "company": {
    "name": "RTTS",
    "link": "https://www.linkedin.com/company/rtts"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}