{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
    "description": "06242021-1144-02\nThe Sponsor’s projects are designed to introduce high-value, innovative technologies and tools to enhance workforce learning experiences and increase the impact of enterprise learning programs. The purpose of this requirement is to obtain technical support for the continuing development, installation, operations, maintenance and management of the Sponsor’s learning technology projects\nThe Contractor shall support planning, analysis, design, specification, implementation, testing, and documentation in support of application software installation.\nThe Contractor shall support application software testing, maintenance and troubleshooting.\nThe Contractor shall support application enhancement and integration (e.g. middleware) requirements with other applications and network systems.\nThe Contractor shall work within Agile teams and short-duration sprints for coordination requirements.\nThe Contactor shall coordinate and manage software and system engineering tasks with mission partners to achieve product functionalities and deployment schedules.\nThe Contractor shall serve as project lead for all aspects of the software development lifecycle, including development of middleware and its integration with COTS and enterprise systems.\nThe Contractor shall lead troubleshooting and solve complex technical problems related to the system.\nThe Contractor shall integrate COTS applications, technologies, and services into the client network.\nThe Contractor shall provide technical coordination with the customer’s security team to provide required accreditation documentation and support all system security requirements.\nThe Contractor shall evaluate new feature suggestions for technical approach and LOE to implement\n| |\nAt Dezign Concepts, we are building a collaboration of professionals to help supply commercial, government and the intelligence communities with the services they need to excel in current and future endeavors. We are a growing company where providing outstanding solutions and delivering impeccable service is our highest priority. We believe that great people make great companies and every day we strive to provide the type of environment that encourages creativity, growth and satisfaction\nDezign Concepts provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\nPowered by JazzHR\nb2cJ9pvqhY",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-24T23:17:02.000Z"
  },
  "company": {
    "name": "Dezign Concepts LLC",
    "link": "https://www.linkedin.com/company/dezignconceptsllc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Virginia",
    "region": "United States",
    "postal_code": "23038",
    "street_address": null,
    "latitude": 37.512905,
    "longitude": -78.697624
  }
}