{
  "job": {
    "title": "100% Remote Lead Software Engineer",
    "industry": "Internet",
    "description": "Title: Remote Lead Software Engineer\nHQ: San Diego, CA\nType: Full-Time + 100% Remote\nCompensation: 150 - 170k (depending on experience)\nRequirements: 7+ years of C#, .NET/ASP.NET and Lead/Mentoring experience\nBonus: .NET Core, Azure, CI/CD, GIT, Docker\nAre you a Lead Software Engineer with great consumer-facing or public-facing site experience? If so, read on...\nWe need you to help design, develop, and scale our public-facing sites! You will be leading a small team implementing full-stack solutions; enabling us to grow our offerings, securely handle increasing traffic, build new products, and expose functionality for automated testing. We are looking for an engineer who loves writing code; understands best practices has a strong desire to learn new technologies and wants to collaborate with teammates. Our team is a tightly-knit and passionate group that works very well together.\nWhat You Will Be Doing\nour architect).\nHave a hands-on attitude. While its important to delegate work to your reports, its also important to be willing to jump in and solve a problem or handle a crisis.\nWhat You Need for this Position\nAt least 7 years of software development experience and 2 - 3 years of leadership/mentoring experience:\nNice to haves: Azure and DevOps Tools\nWhat's In It for You\nGreat Culture, Excellent Health, Dental and Vision Insurance, 401K, Gym Membership.\nSo, if you are seeking a Remote Lead Software Engineer role and have most of the experience above...please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNick.Savard@CyberCoders.com\nNick Savard - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:35:46.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}