{
  "job": {
    "title": "Software Engineer - Front End",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "We’re all about connecting hungry diners with our network of over 300,000 restaurants nationwide. Innovative technology, user-friendly platforms and streamlined delivery capabilities set us apart and make us an industry leader in the world of online food ordering. When you join our team, you become part of a community that works together to innovate, solve problems, grow, work hard and have a ton of fun in the process!\nWe are looking for a front-end engineer to join our organization. The candidate will be working on a small, agile team that is responsible for our React-based web application that is vital to our restaurant partners. We emphasize building stable and scalable solutions as our team is responsible for the management of 600k-1M food orders per day. We pride ourselves on giving the best user experience possible with an emphasis on simple design and providing delight to our restaurant partners.\nGrubhub is an equal opportunity employer. We welcome diversity and encourage a workplace that is just as diverse as the customers we serve. We evaluate qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. If you’re applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an email to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.\nCA Privacy Notice: If you are a resident of the State of California and would like a copy of our CA privacy notice, please email privacy@grubhub.com.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-28T18:53:29.000Z"
  },
  "company": {
    "name": "Grubhub",
    "link": "https://www.linkedin.com/company/grubhub-seamless"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 81100,
    "max_value": 143000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}