{
  "job": {
    "title": "Senior Infrastructure Engineer",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSenior Infrastructure Engineer\nWho are We?\nSessionM is a customer engagement platform empowering the world’s most innovative brands to forge stronger and more profitable customer relationships. The platform scales for the enterprise, globally. SessionM is headquartered in Boston with offices around the globe.\nWho you will work with?\nAs part of this role, you will work closely with architects, software engineers and operations to design, build, deploy, manage and operate our development, test and production environments. You will build and maintain tools to ensure our applications meet our stringent SLA's in a fast paced culture with a passion to learn and contribute. We are looking for a strong engineer with a can do attitude and a passion to solve problems.\nWhat do you get to do everyday?\nWhat kind of person should you be?\nWhat skills do you need?\nWhat can you expect from us?\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:25:20.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}