{
  "job": {
    "title": "Software Engineer - Entry Level",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "We’re looking for entry level engineering talent to join one of the fastest growing, most ambitious engineering teams in the world. We hire talented people and work with them to find the role that suits them best.\nAt HubSpot, apps are owned and developed by small, autonomous, cross-functional teams. You and your team set the goals, set the timelines, build the software, go to user tests, and think like owners. If you like the sound of\n, please apply here so we can learn more about you.\nHubSpot (NYSE: HUBS) is a leading customer relationship management (CRM) platform that provides software and support to help businesses grow better. We build marketing, sales, service, and website management products that start free and scale to meet our customers’ needs at any stage of growth. We’re also building a company culture that empowers people to do their best work. If that sounds like something you’d like to be part of, we’d love to hear from you.\nYou can find out more about our company culture in the HubSpot Culture Code, which has more than 5M views, and learn about our commitment to creating a diverse and inclusive workplace, too. Thanks to the work of every employee globally, HubSpot was named the #4 Best Place to Work on Glassdoor in 2021, and has been recognized for award-winning culture by Great Place to Work, Comparably, Fortune, Entrepreneur, Inc., and more.\nHeadquartered in Cambridge, Massachusetts, HubSpot was founded in 2006. Today, thousands of employees work across the globe in HubSpot offices and remotely. Visit our careers website to learn more about culture and opportunities at HubSpot.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T21:19:05.000Z"
  },
  "company": {
    "name": "HubSpot",
    "link": "https://www.linkedin.com/company/hubspot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 115000,
    "max_value": 120000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cambridge",
    "region": "MA",
    "postal_code": "02239",
    "street_address": null,
    "latitude": 42.36525,
    "longitude": -71.10502
  }
}