{
  "job": {
    "title": "Staff Site Reliability Engineer",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Bestow is the leading digital platform for life insurance. As both a direct-to-consumer destination and an infrastructure provider, Bestow is on a mission to make life insurance accessible to millions of underserved families.\nWe ideate fast, embrace change, and take risks. As a rapidly growing tech startup, we look for the best talent out there and try to stay out of their way. From scaling our business model to expanding our offerings, the day-to-day at Bestow offers endless professional growth opportunities. The people who succeed here look for problems and solutions. They are both passionate about their ideas and open to having their mind changed.\nIn the end, we value the same things our customers do: family. So we strive for work-life balance and believe happy employees make for better experiences and happier customers. It’s a model that helped us land the #2 spot on Forbes’ Best Startup Employers 2021 list. Boom!\nAs a\nyou automate cloud resources, implement developer tooling, and make changes to our products to increase their manageability.\nYou can establish the technical design.\nYou have experience with systems administration and cloud service automation.\nBestow engineers are great teammates. You will spend half of your time embedded with a product team. We do this so that you can get to know the needs of our product teams and ensure we build useful tooling. The remainder of your time will be spent with other Site Reliability Engineers working on cross-cutting projects.\nDo you want to build products to reinvent a centuries-old industry? If so, we'd love to hear from you.\nCloud Infrastructure Projects\nWe believe that all cloud infrastructure should be treated as code. Modifications go through code review and are performed using CI tools.\nAutomate cloud infrastructure using tools like Terraform and Atlantis;\nAdminister our software platform including Kubernetes, BigQuery, and PostgreSQL;\nEvaluate and design solutions for continuous integration, continuous delivery, and DevOps productivity.\nEnsure Reliability of Our Software\nGreat software is more than product features. It simultaneously considers non-functional concerns like security, maintainability, and extensibility.\nWork with product engineers to identify observability/configurability gaps and make code-level improvements;\nCreate tooling to improve the developer experience, helping them achieve value faster and more effectively;\nManage runbooks for incident response;\nMeasure operational performance and make gradual improvements\nWe value diversity at Bestow. We hire, recruit, and promote without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, pregnancy or maternity, veteran status, or any other status protected by applicable law. We understand the importance of creating a safe and comfortable work environment and encourage individualism and authenticity in every member of our team.\nBestow does not sponsor applicants for work visas at this time.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T15:40:35.000Z"
  },
  "company": {
    "name": "Bestow Life Insurance",
    "link": "https://www.linkedin.com/company/bestowlife"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}