{
  "job": {
    "title": "Software Engineer I",
    "industry": "Medical Devices,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "Medtronic Cardiac Rhythm Management(CRM) R&D teams develop the medical technologies that save lives and improve quality of living for millions of patients across the world. As part of the CRM Operation team, the Monitoring and Observability team leverages various software technologies to create, enhance, and observe into all of the applications and in all environments. The team is looking for a proactive, self-starting, strong software development engineer.\nThis position is a Software Engineer I role within CRHF organization, focused on Monitoring/Observability development. It is responsible for the development, maintenance, and support of the CareLink application. It works in a team setting to meet/exceed business and quality objectives. This individual will operate in all phases and contribute to all activities of the software development process from design to verification.\nThis individual will work in a software development ecosystem that includes but is not limited to Microsoft Azure, C#, ASP.NET, MVC, Git, Azure DevOps, Octopus Deploy, Azure DevOps Pipelines, API, Microservices, Microsoft SQL Server.\n#CRMSoftware\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)\nAdditional Information",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T19:43:02.000Z"
  },
  "company": {
    "name": "Medtronic",
    "link": "https://www.linkedin.com/company/medtronic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Mounds View",
    "region": "MN",
    "postal_code": "56304",
    "street_address": null,
    "latitude": 45.108055,
    "longitude": -93.20898
  }
}