{
  "job": {
    "title": "Machine Learning/AI Engineer",
    "industry": "Biotechnology,Research,Medical Devices",
    "description": "The Machine Learning/AI Engineer will be part of a team responsible to develop the infrastructure, system and predictive modeling and tools to enable Illumina Proactive, a predictive maintenance and system troubleshooting product that delivers enhanced customer experience and supports Illumina’s Service and Support organization. To accomplish this Machine Learning/AI Engineer will work cross-functionally with software development teams and product engineering to develop complex algorithms and machine learning models. The position will provide technical leadership to other engineers, analysts and programmers from design to deployment of models and other analytical projects. The position may also provide analytics support to other parts of the organization including Product Development, Manufacturing, Sales and Marketing and/or Finance.\nAt Illumina, we strive to foster a diverse and inclusive workplace by cultivating an environment in which everyone contributes to our mission. Built on a strong foundation, Illumina has always been rooted in openness, collaboration, and seeking alternative views and perspectives to propel innovation in genomics. We are proud to confirm a zero-net gap in pay, regardless of gender, ethnicity, or race. We also have several Employee Resource Groups (ERG) that deliver career development experiences, increase cultural awareness, and demonstrate our collective commitment to diversity and inclusion in the communities we live and work. We are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you require accommodation to complete the application or interview process, please contact accommodations@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T18:50:13.000Z"
  },
  "company": {
    "name": "Illumina",
    "link": "https://www.linkedin.com/company/illumina"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}