{
  "job": {
    "title": "Software Engineer-MTS-Force.com-Web Services-OOP/OOD-Jenkins/Maven-Com. Design Patterns-CIO Org #: 21-06309",
    "industry": "Information Technology and Services,Accounting,Financial Services",
    "description": "Bachelor's Degree or equivalent\nPreferred 4&plus; years relevant experience\nTwo SFDC certifications\nExperience with Salesforce Sales, Marketing, and Service clouds\nGood understanding of a functional area primary technology and platform\nDemonstrated ability to execute on features of medium to high complexity within his/her functional area.\nPartners with a more senior engineer to deliver complex features.\nWritten code that others can understand, support, maintain, and expand.\nDemonstrated consistent, successful delivery over time.\nConsidered a good problem solver who can identify root cause within functional domain and collaborate to identify root cause across system boundaries quickly\nAware of interdependencies between his/her functional areas and other functional area, both upstream and downstream.\nSolid understanding of a major technology employed in IT development: Java, Force.com, Front-End technologies/CMS (Object Oriented JavaScript, CSS), PL/SQL, SOA, Ruby etc., solid understanding of remainder\nAware of and understands trends, technical developments in the broader industry and how those can be applied at SFDC.\nBasic understanding of the architecture of the major functional platform(s) within the group or BU\nRecognition of when to configure vs. build\nWork needs direction and oversight from a more senior member of the team\nPartners with a more senior engineer to deliver very complex or foundational features.\nAble to use and extend existing code framework to implement new functionality.\nMaintains at least one applicable technology certification\nIndustry Standard ETL Tool (Informatica, Ab Initio, etc)Sql , PL/SQL, DatabaseShell ScriptingLinux/Solaris\nbasic commands -Understanding of Data models\nSolid understanding of a business area and multiple processes within that area.\nAble to actively participate in functional process discussions (level 3-4)\nUnderstanding of immediate upstream / downstream impacts from functional decisions\nUnderstanding of underlying data schema, data definitions and relationship to process\nDemonstrated understanding of both industry and SFDC-specific policies & practices. Applies them to his/her work effectively.\nTrack record of delivering on features of medium complexity over a period of time\nTrack record of meeting sprint commitments\nMinimal code rollbacks or post production bugs. A highly experienced professional with a full understanding of area of specialization; Has wide-ranging experiences, uses professional concepts and company objectives to resolve complex issues in creative and effective ways. All software engineers must be well versed in Agile Methodology & have ADM Training. Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results. Internal and external contacts often pertain to company plans and objectives.",
    "employment_type": "CONTRACTOR",
    "date_posted": "2021-09-08T03:04:21.000Z"
  },
  "company": {
    "name": "HireTalent - Diversity Staffing &amp; Recruiting Firm",
    "link": "https://www.linkedin.com/company/hiretalent_"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}