{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "JOB TYPE: Freelance, Contract Position - No agencies (See notes below)\nLOCATION: Remote\nHOURLY RANGE: Our client is looking to pay $80 - $100 USD / HR\nESTIMATED DURATION: 40Hrs/Week - Long Term, 6-month project\nBraintrust (usebraintrust.com) is a user-controlled talent network, where you keep 100% of what you earn and actually get to own the platform. We've been onboarding some big clients and specifically need a\nfor our client.\nOur client is a leading global specialty retailer offering high-quality, on-trend clothing, accessories and personal care products at affordable prices. Our clients brand is built on more than 40 years of customer focus, dedication and innovation. Starting with one store in 1977, our brands have grown to more than 1,000 stores in the United States, Canada, Mexico, China and Hong Kong, and ship to over 80 countries worldwide through our websites and mobile applications. Our clients merchandise also is available at more than 200 international locations operated by licensees in 25 countries.\nQualified candidates will be invited to do a screening interview with the Braintrust staff. We will answer your questions about the project, and our platform. If we determine it is the right fit for both parties, we'll invite you to join the platform and create a profile to apply directly for this project.\nC2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.\nBraintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.",
    "employment_type": "CONTRACTOR",
    "date_posted": "2021-08-16T16:58:13.000Z"
  },
  "company": {
    "name": "Braintrust",
    "link": "https://www.linkedin.com/company/usebraintrust"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}