{
  "job": {
    "title": "Senior Cloud Engineer - AWS, AI, ML",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "rajeev.peterson@Optello.com\nOne of the fastest-growing and hottest (stealth) companies in the country. Founded in 2020, we are building a platform at the intersection of IoT and AI, enabling enterprises to digitize physical environments, making them intelligent and controllable, and unlocking unimagined opportunities for growth. The company boasts a rockstar group of founders including Founder/CEO of SmartThings and Head of IoT at Engineering leader for Amazon Alexa, AWS and Fire TV, and CTO of SmartThings, Cofounder/President of ReachLocal and board roles at iD Tech, Quartet Health and Music Audience Exchange, and VP Engineering of SmartThings and board member at Zigbee Alliance.\nWe offer an incredible opportunity to work with the best in tech and exciting technologies: IoT, visual AI, Edge computing, field-deployed ML, hardware, and scaling cloud for tons of events. The company is based in San Francisco, but has hubs in Dallas and Minneapolis, but is hiring remotely. Benefits are excellent, plus equity for tech talent. An excellent, engineering-led culture that values good people, hard work, and talent.\nWhat You Will Be Doing\nWork with cloud developers, product managers and designers to guide and make technical decisions throughout the development process.\nLead the architecture and design of our client platform.\nMentor other developers and contractors throughout the development lifecycle.\nPrototype unproven concepts to inform final implementations.\nStay abreast of cloud trends and topics\nAutomate everything possible. Leverages CI/CD to automate repeatable tasks and quality checks.\nManaging Infrastructure as Code\nManaging and supporting engineering teams release software\nBuilding the tools and support for teams to be able to self-manage in an owner operator model\nWhat You Need for this Position\nPassionate for continuous learning and understanding things in and around Cloud development\nBS/MS in Computer Science or equivalent practical experience\n4+ years of experience with Cloud technologies and languages (Javascript, Typescript, Python, Kotlin, Java, Node.js, NestJS)\nAWS Cloud Experience using EC2, Lambda, ECS, RDS and DocumentDB\nExperience building event driven architectures at high scale using Kafka\nExperience with Infrastructure as code using Terraform & Cloudformation\nExperience with high availability deployment across many regions and availability zones\nExperience with SumoLogic, DataDog, CloudWatch or similar tools for observability\nDeep experience with Git, Github, Pull Request, and Rebasing\nAbility to operate in a fast-paced, deadline-driven, collaborative and iterative development environment\nAbility to lead and define cloud initiatives with other engineers\nExperience working with a highly reactive platform\nExperience with establishing, promoting and ensuring best practices in Cloud codebases including common architectures and standardized unit testing.\nExperience building reusable libraries, SDKs and shared components used by many applications.\nIntricate knowledge of building and managing Https web services using REST.\nExperience with multiple AWS accounts\nExperience working with AI, ML or AR.\nExperience with Docker container development and hosting\nExperience with growing large teams and can describe the issues that arise with growth.\nPrevious startup experience.\nExperience with Serverless architectures\nSo, if you are a Senior Cloud Engineer with experience, please apply today or email me at rajeev.peterson@Optello.com\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRajeev.Peterson@Optello.com\nRajeev Peterson - Sr. Executive Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nOptello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:30:11.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}