{
  "job": {
    "title": "Lead Software Development Engineer",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nLead Software Development Engineer\nMDES is looking for strong, innovative Technical Leads to help lead Mastercard's next generation of Digital Payment products that change how our customers choose to pay. We are looking for Technical Leads who can bring unique perspectives and innovative ideas to all areas of development, and are interested in continuing to improve our platform through the ever changing technology landscape. In this role, you will work on a multiple projects, which are critical to Mastercard’s role in the Digital Payment Space, leveraging Pivotal Cloud Foundry and microservice architecture.\nAn ideal candidate is someone who works well with and can lead a cohesive team-oriented group of developers, who has a passion for developing great software, who enjoys solving problems in a challenging environment, and who has the desire to take their career to the next level. If any of these opportunities excite you, we would love to talk.\nQualifications:\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nEvery person working for, or on behalf of, Mastercard is responsible for information security.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:22:20.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": "USD",
    "min_value": 100000,
    "max_value": 145000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "O'Fallon",
    "region": "MO",
    "postal_code": "63304",
    "street_address": null,
    "latitude": 38.808643,
    "longitude": -90.69996
  }
}