{
  "job": {
    "title": "Principal Site Reliability Engineer (R&amp;D)",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Site Reliability Engineers are responsible for ensuring that our platform is stable and healthy. We break down barriers by fostering developer ownership and empowering developers. We support them by building creative and robust solutions to operations problems. We use our background as generalists to work closely with product development teams from the early stages of design all the way through identifying and resolving production issues. We see the big picture. We help create and enforce standards while facilitating an agile and learning culture. We use SRE principals such as blameless postmortems and operational load caps to ensure we’re constantly improving our knowledge and maintaining a good quality of life. Overall, we’re passionate about automation, learning and participating in dynamic day to day work.\nSite Reliability is about combining development and operations knowledge and skills to help make the organization better. Whether you have a development background and are interested in learning more about operations or are a DevOps/Systems Engineer who is interested in developing internal tools - Cvent SRE can benefit from your skillsets. Ultimately, we are looking for passionate people who love learning and technology.\nWe use a wide variety of technologies and avoid getting locked into a single path. If we find something that works better than what we have, we always are open to trying it out.\nAs a Lead/Principal Site Reliability Engineer, you will use your advanced development and operations knowledge to identify and prioritize issues. Find universal solutions to common problems and mentor and support junior staff.\nWe believe that passion and willingness to learn outweigh any list of skills, however having experience in some of the areas below would help you hit the ground running and show that you can be successful as an SRE at Cvent.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-25T11:41:46.000Z"
  },
  "company": {
    "name": "Cvent",
    "link": "https://www.linkedin.com/company/cvent"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": "USD",
    "min_value": 98000,
    "max_value": 165000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Oregon",
    "region": "United States",
    "postal_code": "97350",
    "street_address": null,
    "latitude": 43.938683,
    "longitude": -120.558105
  }
}