{
  "job": {
    "title": "Scientist/Senior Scientist, Hematology Reverse Translation",
    "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "We seek a highly talented and motivated Scientist/Senior Scientist to join Genentech’s cutting-edge Hematology Reverse Translation effort.\nThe candidate will be a lab-based member of a cross-functional team of biomarker scientists, discovery scientists, pathologists, computational scientists, and clinical researchers working together to translate clinical trial findings into the next generation of therapeutic strategies. The candidate will generate novel biological insights from clinical trial samples to identify targets and combination strategies that will shape new discovery and development programs. The candidate will grow over time into a leader in mechanisms of response and resistance to immune engaging therapies and translational medicine in hematology. Genentech has an extensive hematology pipeline and a wealth of research and clinical expertise in heme malignancies including multiple T-cell engaging bispecific antibodies in early and late-stage development. The candidate will have unparalleled infrastructure and research support at their disposal. The successful candidate is expected to work seamlessly as part of a multifunctional team, have excellent oral and written communication skills, participate and contribute to team meetings, publish in high quality scientific, technical or medical journals and present at internal and external meetings.\nGenentech, a member of the Roche group and founder of the biotechnology industry, is dedicated to pursuing groundbreaking science to discover and develop medicines for people with serious and life-threatening diseases. To solve the world's most complex health challenges, we ask bigger questions that challenge our industry and the boundaries of science to transform society. Our transformational discoveries include the first targeted antibody for cancer and the first medicine for primary progressive multiple sclerosis.\nDiversity and Inclusion (D&I) are critical to the success of our company and our impact on society. We believe that by championing diversity of background, thought and experience, we can foster a sense of belonging and provide an environment where every employee feels valued, included, and able to contribute their best for the patients we serve. We’re focused on attracting, retaining, developing and advancing our people to their full potential by rewarding bold ways of thinking and integrating inclusive behaviors into every aspect of our work.\nThe next step is yours. To apply today, click on the \"Apply for this job\" button.\nGenentech is an equal opportunity employer & prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, disability, marital & veteran status. For more information about equal employment opportunity, visit our Genentech Careers page .\nFull time\nRegular",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:22:46.000Z"
  },
  "company": {
    "name": "Genentech",
    "link": "https://www.linkedin.com/company/genentech"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 147000,
    "max_value": 229000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "South San Francisco",
    "region": "CA",
    "postal_code": "94083",
    "street_address": null,
    "latitude": 37.65568,
    "longitude": -122.41248
  }
}