{
  "job": {
    "title": "2021 Summer PhD Backend Software Engineer Intern",
    "industry": "Computer Software,Consumer Services,Information Technology and Services",
    "description": "Uber's fulfillment and product intelligence platforms are looking for Ph.D. student interns for summer of 2021. We seek candidates with a background in databases, distributed systems and infrastructure.\nYou will work closely with members of the group on building or extending tools that improve Uber's fulfillment and experimentation systems. These are systems that are critical for the realtime operation of every trip at Uber.\nMost intern projects also have external visibility via open-source, blog posts, publications, or talks.\nDesigns, builds, and operates the always-on platform for Uber to ensure that every trip is a magical one from the time you request a ride to the time you complete a ride. The team provides the foundation and business models to enable transportation of people & things from origin to destination.\nWork on services that handle a significant % of critical inbound traffic to Uber.\nDesigns, builds, and operates the experimentation and metrics platform Uber uses to make every product decision at the company. This full stack data team builds mobile SDKs, at scale backends (500k+ QPS), large scale data pipelines and systems (1.5 Petabyte data stores), statistics engines and analytics tools, front-ends, and lambda/kappa streaming architectures that power both human and machine decision making within the company. Work on applied science problems at Uber scale.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T22:03:42.000Z"
  },
  "company": {
    "name": "Uber",
    "link": "https://www.linkedin.com/company/uber-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94101",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}