{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Financial Services",
    "description": "organization develops applications and provides technology support for corporate functions across JPMorgan Chase, including Global Finance, Corporate Treasury, Risk Management, Human Resources, Compliance, Legal, and all functions within the Corporate Administrative Office (CAO).\nCT teams are aligned with corporate partners' evolving technology needs and the firm's ever expanding technology controls agenda.\nA top CT priority is building scalable corporate systems. Teams focus on:\nLegal Technology (LT) is part of Corporate Technology which delivers technology solutions to support Legal as they advise the business on applicable laws, regulations and rules that govern our business globally, and assess and measure compliance and related risks, and monitor and test the adequacy of the firm's compliance control environment. Legal Technology is the steward for the design, build and management for the firm's Legal Technology portfolio across all Lines of Business and global regions. Legal Technology is responsible for partnering with our clients on evolving business capabilities, improving end user experience with our solutions and services, and ensuring that we continue to provide continuous improvement on the systems that are relied upon across the firm. Legal Technology supports legal functions covering Matter & Spend Management, eDiscovery Platform Services, Knowledge Management and Lifecycle Management.\nLegal Technology is seeking an Application Developer who will focus on SRE functions. The candiate should have good skills in Java, Groovy, Python, and/or .Net for work on various applications in Legal Technology. Legal Technology has embedded SRE into the Application Development teams, therefore this individual will be working alongside the AD team on varoius priorities in the back log. The individual is responsible for delivering solutions that meet the requirements of our key clients . The Legal portfolio is experiencing significant change and growth and includes building out a strategic application for managing various activities . This initiative includes cloud-minded design, Agile practices, tool standardization and automated delivery in modernizing Legal technology.\nJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\nEqual Opportunity Employer/Disability/Veterans",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T13:17:04.000Z"
  },
  "company": {
    "name": "JPMorgan Chase &amp; Co.",
    "link": "https://www.linkedin.com/company/jpmorganchase"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Westerville",
    "region": "OH",
    "postal_code": "43082",
    "street_address": null,
    "latitude": 40.125942,
    "longitude": -82.93162
  }
}