{
  "job": {
    "title": "Data Scientist - Entry Level",
    "industry": "Construction,Information Technology and Services,Mechanical or Industrial Engineering",
    "description": "Are you interested in joining some of the brightest talent in the world to strengthen the United States’ security? Come join Lawrence Livermore National Laboratory (LLNL) where our employees apply their expertise to create solutions for BIG ideas that make our world a better place.\nWe are committed to a diverse and equitable workforce with an inclusive culture that values and celebrates the diversity of our people, talents, ideas, experiences, and perspectives. This is essential to innovation and creativity for continued success of the Laboratory’s mission.\nWe have openings for\nto provide solutions for various projects. You will work in a dynamic, multidisciplinary team of independent/entrepreneurial computer scientists and engineers who research, develop, and integrate state-of-the-art algorithms, software, hardware, and computer systems solutions to challenging research and development problems. This position is in the Global Security Computing Applications Division in the Computing Directorate.\nThis position requires a Department of Energy (DOE) Q-level clearance.\nIf you are selected, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. Q-level clearance requires U.S. citizenship. If you hold multiple citizenships (U.S. and another country), you may be required to renounce your non-U.S. citizenship before a DOE L or Q clearance will be processed/granted.\nLearn more about our company, selection process, position types and security clearances by visiting our Career site.\nLLNL is a Department of Energy (DOE) and National Nuclear Security Administration (NNSA) Laboratory. Some positions will require a DOE L or Q clearance (please reference Security Clearance requirement above). If you are selected and a clearance is required, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. An L or Q clearance requires U.S. citizenship. For additional information please see DOE Order 472.2.\nLLNL is an affirmative action and equal opportunity employer that values and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, pregnancy, protected veteran status, age, citizenship, or any other characteristic protected by applicable laws.\nIf you need assistance and/or a reasonable accommodation during the application or the recruiting process, please submit a request via our online form.\nThe California Consumer Privacy Act (CCPA) grants privacy rights to all California residents. The law also entitles job applicants, employees, and non-employee workers to be notified of what personal information LLNL collects and for what purpose. The Employee Privacy Notice can be accessed here.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T04:02:30.000Z"
  },
  "company": {
    "name": "Lawrence Livermore National Laboratory",
    "link": "https://www.linkedin.com/company/lawrence-livermore-national-laboratory"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 117000,
    "max_value": 203000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Livermore",
    "region": "CA",
    "postal_code": "94551",
    "street_address": null,
    "latitude": 37.675915,
    "longitude": -121.758865
  }
}