{
  "job": {
    "title": "Software Engineer - Customer",
    "industry": "Marketing and Advertising,Food &amp; Beverages,Computer Software",
    "description": "At sweetgreen, a Software Engineer is responsible for building, testing, debugging/troubleshooting, and maintaining code for both web and native applications. They share some infrastructure responsibilities regarding DevOps, take the lead on continuous integration and deployment, and drive standards with Lead Engineers and the rest of the department.\nIt is expected that an Engineer will promote strong design principles as they relate to scalability, disposable resources, automation, loose coupling, service oriented design, databases, removing single points of failure, cache, cost, and security. They are trusted squad members that heavily influence the design and implementation of new services while also integrating with and upgrading existing ones to address mission-critical problems. Working closely with Senior Engineers, Software Engineering Managers and Principals, they champion architectural decisions that facilitate the work of their teams and our business as a whole.\nSuccess depends on balancing their schedules to implement their designs alongside their peers as hands-on senior contributors.\nWithin 90 days, be actively contributing to the development of a complete in-house system for the Customer Relationship Platform (CRP) system. The approach needs to be implemented in a sequence of logical steps addressing major business problems as part of the process: scalability, compatibility, and incrementality.\nsweetgreen is on a mission to build healthier communities by connecting people to real food. We passionately believe that real food should be convenient and accessible to everyone. Every day in each sweetgreen, our 3,500 team members make food from scratch, using fresh ingredients and produce delivered that morning. And in our local communities, we’re committed to leaving people better than we found them. We’re in the business of feeding people, and we’re out to change what that means.\nsweetgreen provides equal opportunities for everyone that works for us and everyone that applies to join our team, without regard to sex or gender, gender identity, gender expression, age, race, religious creed, color, national origin, ancestry, pregnancy, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, any service, past, present, or future, in the uniformed services of the United States (military or veteran status), or any other consideration protected by federal, state, or local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T00:00:00.000Z"
  },
  "company": {
    "name": "sweetgreen",
    "link": "https://www.linkedin.com/company/sweetgreen"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}