{
  "job": {
    "title": "Data Engineer I (PD)",
    "industry": "Financial Services,Information Technology and Services",
    "description": "Purpose of Job\nData Engineers deliver quality reporting and data intelligence solutions to the organization and assist client teams with drawing insights to make informed, data driven decisions. Data Engineers (DEs) are engaged in all phases of the data management lifecycle; gather and analyze requirements, collect, process, store and secure, use, share and communicate, archive, reuse and repurpose data. Identify and manage existing and emerging risks that stem from business activities and ensure these risks are effectively identified and escalated to be measured, monitored and controlled.\nJob Requirements\nWe are seeking a talented Data Engineer I for multiple positions in our bank lines of business, in our Plano, TX, San Antonio, TX , Phoenix, AZ offices and or 100% work from home remote environment.\nData Engineers deliver quality reporting and data intelligence solutions to the organization and assist client teams with drawing insights to make informed, data driven decisions. Data Engineers (DEs) are engaged in all phases of the data management lifecycle; gather and analyze requirements, collect, process, store and secure, use, share and communicate, archive, reuse and repurpose data. Identify and manage existing and emerging risks that stem from business activities and ensure these risks are effectively identified and escalated to be measured, monitored and controlled.\nUSAA knows what it means to serve. We facilitate the financial security of millions of U.S. military members and their families. This singular mission requires a dedication to innovative thinking at every level.\nUSAA Careers – World Class Benefits (31 seconds)\nWhen you apply for this position, you will be required to answer some initial questions. This will take approximately 5 minutes. Once you begin the questions you will not be able to finish them at a later time and you will not be able to change your responses.\nThe above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.\nUSAA has an effective process for assessing market data and establishing ranges to ensure we remain competitive. You are paid within the salary range based on your experience and market position. The salary range for this position is: $88,200- 158,900* ( this does not include geographic differential it may be applied based on your work location)\nEmployees may be eligible for pay incentives based on overall corporate and individual performance or at the discretion of the USAA Board of Directors.\nwill be addressed on an individual-basis for applicable roles that are consistently scheduled for non-core hours.\nAt USAA our employees enjoy best-in-class benefits to support their physical, financial, and emotional wellness. These benefits include comprehensive medical, dental and vision plans, 401(k), pension, life insurance, parental benefits, adoption assistance, paid time off program with paid holidays plus 16 paid volunteer hours, and various wellness programs. Additionally, our career path planning and continuing education assists employees with their professional goals.\nPlease click on the link below for more details.\nassistance is\nfor this position.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T06:05:49.000Z"
  },
  "company": {
    "name": "USAA",
    "link": "https://www.linkedin.com/company/usaa"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Plano",
    "region": "TX",
    "postal_code": "75093",
    "street_address": null,
    "latitude": 33.019695,
    "longitude": -96.697586
  }
}