{
  "job": {
    "title": "Software Engineer, Database Infra",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 392 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.\nAs a member of Team DB, you will be responsible for maintaining and building our relational database storage solutions. You will be constantly collaborating with our customers, tech leadership and your peers, learning and teaching new ways of making our platform even more resilient, robust and scalable. You should have a solid understanding of relational datastores and ideally be familiar with or willing to learn Postgres internals. You will also automate and execute complicated zero downtime production operations on high volume databases.\nSenior Software Engineer, Database Infrastructure\nBraintree lets you move money from one place to another safely and securely. Every time you pay for an Uber ride, book a stay through Airbnb, or pay with PayPal when you check out online, you’re probably using our product. It sounds complex (and it is), but we make it so simple you can’t tell we’re there.\nWe solve world-scale problems and provide opportunities to match. We build diverse teams that recognize our strengths and allow us to work on our weaknesses. You bring skills and a relentless focus on the customer, and we'll provide the support you need to do the best work of your life.\nCheck us out: GitHub : Blog : Twitter : LinkedIn : Facebook : The Muse : Glassdoor\nThe Team\nOur focus is teaming with smart engineers who are passionate about their craft and excited to build software for our unique solutions in the space.\nAt Braintree, developers have the chance to work on various teams and stacks. Although most of our software is written in Ruby, we believe in using the best tool for the job. For example, we’ve written data platforms in Clojure, payment gateways in Java, and contextual commerce in Ruby. Here’s more:\nThe Role\nAs a member of Team DB, you will be responsible for maintaining and building our relational database storage solutions. You will be constantly collaborating with our customers, tech leadership and your peers, learning and teaching new ways of making our platform even more resilient, robust and scalable. You should have a solid understanding of relational datastores and ideally be familiar with or willing to learn Postgres internals. You will also automate and execute complicated zero downtime production operations on high volume databases.\nWhat You’ll Do\nWhat We’re Looking For\nWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.\nREQ ID R0064776",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T07:52:25.000Z"
  },
  "company": {
    "name": "Braintree",
    "link": "https://www.linkedin.com/company/braintree"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 97300,
    "max_value": 152000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}