{
  "job": {
    "title": "Principal 3D Augmented Reality Engineer - C++ Mobile Engine",
    "industry": "Computer Software",
    "description": "If you are a Principal 3D Augmented Reality Engineer with experience, please read on!\nHeadquartered in the San Francisco Bay Area, we're one of the largest and well-known technology companies in the world. Our world-renowned software has changed the world of design forever. We've recently launched a new product and are looking to bring on a talented senior-level engineer. This position will require someone with an expert level of knowledge of the C++ Engine. Ideally, the right candidate will have 3D Augmented Reality or Mobile Gaming experience.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a Principal 3D Augmented Reality Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nCody.Friend@CyberCoders.com\nCody Friend - Director of Recruiting - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:32:16.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}