{
  "job": {
    "title": "REMOTE Lead Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Lead Site Reliability Engineer with experience, please read on!\nTop Reasons to Work with Us\nOur mission is to replace classic college-level textbooks, homework, and lab assignments with interactive and animated online textbooks that allow instructors to modify content and monitor student participation/performance. Currently, we are used in over 600 universities by over 4500k students and offer the excitement of a young, energetic startup environment with a masterfully engineered platform and high-demand content for the STEM college market.\nWhat You Will Be Doing\nAs the Lead Site Reliability Engineer on our team, you will be responsible for creating and owning production infrastructure and services. This infrastructure includes multiple Kubernetes clusters, CI/CD solutions, and deployment of security tooling to protect student data. You will be critical in the scaling of our educational products to hundreds of thousands of students.\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a Lead Site Reliability Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nKurt.Holzmuller@Optello.com\nKurt Holzmuller - Associate Manager - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T13:09:55.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Los Gatos",
    "region": "CA",
    "postal_code": "95030",
    "street_address": null,
    "latitude": 37.22134,
    "longitude": -121.97964
  }
}