{
  "job": {
    "title": "Lead Software Engineer - (C#/ .NET-Docker/Kubernetes)",
    "industry": "Hospitality",
    "description": "If you are a Lead Software Engineer with C# / .NET - Docker/Kubernetes experience, please read on!\nWe are the leading provider of innovative automation technology for the hospitality industry. We design and market advanced software and hardware products, including state-of-the-art kitchen management technology that enables companies to effectively enhance the productivity of their hospitality business.\nReporting to the Manager of Software Development, the Lead Engineer is responsible for leading the development of our product features and capabilities. You will work in an agile environment and help with the design, implementation, and testing of our products.\nTop Reasons to Work with Us\nWhat You Will Be Doing\nWhat You Need for this Position\n5+ years experience :\nSo, if you are a Lead Software Engineer with C# / .NET experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNate.Shuman@CyberCoders.com\nNate Shuman - Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:49:00.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Louisville",
    "region": "KY",
    "postal_code": "40270",
    "street_address": null,
    "latitude": 38.256077,
    "longitude": -85.75157
  }
}