{
  "job": {
    "title": "Data Scientist",
    "industry": "Pharmaceuticals",
    "description": "– Pharm Sci & PGS Statistics and Analytical Research and Development Groups\nThe Pharmaceutical Science and Manufacturing Statistics group supports a wide variety of activities in drug development and manufacturing spanning both new and marketed, chemical and biological entities. This position is located at the Groton, CT facility.\n:\n:\n:\nRelocation support available\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\nMedical",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T22:33:52.000Z"
  },
  "company": {
    "name": "Pfizer",
    "link": "https://www.linkedin.com/company/pfizer"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Groton",
    "region": "CT",
    "postal_code": "06320",
    "street_address": null,
    "latitude": 41.343693,
    "longitude": -72.07877
  }
}