{
  "job": {
    "title": "Federal - ServiceNow Senior Developer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Organization: Accenture Federal Services\nLocation: Springfield, VA and Washington, DC\nWe are:\nPeople who use technology to solve hard problems. Including ones that did not exist a few years ago. We are a U.S. Federal subsidiary, drawing from the power of Accenture—one of only five Global Strategic Partners with ServiceNow. We deliver the integrated, mobile and interactive experience that the people in our country demand. We strengthen the nation’s security with workflow automation, intelligent operations and machine learning. We’re passionate and honest. And we thrive in a world of constant change.\nYou are:\nA proactive thinker who is willing to take a chance. Curious and self-motivated, you’re willing to explore new technologies. You’re ready to push boundaries—and yourself. You’re here to improve the way our country works because you care. And you’re ready to share your ideas with our team, knowing we’ll listen.\nT he work:\nHere’s what you need:- Experience with JavaScript development in ServiceNow components\nBonus points if you have:\nAn active security clearance or the ability to obtain one may be required for this role.\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).\nAccenture is a Federal Contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.\nEqual Employment Opportunity\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\nAccenture is committed to providing veteran employment opportunities to our service men and women.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:11:48.000Z"
  },
  "company": {
    "name": "Accenture Federal Services",
    "link": "https://www.linkedin.com/company/accenturefederalservices"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}