{
  "job": {
    "title": "Software Engineer",
    "industry": "Medical Devices,Biotechnology,Pharmaceuticals",
    "description": "Personalis is a genome-scale diagnostics company pioneering genome-guided medicine. Our research and clinical products are focused on helping diagnose and treat cancer and inherited genetic disease. Located in Menlo Park, CA, we are seeking a talented and highly motivated Senior User Interface Engineer to join our team.\nOur priority is to obtain the most accurate genetic data from each sample, and then to draw the reliable medically focused conclusions from these. Our tests are based on next generation sequencing, conducted in our state-of-the art laboratory. We analyze results utilizing proprietary databases, advanced human reference sequences, and sophisticated algorithms.\nIf you are passionate about applying your talent and experience in Software Engineering towards helping patients with cancer and genetic disease, join us!\nBe part of an ambitious team which you can trust every day to deliver the best outcome. Owning products, leading design, development and operations of end user facing software and technologies will be your day-to-day responsibility. You’ll be involved in building and operating web portals, workflow management, automated genetic data interpretation, reporting and analytics products in collaboration with various internal and external stakeholders.\nBeing passionate about software, technologies and processes is a must in this role. Applying that passion to solve customer needs will be your achievements. Working with people is an assumed skill to have. You’ll be impactful towards creating high quality reusable components and interfaces that delights customers.\nEDUCATION",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:37:31.000Z"
  },
  "company": {
    "name": "Personalis, Inc.",
    "link": "https://www.linkedin.com/company/personalis-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Menlo Park",
    "region": "CA",
    "postal_code": "94029",
    "street_address": null,
    "latitude": 37.45322,
    "longitude": -122.18322
  }
}