{
  "job": {
    "title": "Software Engineer - Junior to Mid-Level",
    "industry": "Information Technology and Services,Defense &amp; Space,Computer &amp; Network Security",
    "description": "Full Time\nLexington, MA, US | Huntsville, AL, US\nWe are pleased to announce the opening for a Software Engineer who will join our Technical Solutions team in Huntsville, Alabama or Lexington, Massachusetts and become part of our rapidly growing technology company operating in missile defense, cybersecurity, test range modernization, and space control marketspaces. You will be part of a team of experienced and passionate engineers and scientists in developing software to support the modernization of advanced radars, optical systems, and other missile defense test range instrumentation.\nYou must have a bachelor’s degree at minimum, in a technical field such as Computer Science, Mathematics, or Physical Science, or the equivalent relevant experience combined with education. Also, we’re looking for someone with experience working with complex systems, software design and analysis, and writing testable code. Finally, you must possess or have the ability to obtain an active SECRET clearance. Lacking any one of these disqualifies you from this job.\nnou Systems, Inc. (or nSI for short) is a rapidly growing technology company that cares about its people located all over the globe. Our people are passionate about missile defense, cybersecurity, test range modernization, and all-things space and space-market related. We offer significant advancement and personal career development opportunities within our dynamic high-tech company.\nAlthough we are a rapidly growing company, winning the Inc. 5000 List as one of America’s fastest-growing private companies from 2017–2021, our culture is firmly established in treating our employees like family. See some words our employees use to describe our culture with the attached Culture Cloud.\nnou Systems, Inc. offers a comprehensive, total rewards package that includes competitive compensation and diverse benefits that reflect our company culture of service, excellence, and a supportive work environment.\nEmployment opportunities at nSI are based upon a candidate’s qualifications and capabilities to perform the essential functions of a particular job and are free from discrimination based on race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, protected veteran status, genetic information, or any other characteristic protected by law. For our compete EEO/AA and Pay Transparency statement, please visit www.nou-systems.com/workingatnou. U.S. citizenship is required for most positions.\nPI145531010",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T04:46:28.000Z"
  },
  "company": {
    "name": "nou Systems, Inc.",
    "link": "https://www.linkedin.com/company/nou-systems-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Lexington",
    "region": "MA",
    "postal_code": "02420",
    "street_address": null,
    "latitude": 42.44817,
    "longitude": -71.224724
  }
}