{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Airtable is a mission-critical system for a diverse set of teams and industries. We build our platform to scale, stay resilient, and deliver a delightful user experience all around. Our infrastructure requires thorough thinking, deep research into how things work, and rigorous coding. Our mission is ambitious, but we like to keep our infrastructure simple.\nWe’re looking for site reliability engineers who care deeply about building robust tools and operational practices that enable scale. Not only will you automate and build the workflows that support scaling out our architecture, you’ll also work closely with the rest of engineering to enable your peers to deliver and manage their features reliably, safely and efficiently.\nAirtable is working on the next computer revolution: one where anyone – even without technical training – can create customized applications that fit their needs, build more interconnected teams, and take part in a growing community of people who share what they create. Founded in 2012 and headquartered in San Francisco, Airtable powers teams at more than 250,000 organizations around the world. Our most recent funding round valued Airtable at $5.77 billion and raised $270 million in additional capital, and we're just getting started!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T04:14:31.000Z"
  },
  "company": {
    "name": "Airtable",
    "link": "https://www.linkedin.com/company/airtable"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 119100,
    "max_value": 259900,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Mountain View",
    "region": "CA",
    "postal_code": "94040",
    "street_address": null,
    "latitude": 37.39008,
    "longitude": -122.08139
  }
}