{
  "job": {
    "title": "Senior Java Developer",
    "industry": "",
    "description": "Position Overview:\nSenior Java developer with demonstrable, hands-on, independent, development experience with below listed technology stack.\n·       Overall, 8 plus years of IT experience in Development and Operations support of Enterprise IT Application Systems, of which 5 Plus years in the capacity as Senior Software Engineer.\n·       6 Plus years working in Supply Chain domain Supporting Order Management and Transportation business process, with end to end knowledge of Order life cycle in Wholesale or Retail industries.\n·       Experience in independently developing J2EE framework-based applications/services and integrating the same with the latest customer facing technologies including Mobile handheld solutions, involving application of latest authentication protocols such as OAUTH2.\n·       This Java Developer demonstrated experience working independently, with minimal supervision to develop, test, and implement Java services (java 8), RDBMS based 3tier applications, using industry standard software development practices, techniques, tools, and frameworks.\n·       This java developer will demonstrate strong analytical acumen and will be required to participate in Analysis, Design, of complex business components in Java, deploying to Java EE Application Servers.\n·       This senior Java developer should have experience supporting operations, troubleshooting and leading the problem resolution tasks in a fast paced and time sensitive environment.\n·       Should have worked on at least 2 large scale business cross functional enterprise projects.\n·       Should possess strong written and verbal communication skills. Interact with stakeholders as needed.\n·       Demonstrates a positive attitude to get work done. Ready to step out of the box to try new approaches, expand knowledge and experience and keep abreast with the latest technologies and apply the learnings to solve current and emerging challenges.\nTechnology Stack experience relevant to the position:\n·       A Minimum 5+ years of hands-on development experience with the following technologies\n·       Java / J2EE (With 2+ years developing using Java 8 +)\n·       Hands on development experience with all Java Collections\n·       In-memory data structure including Eh-cache\n·       multi-Threading\n·       Spring Framework 4.3+ version / Spring Boot\n·       Hibernate / JPA\n·       Maven\n·       RDBMS - SQL / Oracle 12+\n·       Web services (Restful & SOAP)\n·       3-Tier Architectural frameworks\n·       WSO2 API Service manager (Integration & Administration)\n·       Message (IBM MQ ) based transaction communication (Both Publish & Subscribe)\n·       OAuth2 / Multi-Factor Authentication Security framework\n·       Data movement solutions involving file transfer, ETL and event based integrations.\n·       UNIX & Linux Operating System\n·       Shell Scripting\n·       Application Servers (Wildly 16, WebLogic & Tomcat)\n·       SVN (Source code repository)\n·       Desirable (Not Mandatory) to have at least 2 Plus years working with\no   Postgres -DB\no   Containerization - Dockers / Kubernetes\no   Node-JS\no   Cloud\no   Python\no   Micro Services\no   Elastic Search\nNagendra\nSr.Recruiter\nnagendra@extendime.com\n848-209-0775",
    "employment_type": "CONTRACTOR",
    "date_posted": "2021-10-05T17:31:21.000Z"
  },
  "company": {
    "name": "Extendime Software Solutions Inc",
    "link": "https://www.linkedin.com/company/extendime-software-solutions-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}