{
  "job": {
    "title": "Android Software Engineer - Mobile",
    "industry": "Information Technology and Services,Computer Software,Management Consulting",
    "description": "CapTech is a national IT management consulting firm that bridges the gap between business and technology. We partner with some of the world's most successful companies to design, develop, and manage technical and digital solutions that delight customers, drive insights, and meet strategic objectives.\nAt CapTech, you’ll experience a flat organizational structure based upon a culture of mutual respect. Here, your career path isn’t set in stone, and you have unlimited potential for growth and the resources to help you achieve your career goals. If you are creative, technically insightful, driven–and have a passion for the work that we do, then you might be a future CapTecher.\nFor over five years, we have been in the Top 10 of Consulting Magazine’s Best Firms to Work For, including #2 for IT Firms and #5 for Work/Life Balance. We are also recognized by Vault.com’s Top 50 Consulting Firms and have been on the Inc. 5000 list of fastest growing companies for over 10 years.\nAndroid Software Engineers at CapTech are part of an intelligent, highly motivated community who strive to continuously learn the latest tools and architectures to deliver innovative solutions for our clients. They are involved in the design, development and delivery of innovative mobile solutions in partnership with a variety of Fortune 500 clients. CapTech’s software engineers enjoy a highly collaborative environment and have many opportunities to learn from and share knowledge with other CapTech consultants, architects, and our clients.\nSpecific qualifications for the Android Software Engineer position include:\nAdditional Information\nWe provide challenging and impactful opportunities in our client work and internal teams, while keeping individual interests in mind. We want everyone at CapTech to be able to envision a lifelong career here, which is why we offer a variety of career paths based on your skills and passions. As a CapTecher, you will experience exciting and rewarding roles that help you grow and make a difference, while having fun along the way.\nAt CapTech we offer a competitive and comprehensive benefits package including, but not limited to:\nCapTech is an equal opportunity employer committed to fostering a culture of equality, inclusion and fairness — each foundational to our core values. We strive to create a diverse environment where each employee is encouraged to bring their unique ideas, backgrounds and experiences to the workplace. For more information about our diversity, Inclusion and belonging efforts, click HERE.\nAt this time, CapTech cannot transfer nor sponsor a work visa for this position. Applicants must be authorized to work directly for any employer in the United States without visa sponsorship.\n#LI- JB1",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:30:02.000Z"
  },
  "company": {
    "name": "CapTech Consulting",
    "link": "https://www.linkedin.com/company/captechlistens"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 56000,
    "max_value": 103000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Reston",
    "region": "VA",
    "postal_code": "22096",
    "street_address": null,
    "latitude": 38.960186,
    "longitude": -77.3545
  }
}