{
  "job": {
    "title": "Software Engineer, New Grad (2022)",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web , Figma helps entire product teams brainstorm , create, test, and ship better designs, together. From great products to long-lasting companies, we believe that nothing great is made alone—come make with us!\nMore than anything, we seek engineers with strong coding fundamentals and a track record of high quality engineering. We work in a highly collaborative environment, where most projects are owned by small groups of 2-3 people. We strive to foster a positive, inclusive culture - you can read more about our engineering values on our blog .\nWe will work to ensure individuals with disabilities are provided reasonable accommodation to participate in the interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please let your recruiter know if you require accommodation.\nDylan Field and Evan Wallace co-founded Figma in 2012 with the vision of building tools for designers in the browser. Their goal was to create the first design tool that combined the accessibility of the Web with the functionality of a native app. Today Figma is a platform with tools and spaces to support the entire product development process—idea to design to build—and has simplified collaboration for companies like Microsoft, Uber, and The New York Times to name a few.\nAt Figma, we celebrate and support our differences. We know employing a team rich in diverse backgrounds, experiences, and opinions allows our employees, products, and community to flourish. Figma is an equal opportunity workplace—we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national orientation, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-16T15:40:19.000Z"
  },
  "company": {
    "name": "Figma",
    "link": "https://www.linkedin.com/company/figma"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}