{
  "job": {
    "title": "Principal Software Engineer ( TS/SCI)",
    "industry": "Consumer Goods",
    "description": "If you are a Principal Software Engineer ( TS/SCI) with experience, please read on!\nWe are a leading national company that focuses on helping segments off the government improve their software and build great new products. This role will be focused on the geo-spatial world!\nTop Reasons to Work with Us\nChance to work on very interesting projects using the latest in technology!\nWe offer a strong relocation package\nGreat compensation package!\nChance to make an impact on the world.\nGreat leadership team and culture!\nWhat You Will Be Doing\nYou will be developing and implementing software applications for the geo-spatial world\nYou will be writing test scripts, test driven development in an agile environment\nYou will be creating, testing and maintaining software products to ensure strong functionality.\nYou will be working with and training junior developers.\nWhat You Need for this Position\nMust have a TS/SCI clearance!\nExperience with Java/python\nExperience with Javascript\nMicro-service architecture and design\nSo, if you are a Principal Software Engineer ( TS/SCI) with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nKeith.Ellis@CyberCoders.com\nKeith Ellis - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:22:49.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "St Louis",
    "region": "MO",
    "postal_code": "63121",
    "street_address": null,
    "latitude": 38.635357,
    "longitude": -90.20099
  }
}