{
  "job": {
    "title": "Software Development Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nOur team is looking for a product-minded frontend developer to help us deliver more meaningful experiences to our users.\nAs a part of the Behance team, your work will impact the creative world daily. You'll play a role in improving the lives of millions of creatives and the industry through the Behance Network; a platform for creative professionals. Our team of designers, developers, and community managers work hand-in-hand to create revolutionary products that connect and empower the creative world.\nOur Frontend Developers are tasked with delivering beautiful and highly usable interactions in our products. In this role, you’ll work directly with designers, community managers and other developers to implement new features and improvements on Behance. We focus on using the best approach- and modern tools - to create maintainable, modular code. Being primarily focused on building features that encourage more product adoption, you’ll be involved in gaining insights about how our products are actually being used and be part of investigating new ways to deliver more to our users.\nDo you get excited about solving complex problems to create simple, functional UIs? Are you a curious developer who loves to experiment and use data to drive decisions? From working closely with designers to collaboratively writing code, this role is all about finding creative solutions to real world problems!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T22:01:19.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 91500,
    "max_value": 224000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}