{
  "job": {
    "title": "Software Application Production/DevOps Engineer",
    "industry": "Pharmaceuticals",
    "description": "If you are an experienced Software/IT professional with proven success owning the application production environment including changes, security and compliance, and incident response, this is the role for you.\nWe are a tech-enabled pharmaceutical services company. With nearly 10 years in the business, we provide direct, hands-on support to pharmaceutical manufacturers along with custom services to increase patient access and facilitate the economic and operational efficiencies in the prescription fulfillment process.\nWe are looking for an experienced Software/IT Engineer to join our team.\nWhat You Will Be Doing\nYou will own the application production environment including all changes, security and compliance, and incident response.\nWhat You Need for this Position\nBONUS\nWhat's In It for You\nCompetitive Salary and Benefits\nSo, if you are an experienced Developer/IT Engineer with relevant experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nTim.Sugrue@CyberCoders.com\nTim Sugrue - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:02:05.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Greenville",
    "region": "SC",
    "postal_code": "29601",
    "street_address": null,
    "latitude": 34.850746,
    "longitude": -82.398964
  }
}