{
  "job": {
    "title": "Software Quality Engineer II",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSoftware Quality Engineer II\nWho is Mastercard?\nWe are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has the opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities.\nData & Services within Mastercard\nThe Data & Services team is a key differentiator for Mastercard, providing the cutting-edge services that help our customers grow. Focused on thinking big and scaling fast around the globe, this agile team is responsible for end-to-end solutions for a diverse global customer base. Centered on data-driven technologies and innovation, these services include predictive analytics, data visualization and business intelligence software.\nSoftware Quality Engineer II, Data & Services Technology Team\nAs a Software Quality Engineer on the D&S Technology team, you’ll hold a valued role within a rapidly growing team inside one of the world's most successful organizations, working closely with experienced and driven technologists to solve problems as a team. Mastercard's D&S next generation platform blends industry-leading analytics, advanced software architecture, and the latest web technologies to face these problems, analyzing terabytes of data in the process. Our software is required to effectively decipher analytically complex insights from these problems, on which businesses base multi-million dollar business decisions.\nAs a member of the Business Operations Engineering team, you will bring your creativity and detail-oriented mindset together to test key internal resources that drive value to our Delivery, Sales, Marketing, Engineering teams and beyond. We work with cutting-edge technologies, with our engineers determining the best one for each project. You are responsible for ensuring great products and should never settle for the status quo - you approach testing challenges with a fresh perspective and look for ways to accelerate or improve the testing tactics taken.\nSoftware Quality Engineers work side-by-side with Software Development Engineers on small, flexible teams. There are no rigid organizational structures, and each team uses processes that work the best for that team and their projects.\nEnjoy collaboratively solving complex technical challenges? Come solve them with us.\nAs a member of the Business Operations Engineering team, you will you will test functionality and tools that drive value across the organization.\nOwn quality of the entire development process, from ideation through release\nLead testing of large, complex, high-quality features with minimal oversight\nManage and coordinate large testing and release efforts with continuous delivery\nDevelop, maintain, and enhance automated testing processes\nInnovate and continually learn and work with new technologies\nInvest in personal growth and take on team responsibilities\nHave the opportunity to write code to help the team achieve their quality goals\nExperience as a QA engineer, Software Engineer in Test, Test Automation engineer, Developer or related occupation, leveraging software QA tools and processes.\nExperience testing web applications in an agile production environment\nFamiliar with object-oriented programming, microservice development, and databases\nComfortable with one or more programming languages/testing frameworks\nPassion for problem solving\nMotivation, creativity, self-direction, and desire to thrive on small project teams\nStrong written and verbal English communication skills\nExperience collaborating with diverse, cross-functional teams\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nEvery person working for, or on behalf of, Mastercard is responsible for information security.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:24:51.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}