{
  "job": {
    "title": "New Graduate - Software Engineer",
    "industry": "Internet",
    "description": "Whether it is celebrating your favorite team’s victory, dancing to your favorite DJ with thousands of new friends, or enjoying your favorite Broadway show, one thing is for certain:\n. That’s even more true today than it was before the pandemic.\nSeatGeek is a technology innovator on a mission to disrupt the $300 billion ticketing industry. We have the product, vision, and team to make life better for performers, venues, and fans, and build a generational consumer brand in the process. All we’re missing is you.\nSoftware is a team sport, and our team is ready for the big leagues. We all come from different professional and personal backgrounds, and we take pride in the fact that our diversity makes us stronger, more resilient, and better at empathizing with our users. We’ve all come here along different paths, but we are united by our commitment to our mission, but also to each other. You will have colleagues here who will become lifelong collaborators and friends.\nBy starting your career at SeatGeek, you will have many opportunities to develop deep knowledge and practical skills that will take you far. We are solving complex performance problems, building a many-sided marketplace, empowering a data-driven business and scaling our software to support our booming business. We pride ourselves on building performant, beautiful, inclusive interfaces that delight our users and enhance our brand. In parallel, we are constantly evaluating new technologies and improving our software stack to keep our technological edge. While working on these hard problems, you will receive mentorship from industry leading experts who’ve seen them before.\nWe build innovative features to a level of technical excellence that our competitors struggle to copy. We are able to accomplish this because we have a strong culture of individual ownership and responsibility. While working at SeatGeek, you will design cloud native software architecture, solve customer problems, define technology patterns, and run experiments that determine the future of our business for years to come.\nWe are hiring New College Graduates for the following roles. Experience in that role is preferred, but not required. We support you learning new technologies, as long as the aptitude and attitude are there.\nHi, we’re SeatGeek a.k.a. the managers of your greatest moments. The official ticketer of your favorite acts and the unofficial ticketer of nail-biters, show stealers, and strangers hugging other strangers.\nWe don’t take those responsibilities lightly. In fact, we’re weirdly obsessed with making ticketing great. Like the way you’re weirdly obsessed with your favorite acts. Kind of.\nWe believe that there is nothing cooler than giving a s%*t, and we promise to give a s%*t about you. By creating a ticketing process that is fast, seamless, human, and helpful, forgettable in the best ways.\nBecause a ticket, after all, is just the beginning of a life more lived.\nSeatGeek. Expect More.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-03T01:38:23.000Z"
  },
  "company": {
    "name": "SeatGeek",
    "link": "https://www.linkedin.com/company/seatgeek"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}