{
  "job": {
    "title": "100% REMOTE - Lead Data Science Engineer",
    "industry": "Computer Software",
    "description": "If you are a 100% REMOTE - Lead Data Science Engineer with experience, please read on!\n100% REMOTE - Lead Data Science Engineer\nWORK FROM HOME\n$180,000-$230,000\nPh.D, Data Science, Python, SQL, Tableau, R, Matlab, AI technology, imaging\nTop Reasons to Work with Us\nFounded by some of the same people behind companies like AngelList, Vengo & WeWork, we are an exciting and rapidly expanding Machine Vision/ AI tech company based in San Francisco but HIRE REMOTE. Our founders are nothing shy of extraordinary! Our CEO sold his first company to a 200+ person Robotics company that made $45M in their first year. Our CTO has a Ph.D. from MIT. The Chief Science Officer has his Ph.D. from MIT and sold his company to Twitter as one of their largest acquisitions to date. We are working on patent-pending video processing algorithms for use by builders to automate their photo capturing system.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a 100% REMOTE - Lead Data Science Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nParker.Graham@CyberCoders.com\nParker Graham - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:11:19.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}