{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Insurance,Financial Services",
    "description": "The Global Analytics team at Chubb is seeking a data scientist with 0-2 years of experience to join our fast-paced, high energy team responsible for delivering predictive models to our business partners in order to influence business metrics positively.\nThis position offers the opportunity to experience a wide variety of technology, tools and business problems as well as unique challenges in problem-solving. The focus is on applying a combination of industry standard practices and innovative ideas using data from multiple sources (structured and unstructured) and applying machine learning and statistical techniques to build models, evaluation of models and supporting implementation of models.\nAt Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin, ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law. Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliation against any individual who reports discrimination or harassment.\nBasking Ridge\nRisk Management and Analytics\nNo\nJul 30, 2021, 3:47:41 AM",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T01:27:03.000Z"
  },
  "company": {
    "name": "Chubb",
    "link": "https://ch.linkedin.com/company/chubb"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "no requirements",
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 65700,
    "max_value": 125000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Basking Ridge",
    "region": "NJ",
    "postal_code": "07920",
    "street_address": null,
    "latitude": 40.706573,
    "longitude": -74.549515
  }
}