{
  "job": {
    "title": "Software Engineer I, Core Product",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "At Vimeo, we love designing and engineering tools that combine power with ease of use. Our engineers work on professional-grade video tools for creators and have the opportunity to do way more than write code.\nWe’re a small team that cares about collaboration, encourages curiosity, celebrates technical excellence, and is driven by careful attention to detail and planning for the future. We believe diversity of perspective and experience are key to building great technology and believe that the best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.\nVimeo is the world’s leading all-in-one video software solution. Our platform enables any professional, team, and organization to unlock the power of video to create, collaborate and communicate. We proudly serve our growing community of over 200 million users — from creatives to entrepreneurs to the world’s largest companies.\nVimeo is headquartered in New York City with offices around the world. At Vimeo, we believe our impact is greatest when our workforce of passionate, dedicated people, represents our diverse and global community. We’re proud to be an equal opportunity employer where diversity, equity and inclusion is championed in how we build our products, develop our leaders, and strengthen our culture.\nLearn more at www.vimeo.com\nLearn more at www.vimeo.com/jobs",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-28T00:00:00.000Z"
  },
  "company": {
    "name": "Vimeo",
    "link": "https://www.linkedin.com/company/vimeo"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}