{
  "job": {
    "title": "Software Engineer III: Frontend",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Software Engineer III: Frontend\nLogicGate is a venture-backed, Chicago-based technology company that needs YOU to help us as we continue to disrupt the wide world of GRC (governance, risk, and compliance). At LogicGate, you’ll join a group of bright, welcoming people ready to learn, grow, and do the right thing for our customers.\nWhat you’d achieve:\nThe value you’d bring:\nThis job is eligible for remote work in all states with the exception of Colorado.\nHere are just a few things we’ve been up to recently:\nNot too familiar with GRC? That’s ok—a lot of us weren’t when we were in your shoes either. Here’s what you need to know:\nLogicGate is continuing to hire with all interviewing and on-boarding done virtually due to COVID-19. All new and existing LogicGate employees will continue to work from home until it’s safe to return to our offices. When our offices reopen, we will provide the choice to work from home or return to work in an office unless a job requirement makes it necessary for a particular role to be performed at a LogicGate office.\n#BI-Remote\nLogicGate is dedicated to creating a community of diverse professionals, as we believe this creates a strong sense of belonging which ultimately enables our business to succeed. We are passionate about creating safe, inclusive spaces for all those who come through our doors! We’re proud to be an equal employment opportunity employer who does not discriminate on the basis of race, gender, sexual orientation, gender identity, age, national origin, disability, religion, veteran or military status, or any other protected status.\nPowered by JazzHR\nybDZWwuDI2",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T07:12:32.000Z"
  },
  "company": {
    "name": "LogicGate",
    "link": "https://www.linkedin.com/company/logic-gate"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}