{
  "job": {
    "title": "Lead Data Scientist",
    "industry": "Biotechnology",
    "description": "Seeking a Lead Data Scientist to lead a team of Data Scientists building new machine learning models which will help users achieve their health goals.\nWhat You Will Be Doing\nCollaborate with product teams to deliver solutions that enhance the customer experience and improve the efficiency of user acquisition.\nFollow Agile methodology process to get tasks done.\nProvide guidance to Data Scientists and ensure proper use of standard methodologies\nWork with research and clinical teams to define the data requirements and the data collection protocols and ensure quality of the data being collected\nBuild and expand array of machine learning models using NLP, regression, classification, neural networks.\nResponsible for the performance of data science products with a keen understanding of the levers to provide increased value.\nDevelop advanced algorithms that solve problems of large dimensionality in a computationally efficient and statistically effective manner\nDrive R&D on new models and evaluate business opportunities.\nEstablish roadmap to improve the scalability of data pipelines and modeling infrastructure.\nWhat You Need for this Position\nMasters Degree in Data Science, Statistics or a related field. PhD desired.\n8+ years of experience in the field of data science or machine learning.\nProficient with code versioning tools such as Git.\nStrong technical background and experience working with scalable data systems (Spark).\nProficient with SQL and data mining experience with Matlab, Python, R, Scala or other Big Data tools.\nStrong understanding of machine learning algorithms and statistical methods.\nAgile methodology and working with Scrum Teams.\nLeveraging relational databases, manipulating data structures and analyzing complex data sets.\nHands-On building and optimizing data pipelines, developing data models and designing schemas.\nStrong analytic skills related to working with unstructured datasets.\nProficient with code versioning tools such as Git.\nExperience organizing and analyzing data collection from various sources.\nGood communication skills, both verbal and written, and the ability to interface effectively with engineering and manufacturing personnel.\nKnowledge of diabetes is a BIG PLUS.\nFor your hard work and dedication, earn a generous salary plus bonus and stock options along with a comprehensive benefits package including 401k and more...plus, join a organization who promotes within to build your career path.\nPossible relocation assistance for an ideal candidate.\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNyna.Goldberg@CyberCoders.com\nNyna Goldberg - Principal Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:31:26.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": "Lead"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Lake Forest",
    "region": "CA",
    "postal_code": "92609",
    "street_address": null,
    "latitude": 33.66746,
    "longitude": -117.6885
  }
}