{
  "job": {
    "title": "Software Engineer III",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "If you’re thinking ‘scale’, think bigger and don’t stop there. At Walmart Global Tech, we don’t just innovate, we enable transformations across stores and different channels for the Walmart experience. Take a regular day at Walmart and match that with 260 million customers a week, 11,695 stores, under 59 banners in 28 countries and e-commerce websites in 11 countries. That’s Walmart, Global Tech for you.\nWalmart employs approximately 2.3 million associates worldwide. We innovate to deliver a simple and seamless experience for our customers. Our tech talent solves the biggest and most complex problems. They drive digital transformation where data and analytics are enabling us to better serve our customers and create a digital relationship with them. As our customers evolve and adapt, we are taking it a few notches further here. We’re changing what customers can expect from the experience of shopping, from the physical stores, to mobile, social and even online; we’re not just ready for the future of shopping, we’re creating it.\nYou’ll sweep us off our feet if…\nYou have and can implement big ideas with a positive attitude. You want to be a part of the team to disrupt this industry and you have these main skills:\nNice to Have\nMinimum Qualifications...\nBachelor’s degree in Computer Science and 2 years’ experience in software engineering or related field OR 4 years’ experience in software engineering or related field. Preferred Qualifications...\nMasters: Computer Science Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:41:55.000Z"
  },
  "company": {
    "name": "Walmart",
    "link": "https://www.linkedin.com/company/walmart"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Bentonville",
    "region": "AR",
    "postal_code": "72716",
    "street_address": null,
    "latitude": 36.37187,
    "longitude": -94.20272
  }
}