{
  "job": {
    "title": "Senior Manager WWRACE Delivery Operations - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "VMware accelerates digital transformation through a software-defined approach to business and IT. The trusted platform provider of choice for more than 500,000 customers globally, VMware is the pioneer in virtualization and an innovator in cloud and business mobility. A proven leader, VMware allows customers to run, manage, connect and secure applications across clouds and devices in a common operating environment.\nThe Senior Manager, WWRACE Delivery Operations is responsible for running the global Delivery and Enablement Operations team. The WWRACE team delivers world-class sales and technical training to support our sales teams and partners in accelerating VMware’s growth. The Delivery and Enablement Operations team is essential to program delivery, working behind the scenes to schedule, host, and support execution. The ideal candidate is comfortable bringing structure to ambiguity, working on many programs at the same time, and excited about leading a global team.\nSales\nField Enablement\nBusiness Leadership\nFull Time\n2021-06-01\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:35:54.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Wichita",
    "region": "KS",
    "postal_code": "67203",
    "street_address": null,
    "latitude": 37.686024,
    "longitude": -97.33557
  }
}