{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Management Consulting",
    "description": "The Software Engineers are responsible for, but are not limited to: designing, developing, and implementing software solutions in cutting edge software platforms in the Quote-To-Cash space. ATG Software Engineers are engaged in all phases of the software development lifecycle which include; gathering and analyzing user/business system requirements, responding to changing requirements and creating application system models. Software Engineers are challenged to come up with solutions to complex business problems while working in a fast-paced environment and collaborating with other skilled, talented, and motivated professionals.\nExperience in the following technologies are preferred (but not required): Salesforce CPQ, Salesforce Billing, Apttus CPQ, Apttus CLM, Gotransverse TRACT, Spring CM CLM, Conga CLM and other related solutions, Xactly SPM solutions, Aria billing platform, Salesforce Communities and Cloud Craze\nSalesforce Service Cloud, Sales Cloud, Marketing Cloud, Zuora, Oracle Big Machines, Calidus Cloud Solutions, Netsuite, Mulesoft, and other SaaS/Cloud Q2C and related solutions\nUI Development, Vue.js,\nEmployee Status : Contractor\nShift : Day Job\nTravel : No\nJob Posting : Aug 17 2021\nCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.\nApplicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview.\nCognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\nIf you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:18:18.000Z"
  },
  "company": {
    "name": "Cognizant",
    "link": "https://www.linkedin.com/company/cognizant"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Overland Park",
    "region": "KS",
    "postal_code": "66214",
    "street_address": null,
    "latitude": 38.97482,
    "longitude": -94.6836
  }
}