{
  "job": {
    "title": "Data Engineer",
    "industry": "Investment Management",
    "description": "Dorilton is a private investment firm that invests in businesses across a range of industry sectors, working in partnership with management to build value over the long-term. By providing funding and expertise to drive growth, we help our companies, and our people achieve their full potential.\nWe are seeking a highly motivated and goal-oriented Data Engineer to join our rapidly expanding organization. The Data Engineer will be part of a growing Advanced Analytics team and will develop, deploy, and maintain scalable software solutions and services. The ideal candidate is a Data Engineer capable to leverage cutting edge technologies to optimize long-term digital solutions. As a Data Engineer, you will contribute to the design and implementation of data pipelines for the Dorilton platform. In this role, you will partner closely with the Advanced Analytics team members to help collect, stream, transform, and effectively manage data for integration into critical reporting, data visualizations, and data products. You will take their findings and create robust, reusable code that is scalable and addresses the needs of our growing business. The candidate will be focused, driven, and have strong communication skills. They should be able to think critically, have excellent time management skills, and have a demonstrated ability to execute in fast paced environments.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:23:56.000Z"
  },
  "company": {
    "name": "Dorilton",
    "link": "https://www.linkedin.com/company/dorilton"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}