{
  "job": {
    "title": "Data Engineer - Healthtech Startup",
    "industry": "Computer Software,Internet,Hospital &amp; Health Care",
    "description": "CancerIQ’s technology makes it possible for providers to recognize and empower patients who have increased risk for cancer at scale. Offering patients cancer risk assessment, genetic counseling and genetic testing is the right thing to do, but most hospitals (cancer centers, breast centers and women’s health providers) simply don’t have the time or the resources to do it. CancerIQ’s unique technology enables providers to screen, assess and manage entire patient populations based on individual genetic risks. That means they can prevent deadly, early-onset cancers.\nProviders who partner with CancerIQ can also improve quality of care and staff satisfaction, increase revenues and efficiencies, address social determinants of health, meet guidelines/requirements, and enhance customer loyalty.\nCancerIQ is seeking a Data Engineer with a mission to create a data pipeline that allows our data to be flexible and reliable in efficient ways to gain clinical insights in the cancer prevention and genetics space. The Data Engineer position will have the unique opportunity of working independently to understand and monitor data performance and identify areas of improvement both internally and for clients.\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status\nNote At CancerIQ, the safety and wellness of our employees is our top priority. To provide our employees with the support they may need to maintain their personal health and wellness, our office is open and available for those employees who are interested in using it. Our long-term goal is for CancerIQ employees to return to our Chicago office, however working remotely will be an option until everyone is comfortable, and it is 100% safe for all to return.\nCancerIQ requires you are authorized to work in the U.S. as a precondition of employment. We are unable to grant sponsorships at this time.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-16T01:02:42.000Z"
  },
  "company": {
    "name": "Cancer IQ",
    "link": "https://www.linkedin.com/company/cancer-iq-inc-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}