{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "At Identity Automation, we understand the unique challenges that educators, faculty, students, and even parents face. That’s why we created RapidIdentity, an identity and access management (IAM) platform, used by hundreds of school districts, colleges, and universities to provide secure and agile online access that digitally connects students to their learning environment. By putting the unique identities of both educators and students at the heart of the learning process, RapidIdentity helps academic institutions unlock their potential and provide a safer, more personalized learning experience.\nOur Site Reliability Engineers (SREs) empower our users with a rich feature set, high availability, and stellar performance level to pursue their missions. As we expand our customer deployments, we are currently seeking an experienced SRE to deliver insights from massive scale data in real time. Specifically, we are searching for someone who brings fresh ideas, demonstrates a unique and informed viewpoint, and enjoys collaborating with a cross-functional team to develop real-world solutions and positive user experiences at every interaction.\nPowered by JazzHR\nkWgHu04H6d",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T07:12:12.000Z"
  },
  "company": {
    "name": "Identity Automation",
    "link": "https://www.linkedin.com/company/identity-automation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Houston",
    "region": "TX",
    "postal_code": "77208",
    "street_address": null,
    "latitude": 29.760803,
    "longitude": -95.36951
  }
}