{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Financial Services",
    "description": "Long-term contract opportunity in Irving, TX for an Innovation Engineer / Machine Learning Engineer. Other potential locations include Tampa FL, Washington, DC, NYC, Delaware, or Buffalo NY.  Will create, experiment, and put in place rapid prototypes where solution hypothesis generation and testing is done with tangible throwaway proof-of-concepts, ranging from data models to workflows to integrations of multiple vendor solutions. Will be rapidly prototyping new products to test important customer features and demonstrate to key stakeholders. Will likely involve a lot of frontend-heavy work, and data manipulation techniques – even some ML where it’s needed. A lot of what we build will be prototypes and proof-of-concepts for internal validation and learning. Technical Skills: • Rapid prototyping experience • Comfort with ML concepts and tools, including Python • Comfort with data manipulation and data engineering • Basic backend development skills (PHP, Java) • Experience with API’s, REST and micro services • Experience with rational databases • Knowledge of code versioning• Comfort with systems mapping and communicating about process and data flows Additional requirements: • Technical degree • Basic frontend development skills (HTML, CSS, JavaScript, Angular, Flutter, React) a plus, but not required. • Experience with early stage new product development • Excellent communication skills • Ability to work with minimal supervision • Willing to collaborate with teams in diverse locations • Problem solving skills demonstrated by past positions • Ability to work under tight deadlines and handle multiple tasks in changing environment. • Experience working at fintech startups or corporate innovation teams is a plus   About our client   Our client stands as one of the world’s most global banks and a trusted brand with over 200 years of continuously evolving financial services. Its teams provide unique insights to more than 200 million clients and enable progress all over the world.   While growing your career, you will work alongside some of the smartest minds in the industry who are excited to share their knowledge and to learn from you. From analysts to architects, developers to data scientists, our client’s employees operate as one team where each voice is heard, and each perspective is appreciated.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T14:14:30.000Z"
  },
  "company": {
    "name": "MATRIX Resources",
    "link": "https://www.linkedin.com/company/matrix-resources"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Dallas-Fort Worth Metroplex",
    "region": null,
    "postal_code": "75049",
    "street_address": null,
    "latitude": 32.7513,
    "longitude": -97.08263
  }
}