{
  "job": {
    "title": "Software Engineer - JavaScript (Angular, React, Node.js)",
    "industry": "Computer Software",
    "description": "If you are a Software Engineer with strong JavaScript (Angular, React, NodeJS) experience, please read on!\nSoftware Engineer - JavaScript (Angular, React, Node.js)\nNew York City, NY - we're on East 42nd Street just 2 blocks from Grand Central Terminal!\n$100K - $140K base salary Depending on Experience\nThe problems we are solving are challenging and interesting and our solutions have an immediate impact on students and staff at urban schools in NYC. We are looking for an engineer excited about public service and the prospect of joining a fun and growing team in an open, collaborative, and diverse environment.\nTop Reasons to Work with Us\nWhat You Will Be Doing\nOur new team member will help build, test and maintain our school management platform built on Angular, Node.js, and MongoDB, supplemented by RXJS, Typescript, GraphQL, PostgreSQL, and other technologies.\n-Candidates must be willing to work in Manhattan when offices reopen-\nWhat You Need for this Position\nBachelor's Degree with at least 2+ years (4+ years preferred) of work experience in a production software engineering environment.\nSo, if you are a Software Engineer looking to join a great team, apply today! or send an updated copy of your resume to\nfor immediate consideration!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nMike.Vandenbergh@CyberCoders.com\nMike Vandenbergh - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:16:11.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 69100,
    "max_value": 127000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}