{
  "job": {
    "title": "Data Analyst",
    "industry": "Financial Services",
    "description": "Position:  Data Analyst Location:  Nashville, TN THE POSITION IS REMOTE HOWEVER YOU MUST LIVE WITHIN 80 MILE RADIUS OF NASHVILLE, TN FOR CONSIDERATION. You must be authorized to work in the United States. Sponsorship is not available for this opportunity. About Us FIA Tech is a dynamic and growing Software-as-a-Service technology company which supports over 8,000 global finance and trading firms. Our customers depend on our solutions which connect the global futures and derivatives industry for trade processing and regulatory compliance needs. Position Description:  This role is considered an entry-Level Data Analyst within our Databank team located in Nashville, TN. The main job responsibility is day-to-day processing and quality assurance of our reference data. Responsibilities: · Monitor global derivative exchanges and financial regulatory authority sites for current and upcoming events affecting Databank products and review the same sites for collection and verification of relevant data such as position limits, fees, and additional reference data as required. · Prepare detailed analysis needed for upcoming changes to Databank’s reference data. · Track and help manage team’s daily workflow. Identify and communicate high priority items to onshore team, and assure all data is validated and quality checked for time-sensitive tasks. · Research and respond to client inquiries received via email, Zendesk, and phone. · Create and send out daily alerts detailing changes/updates with fees and position limits. · Review and become familiar with published exchange rules and regulatory documentation to provide guidance to clients. · Assist in maintenance and clean up of current reference data utilized by our clients. Qualifications/ Preferred Experience: · 1+ years of experience in Financial Services and/or Banking Operations. · Experience with Microsoft Excel and strong analytical/numerical skills. · Experience in a coding language (Python, SQL, C++, etc.). · Familiar with business process improvement methodologies. Education/Certifications: Bachelor’s Degree in Business / Finance or other related fields.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:12:35.000Z"
  },
  "company": {
    "name": "FIA Tech",
    "link": "https://www.linkedin.com/company/fia-tech"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Nashville Metropolitan Area",
    "region": null,
    "postal_code": "37201",
    "street_address": null,
    "latitude": 36.172813,
    "longitude": -86.78488
  }
}