{
  "job": {
    "title": "Remote Unity Software Engineer - Unity/C#, 3D engine, Java",
    "industry": "Computer Software",
    "description": "If you are a Unity Software Engineer with experience, please read on!\n---100% Remote | Full-Time/Permanent---\nWe are an advanced talent development and workforce analytics software company that gives leaders deep insight to manage talent strategically, unlock human potential, and predict the likelihood of organizational/individual success.\nThis Software Engineer will assist us with research, design and development of software that is used in simulation environments on multiple devices including laptops, tablets, phones and VR headsets. You will be responsible for building simulations in game-like environments using characters and virtual environments.\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nSo, if you are a Unity Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nJames.Shramek@CyberCoders.com\nJames Shramek - Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:28:57.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Asheville",
    "region": "NC",
    "postal_code": "28805",
    "street_address": null,
    "latitude": 35.595913,
    "longitude": -82.55004
  }
}