{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "The Machine Learning and Personalization (MLP) team is responsible for building a thoroughly thought out architecture for data ingestion, feature engineering, model building, and productionalization. You will be expected to work on all parts of the machine learning pipeline and data lake infrastructure. We currently have a wide array of ML problems including computer vision (including generative algorithms), natural language processing, anomaly/fraud detection, recommendations, and personalization. As the newest team at StockX we have a large amount of autonomy and freedom to build a top notch machine learning system that will allow us to test hypotheses and iterate on models with agility. Come be a part of the next stage for StockX as we take our first steps into the world of machine learning and artificial intelligence.\nOur global platform offers unprecedented access to current culture while our data-driven, bid-ask model provides buyers with the real-time visibility to know they’re getting a fair price. And, unlike other ecommerce sites, StockX hand-checks every purchase (20,000+ daily trades) at one of our regional authentication centers.\nStockX’s special formula has rocketed the company to a multibillion dollar valuation, with 10M+ lifetime trades on the platform\nmore than half of those coming in the last year. And we’re just getting started.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-02T19:15:19.000Z"
  },
  "company": {
    "name": "StockX",
    "link": "https://www.linkedin.com/company/stockx"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Detroit",
    "region": "MI",
    "postal_code": "48242",
    "street_address": null,
    "latitude": 42.33294,
    "longitude": -83.04784
  }
}