{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Electrical/Electronic Manufacturing,Aviation &amp; Aerospace,Mechanical or Industrial Engineering",
    "description": "We are a diverse team of collaborators, doers, and problem-solvers who are relentlessly committed to a culture of safety. This position will directly impact the history of space exploration and will require your commitment and detailed attention towards safe and repeatable space flight. Join us in lowering the cost of access to space and enabling Blue Origin’s vision of millions of people living and working in space to benefit Earth.\nAs part of a small, passionate and growing team of experts, you will provide the data necessary to design, build and launch rockets faster, cheaper and with continually higher quality. We accomplish this by building state-of-the art software, and analyzing data to uncover patterns for quick decision making. We design systems that track millions of physical parts and complex manufacturing activities in remote locations. We build systems that process massive amounts of data and engineering tools that enable rapid design and iteration. We are seeking team members of all backgrounds who are passionate about space and who have a strong desire to serve on a team that is the backbone of the company. This position will directly impact the history of space exploration and will require your dedicated commitment and detailed attention towards safe and repeatable spaceflight.\nAs a Site Reliability Engineer, you will work on rewarding problems and interesting technologies. You will bring a software engineering approach to ensuring our systems are operational and scalable. You will implement the infrastructure that allows for rapid development and iteration of software throughout the company, including distributed systems and embedded software on-board our rockets and space vehicles. You will make decisions and implement systems that affect the productivity of thousands of rocket scientists and engineers throughout the company.\nWhat makes our SRE’s successful?\nTo conform to U.S. Government commercial space technology export regulations, including the International Traffic in Arms Regulations (ITAR), 8 U.S.C.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-30T00:28:47.000Z"
  },
  "company": {
    "name": "BLUE ORIGIN",
    "link": "https://www.linkedin.com/company/blue-origin"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Kent",
    "region": "WA",
    "postal_code": "98032",
    "street_address": null,
    "latitude": 47.38085,
    "longitude": -122.23742
  }
}