{
  "job": {
    "title": "Full-Stack Software Engineer (Remote)",
    "industry": "Information Technology and Services",
    "description": "Our goal is to transform healthcare.\nWe improve the health of individuals and communities through the use of digital technology. Inception Health brings together the best aspects of innovation accelerators, an “outside-in” mindset, and resources to rapidly test and scale digital health solutions.\nWe work hard to define the problem, and we use design thinking and human-centered design to understand the issues from all perspectives.\nInception serves as a Catalyst, an Incubator, a Designer/Developer, and an Operator of solutions.\nJoin the first-of-its-kind digital engineering group at Inception Health. You will be working delivering greenfield products as well as shaping our engineering culture. This is a unique opportunity if you are excited to transform healthcare and shape the future of care.\nAt Inception, we aim to build a thriving engineering team focused on delivering a data-driven and experience-focused digital services to our members, community, and providers.\nThat means we aspire to bring a full-stack engineering culture as our philosophy to grow our engineering team and build a cross-functional resiliency of our members to dive in and help engineer experience across the technology stack layers.\nWe truly believe that this is an opportunity for candidates to bring their unique value to healthcare to make change. At Inception Health, you can innovate and build sophisticated solutions that enrich thousands of lives.\nYou’re an outstanding full-stack engineer with a knowledge in the following areas:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:47:26.000Z"
  },
  "company": {
    "name": "Newance ",
    "link": "https://www.linkedin.com/company/newanceco"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Florida",
    "region": "United States",
    "postal_code": "33805",
    "street_address": null,
    "latitude": 28.595512,
    "longitude": -82.48734
  }
}