{
  "job": {
    "title": "Site Reliability Engineer - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Do you like the challenge of crafting solutions for meaningful problems, eliminate toil by creating automation? We're looking for people who have a passion for technology, have intellectual curiosity, strong business ethics and great interpersonal skills. VMware is actively revolutionizing the way it delivers software solutions, and we need your help!\nWe are world-class, highly technical & dynamic team of engineers that delivers wide portfolio of VMware's internal services, multiple hyper-converged, cloud environments and humongous, heterogeneous infrastructure. The SRE's (Site Reliability Engineers) ensure that our services meet the needs of our customers with the desired levels of reliability, performance and availability by developing continuous improvements, tools and automations. We are hiring additional SRE's to our global and distributed ( work from anywhere) Engineering Services team\nEngineering and Technology\nSite Reliability\nManager and Professional\nFull Time\n2021-06-03\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-21T00:01:17.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Miami",
    "region": "FL",
    "postal_code": "33299",
    "street_address": null,
    "latitude": 25.775084,
    "longitude": -80.1947
  }
}