{
  "job": {
    "title": "Senior Software Engineer : Backend",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "At Urbint, our mission is to make communities more resilient. We do this by pairing external data with artificial intelligence to identify areas of high risk and prevent catastrophic loss for utilities and infrastructure operators across the country. We are a team of close-knit engineers, entrepreneurs, and data geeks who obsess over problem-solving, new technologies, and making a positive impact in our communities.\nWe build software which assists utilities and infrastructure operators in working safely and efficiently. These software solutions combine user-friendly interfaces with large amounts of external data and machine learning models to drive the best possible decisions, while maintaining high security and data privacy standards.\nOur Application Team partners closely with product managers, user interface designers, and our other engineering teams to develop performant, easy to use full stack web applications which drive the workflows and decisions of our customers.\nWe encourage people from underrepresented groups to apply.\nWe're an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:36:26.000Z"
  },
  "company": {
    "name": "Urbint",
    "link": "https://www.linkedin.com/company/urbint"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 71200,
    "max_value": 127000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}