{
  "job": {
    "title": "Linux Engineering - open source, remote",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "This is a fast-paced engineering role in Linux-based software-defined infrastructure and applications, covering all layers of the stack, including bare metal, virtualization (KVM) and containerization (LXC/LXD), storage (Ceph and Linux filesystems), networking (OVS, OVN and Core networking), up to OpenStack and Kubernetes, and the open source applications running on top of them.\nThis role is an opportunity for a technologist with a passion for Linux and open source to build a career with Canonical and drive success for our customers, community and the company. If you have an affinity for open source development, great communication skills, and a passion for troubleshooting and fixing issues in technology used by millions across the world, then you will enjoy working with some of the best people in the industry at Canonical.\nThis role deals with critical issues in the open source stack that require software engineering for upstream fixes. Our engineers have to be able to work productively at any level of the stack above the kernel, in a wide range of languages, to understand and address the software issues at hand. Our group is critical to the success of our enterprise customers, partners and Ubuntu itself.\nYou will help with troubleshooting and driving issues to resolution with workarounds, guidance, and fixes to be released upstream and in Ubuntu.\nAs a Linux Engineer you will:\nThe successful Linux Engineer will have:\nWhat you'll do\nWho you are\nCanonical is a growing multi-national software company that works with the open-source community to deliver Ubuntu -- the world's leading cloud operating system. Our services help businesses worldwide to reduce costs, improve efficiency and enhance security with Ubuntu.\nWe offer:\n#stack",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:07:06.000Z"
  },
  "company": {
    "name": "Canonical",
    "link": "https://uk.linkedin.com/company/canonical"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "California",
    "region": "PA",
    "postal_code": "15419",
    "street_address": null,
    "latitude": 40.067097,
    "longitude": -79.89491
  }
}