{
  "job": {
    "title": "Principal Software Engineer - Sensors / Government / Aerospace",
    "industry": "Computer Software",
    "description": "We are a rapidly growing company that provides services to the aerospace and defense industry related to sensors & electro-optics! We've been in business for over 15 years, and as we grow our team, we are looking for passionate people who want to build long-term careers with us!\nWhat's In It for You\nWhat You Need for this Position\nWhat You Will Be Doing\nSo, if you are a Principal Software Engineer with the experience above, please apply today or email me directly at edwin.ocampo@cybercoders.com!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nEdwin.Ocampo@CyberCoders.com\nEdwin Ocampo - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:39:50.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Principal"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Tucson",
    "region": "AZ",
    "postal_code": "85708",
    "street_address": null,
    "latitude": 32.221878,
    "longitude": -110.97122
  }
}