{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "Position Summary... What You'll Do... Senior Software Engineer Are you passionate about developing cutting-edge technical solutions to enhance the consumer-facing experience? As a member of our Engineering organization, you’ll be viewed as a subject matter expert who is capable of taking our competencies to the next level. The work you do will help us to define a best-in-class user experience while positioning Walmart as a cutting-edge company, one that puts innovation at the forefront. The Senior Software Engineer position is one that calls for a technical expertise which puts the end-user experience at the center. You’ll apply your coding capabilities and distributed systems competencies to the improvement of existing products and the development of new software solutions at an enterprise-scale. You’ll sweep us off our feet if…. You’re a self-starter who balances technical thinking with customer-centered solutions.  You’re passionate about leveraging today’s technologies to create best-in-class user experiences.  You are process-driven and have an understanding of today’s infrastructure and able to operate with efficiency.  You’ll make an impact by… Developing software solutions that impact large-scale operations - Demonstrate a mastery of enterprise level based applications while optimizing today’s coding methodologies to create efficient, consumer-centric solutions.  Collaborating with key product leads and fellow engineers to achieve results – Position yourself as a cross-functional partner, one who understands intra-departmental and enterprise objectives as well as technological constraints and capabilities.  Balancing consumer needs with business outcomes – Prioritize efficiency and operational effectiveness while performing with agility and an understanding of today’s consumer.  What you’ll do… Participates in medium- to large-scale projects by reviewing project requirements; translating requirements into technical solutions; gathering requested information (for example, design documents, product requirements, wire frames); writing and developing code; conducting unit testing; communicating status and issues to team members and stakeholders; collaborating with project team and cross functional teams; troubleshooting open issues and bug-fixes; ensuring on-time delivery and hand-offs; interacting with project manager to provide input on project plan; and providing leadership to the project team. Leads the work of other small groups of four to six engineers, including offshore associates, for assigned Engineering projects by proving pertinent documents, direction, and examples; identifying short and long term solutions and timeline; reviewing and providing feedback for proposed solutions; and performing design and code reviews of changes. Troubleshoots business and production issues by gathering information (for example, issue, impact, criticality, possible root cause); engaging support teams to assist in the resolution of issues; formulating an action plan; performing actions as designated in the plan; interpreting the results to determine further action; performs root cause analysis to prevent future occurrence of issues; and completing online documentation. What you’ll bring… Specialization in one of the following: Front end positions: Javascript, HTML5, CSS, React, AngularJS, Vue Full stack positions: Java, Javascript, Python, NodeJS Backend positions: Java, Spring, Springboot, Hibernate, Rest/Soap Mobile positions: Kotlin, Swift, Javascript, React Native Experience with modern unit testing frameworks (e.g., Mocha, Chai) Experiences with building microservices Well versed in both private and public cloud technologies Deep understanding of architecture and data-driven development Ability to work with designers to develop dynamic user experiences A strong sense of ownership Experience building or maintaining a production application An ability to balance a sense of urgency with shipping high quality and pragmatic solutions Experience working with a large codebase on a cross functional team Interest or experience in building large scalable systems About Global Tech Imagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That’s what we do at Walmart Global Tech. We’re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations.  Being human-led is our true disruption. We’re virtual Working virtually this year has helped us make quicker decisions, remove location barriers across our global team, be more flexible in our personal lives and spend less time commuting. Today, we are reimagining the tech workplace of the future by making a permanent transition to virtual work for most of our team. Of course, being together in person is an important part of our culture and shared success. We’ll collaborate in person at a regular cadence and with purpose. Walmart, Inc. is an Equal Opportunity Employer – By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing diversity- unique styles, experiences, identities, ideas and opinions – while being inclusive of all people. Minimum Qualifications... Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.  Bachelor’s degree in Computer Science and 3 years’ experience in software engineering or related field OR 5 years’ experience in software Engineering Or Related Field. Preferred Qualifications... Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.  Master’s degree in Computer Science or related field and 2 years' experience in software engineering or related field Primary Location...603 MUNGER AVE STE 400, DALLAS, TX 75202, United States of America",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:35:36.000Z"
  },
  "company": {
    "name": "Walmart",
    "link": "https://www.linkedin.com/company/walmart"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 82300,
    "max_value": 119000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}