{
  "job": {
    "title": "Associate Software Engineer",
    "industry": "Computer Software",
    "description": "LogicMonitor is the leading SaaS-based performance monitoring platform for enterprise IT.\nWe love going to work and think you should too.\n. These are our core values. So it's no surprise that we work hard and genuinely have fun working with each other to achieve great things together.\nWe are looking for you to bring your expertise, drive, and passion as we expand our global presence and achieve record-breaking success.\nLogicMonitor is an equal opportunity employer. We’re committed to creating an inclusive environment for all our employees, where different backgrounds and perspectives are valued and encouraged - regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.\n.\nWe operate with integrity, esteem diversity and treat each other fairly and with respect.\nWe hear time and time again that our awesome people are a huge part of why LMers chose LogicMonitor, love their teams, and choose to stay.\nTo learn more about life at LogicMonitor, check out our Careers Page .\nThe Associate Backend Developer on the Engineering team is responsible for the implementation, design, architecture and quality control of business integrations/general development within the customer-facing product application and internal tools used by development technical operations. This includes troubleshooting bugs and implementing new features as required in existing backend applications; even building new components as needed. A successful Associate Backend Developer will produce all required functionality in a timely manner and will communicate and work with colleagues to solve problems and improve the systems they work with.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T22:32:28.000Z"
  },
  "company": {
    "name": "LogicMonitor",
    "link": "https://www.linkedin.com/company/logicmonitor"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}