{
  "job": {
    "title": "Software Engineer I",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "The engineering team at Root strives to be one of the most transformative engineering teams ever. We’re changing the way an industry works by leveraging technology and data to build the best products possible. Even with our significant growth, we operate in small teams that are given ownership over projects and results. We’ve found that the people closest to the problems are the best at solving them.\nRuby / Rails backend, RSpec for testing\nJavascript / React Native frontend, Mocha for testing\nSmall amounts of native iOS and Android\nDeployment to AWS ECS using containers\nBuildkite for CI\nWe’re scaling rapidly, and we recently launched a $6B IPO:\nhttps://www.nasdaq.com/articles/root-insurance-ipo-poised-to-disrupt-the-insurance-market-2020-10-30\nOur team excels at delivering software to solve the problems in front of us at Root: presently, a suite of world-class mobile, web, and server-based products obsessed with the customer experience. We’ve shaped our team and process around this; we know that constant iteration and experimentation produce the best results.\nFor more information on engineering at Root see root.engineering\nWe divide the areas of responsibility for engineers into three major areas:\nThe skills and knowledge that make up an engineer’s basic problem-solving toolbox.\nThe ability to plan and execute assigned work beyond basic technical solutions.\nThe ability to work effectively with other engineers and people in other functions.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-16T03:52:56.000Z"
  },
  "company": {
    "name": "Root Inc.",
    "link": "https://www.linkedin.com/company/rootinsurance"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Columbus",
    "region": "OH",
    "postal_code": "43272",
    "street_address": null,
    "latitude": 39.96276,
    "longitude": -82.99629
  }
}