{
  "job": {
    "title": "Software Engineer",
    "industry": "Electrical/Electronic Manufacturing,Construction,Staffing and Recruiting",
    "description": "Cennox wants all employees to feel valued, appreciated, and free to be who they are at work. Our employee lifecycle processes are designed to prevent discrimination against our people regardless of gender identity or expression, sexual orientation, religion, ethnicity, age, neurodiversity, disability status, citizenship, or any other aspect which makes them unique. Therefore, everyone is encouraged to apply for employment with Cennox.\nCennox is currently seeking a\nbased in\nto design, develop, and support software solutions that are the backbone to our company’s success. This\noffers insurance and 401k benefits, and the chance to become part of a rapidly growing company.\nOur ideal candidate is a creative, knowledge-hungry, software guru who possesses the ability to wear many hats and actively contribute in a team environment. Your primary focus will be to design, develop, and support software solutions that are the backbone of our company’s success. We seek someone with a passion for technology and the ability to share their passion with both IT and non-IT professionals alike.\nAs a Software Engineer, you will work closely with IT professionals in our office, along with co-workers in other offices around the world via phone and internet. The position will be fast-paced, at times challenging, but also very rewarding.\nCennox is a global company that provides comprehensive, centrally managed field services for our clients across a range of industries. Visit us at www.cennox.com to learn more.\nCennox provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nPowered by JazzHR\n4g6r5aarze",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T07:04:23.000Z"
  },
  "company": {
    "name": "Cennox",
    "link": "https://uk.linkedin.com/company/cennox"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Missoula",
    "region": "MT",
    "postal_code": "59812",
    "street_address": null,
    "latitude": 46.872128,
    "longitude": -113.99402
  }
}