{
  "job": {
    "title": "sr site reliability engineer",
    "industry": "Consumer Goods,Food &amp; Beverages,Retail",
    "description": "From the beginning, Starbucks set out to be a different kind of company. One that not only celebrated coffee and the rich tradition, but that also brought a feeling of connection.\nAt our core, we believe technology is a key enabler for growth and is required for business success in the future. We believe Starbucks must advance its technology resources and think long term to innovate and deliver maximum value for our partners, customers and shareholders. We believe it takes collaboration and partnership to deliver results and we will work across the company to enable sustainable business capabilities- not just fulfill immediate needs.\nIf you’ve got what it takes to help transform one of the most iconic brands in the world into a lean, efficient and highly automated platform, we’d like to talk to you.\nAs a Starbucks Systems Engineer Senior, you will be responsible for availability, latency, performance, efficiency, security best-practices, change/configuration management, monitoring, emergency response, disaster recovery, capacity planning, and tooling/automation of our infrastructure and deployment workflows. You should have significant CI/CD experience and strong Azure system administration skills.\nPuts the Customer First: Has a relentless focus on the customer. Understands what the customer wants and how to best deliver the experience.\nWorks Well with Others: Listens and communicates well with others within and outside of Starbucks. Creates a team environment that is positive and productive.\nLeads Courageously: Takes personal responsibility to do the right thing and persists in times of challenge or uncertainty. Adapts quickly to change and makes timely, thoughtful decisions.\nDevelops Continuously: Continuously seek opportunities to improve self and others. Leads with trust, honesty, and commitment to hire, coach, and develop partners to achieve their potential.\nAchieves Results: Understands what drives overall business success and is accountable to prioritize and deliver quality results. Demonstrates knowledge of core products and processes to get results. Anticipates obstacles and takes action to prevent or minimize their impact.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-19T12:33:00.000Z"
  },
  "company": {
    "name": "Starbucks",
    "link": "https://www.linkedin.com/company/starbucks"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}