{
  "job": {
    "title": "Software Development Engineer Intern",
    "industry": "Financial Services,Information Technology and Services,Internet",
    "description": "We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nSoftware Development Engineer Intern\nWho is Mastercard?\nWe are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities.\nThe 10-week summer internship program provides emerging talent with hands-on experience in industry, enabling you to make a positive impact in a world beyond cash.\nDo you want to be part of a dynamic and agile team environment?\nAre you motivated by meaningful projects and work that touch a global business?\nAre you collaborative and driven by delivering measurable results?\nIf yes, then you’re invited to start something PRICELESS™.\nMastercard’s software engineering teams leverage Agile development principles, advanced development and design practices, and an obsession over security, reliability, and performance to deliver solutions that delight our customers. As a software development engineer intern, you’ll support development of advanced technologies and applications that are revolutionizing payments. Your summer experience will enhance your business skills and contribute to the company's goals and objectives.\nSpecific responsibilities will vary; your experience will include:\nScience or a related field with a graduation date of December 2022 or\nbeyond\nconcepts\nJavaScript, C#, Python, etc.\nDue to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together.\nEvery person working for, or on behalf of, Mastercard is responsible for information security.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-28T05:17:43.000Z"
  },
  "company": {
    "name": "Mastercard",
    "link": "https://www.linkedin.com/company/mastercard"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}