{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Financial Services",
    "description": "Job Summary:\nDo you want to be part of a team that creates magic for millions of guests? Behind the scenes, the Retail Technology Operations team helps provide magical digital and physical experiences applying the latest technology; and our Site Reliability Engineers provide expert engineering services in the cloud, automation, and reliability to support the innovation and operation of The Walt Disney Company. We are passionate about ensuring our systems provide the best guest experience! You will protect and improve the automation and systems that run Disney's experiences and services with a focus on availability, latency, and automation while embracing a DevOps culture.\nYou will report to Senior Manager-Technology\nResponsibilities:\nThe Site Reliability Engineering Team within the Retail Technology Operations focuses on improving our services and systems availability and performance. This is done through driving observability around our services, designing and implementing tooling and automation and working with our business and development teams to bring data-driven solutions. As a Senior Site Reliability Engineer, you will create automation for our services, expanding observability of the environment, participating in infrastructure design discussions, working with teams to implement complete solutions and resolving issues across environments.\nRequired Education\n808309BR",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T12:47:03.000Z"
  },
  "company": {
    "name": "The Walt Disney Company",
    "link": "https://www.linkedin.com/company/the-walt-disney-company"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": "USD",
    "min_value": 81000,
    "max_value": 117000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Orlando",
    "region": "FL",
    "postal_code": "32889",
    "street_address": null,
    "latitude": 28.53833,
    "longitude": -81.378876
  }
}