{
  "job": {
    "title": "Sr. Software Engineer, Observability",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "The Monitoring Infrastructure team in the Observability & Performance group at Slack develops platforms and tools which produce telemetry, provide insights, and improves observability in Slack production services with a focus on performance and reliability. We develop management tools for distributed applications and infrastructure, maintain datasets for performance and system analytics, and build interfaces and backend systems to answer questions and infer behavioral patterns about our users and systems. Our toolset is varied, we work with open-source observability/monitoring technologies like Elasticsearch and Prometheus, or cloud providers such as AWS, and develop software using a combination of Go, Python, or Java.\nAs part of the Monitoring Infrastructure team, you will be focused on our log pipelines and work closely with other teams in engineering, product development, and customer experience to provide valuable insights to drive decisions and ensure a positive user experience for our Slack customers. You will also help build and maintain distributed services in an environment that processes millions of data points per second with the ability to self-heal and scale up or down to meet demand. We are an inclusive team with deep empathy for our colleagues and customers.\nYou can see the team at work here at Monitorama 2018.\nSlack has a positive, diverse, and supportive culture—we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking, and, above all, collaborative. If this sounds like a good fit for you, why not say hello?\nThis is a remote senior engineering position based in the United States or Canada.\nThe base pay range targeted for this role is $145,833-$\"\",R[0]C[-4]*1.4,\"\")'>204,167. This base pay range is for illustrative purposes only. This position is eligible for additional compensation and benefits including: incentive compensation; health benefits; flexible spending account; retirement benefits; life insurance; commuter benefits; paid time off (including PTO, emergency time off, paid sick leave, medical leave, volunteer time off, civic duty leave, bereavement leave, floating holidays and paid holidays); parental leave and benefits; mobile phone and internet allowance; perks stipend; and other employee perks and benefits.\nThe actual offer, reflecting the total compensation package and benefits, will be at the company’s sole discretion, and determined by a myriad of factors including, but not limited to, years of experience, depth of experience, and other relevant business considerations. The company also reserves the right to amend or modify employee perks and benefits at any time.\nSlack has transformed business communication. It’s the leading channel-based messaging platform, used by millions to align their teams, unify their systems, and drive their businesses forward. Only Slack offers a secure, enterprise-grade environment that can scale with the largest companies in the world. It is a new layer of the business technology stack where people can work together more effectively, connect all their other software tools and services, and find the information they need to do their best work. Slack is where work happens.\nEnsuring a diverse and inclusive workplace where we learn from each other is core to Slack’s values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a pleasant and supportive place to work.\nCome do the best work of your life here at Slack.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:37:02.000Z"
  },
  "company": {
    "name": "Slack",
    "link": "https://www.linkedin.com/company/tiny-spec-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Sr."
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Denver",
    "region": "CO",
    "postal_code": "80247",
    "street_address": null,
    "latitude": 39.738453,
    "longitude": -104.984856
  }
}