{
  "job": {
    "title": "Customer Success Manager, Emerging",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Procore is looking for\nto join our expanding Emerging team. In this role, you’ll create Procore experts and evangelists throughout our client's journey, from implementation to renewal. You’ll focus on ensuring Procore's clients are well supported, educated, and fully adopted on our platform.\nAs a\nyou’re solely responsible for post-sales implementation success and long term adoption of a shared book of business. You’ll work with Emerging/SMB clients to plan roll-out strategies, execute the implementation and onboarding of new accounts while maintaining and growing existing customer relationships. You’ll develop multiple new accounts at a time, manage client training, and create business processes. The role requires a deep understanding of Procore’s vertical and is a balance of independent work within a highly collaborative team.\nThis position will report to the Manager of Customer Success and is based in our Austin, TX office\nWe’re looking for candidates to join us immediately!\nTech industry sophomores looking for a new challenge:\nConstruction pros looking to transition into a fast-paced software company:\nProcore Technologies is building the software that builds the world. We provide cloud-based construction management software that helps clients more efficiently build skyscrapers, hospitals, housing complexes, and more. Our headquarters is located on the bluffs above the Pacific Ocean in Carpinteria, CA, with growing offices worldwide. Check us out on Glassdoor to see what others are saying about working at Procore!\nWe are an equal opportunity employer and welcome builders of all backgrounds. We thrive in a diverse, dynamic and inclusive environment. We do not tolerate discrimination against employees on the basis of age, color, disability, gender, gender identity or expression, marital status, national origin, political affiliation, race, religion, sexual orientation, veteran status, or any other classification protected by law.\nYou are a person with dreams, goals, and ambitions—both personally and professionally. That's why we believe in providing benefits that not only match our Procore values (Openness, Optimism, and Ownership) but enhance the lives of our team members. Here are just a few of our benefit offerings: competitive health care plans, flexible paid time off (Procore Values Time), employee enrichment and development programs, and volunteer days.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:36:03.000Z"
  },
  "company": {
    "name": "Procore Technologies",
    "link": "https://www.linkedin.com/company/procore-technologies"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": "Manager"
  },
  "salary": {
    "currency": "USD",
    "min_value": 52000,
    "max_value": 97200,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}