{
  "job": {
    "title": "Data Analyst Intern - Summer 2022",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "West Creek 2 (12072), United States of America, Richmond, Virginia\nData Analyst Intern - Summer 2022\nIn our 25 years as a founder-led public company, Capital One has grown from a small, credit card start-up that pioneered the use of predictive modeling into one of the largest, fastest-growing, and most dynamic financial technology companies. At Capital One, we believe our success is fueled by data-driven insights, deep customer understanding, and innovative business strategy. We’ve helped transform cities and communities by attracting incredibly talented associates with the audacity to think they can change the world and the humility to understand they need a whole lot of help to make it happen.\nIf you’re interested in Capital One and an internship that enables you to build a strong foundation by focusing on deep analytical challenges and business strategy, then the Analyst Intern Program (AIP) is a great place to begin your career journey.\nAs a Data Analyst Intern in the AIP, you will:\nOur Data Analyst interns are involved with some of Capital One’s most critical business decisions and work with the best and brightest in a collaborative, team-oriented environment. As a Data Analyst intern, your goal is to solve complex data problems that enable insights into customer behavior and operational performance. With the explosion of data that’s available for making business decisions, you’ll find yourself in a critical role at the intersection of business strategy and technology. To succeed requires rigorous logical thinking, adaptability, and exceptional teamwork. Excel in the Analyst Internship Program, and you’ll see what it takes to build an immensely rewarding career with Capital One. Interns are a full-fledged member of the team—engaged from day one through structured training, a diverse set of experiences, a network of peers across the company, and leadership opportunities. The program is designed to provide exposure to real, complex operational projects, executive speakers, team building activities, and associate presentations and discussions.\nJob Category - Analytics, Product Innovators",
    "employment_type": "INTERN",
    "date_posted": "2021-08-03T03:41:42.000Z"
  },
  "company": {
    "name": "Capital One",
    "link": "https://www.linkedin.com/company/capital-one"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 70200,
    "max_value": 131000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "McLean",
    "region": "VA",
    "postal_code": "22101",
    "street_address": null,
    "latitude": 38.93759,
    "longitude": -77.18378
  }
}