{
  "job": {
    "title": "Senior Software Engineer - Embedded",
    "industry": "Defense &amp; Space",
    "description": "If you are a Senior Software Engineer with embedded experience, please read on!\nTop Reasons to Work with Us\nFor nearly 50 years, we have served an integral role in supporting the advancement of the aerospace and defense industries.\nWe are a pioneer and world leader in high-reliability data communications and control technology.\nTo be frank, we are one of the most exciting, promising Aerospace and Defense companies in North America.\nWhat You Will Be Doing\nWhat You Need for this Position\nSo, if you are a Senior Software Enginner with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nJackson.Hufferd@CyberCoders.com\nJackson Hufferd - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T17:41:34.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Bohemia",
    "region": "NY",
    "postal_code": "13856",
    "street_address": null,
    "latitude": 40.77008,
    "longitude": -73.10391
  }
}