{
  "job": {
    "title": "Senior Full-Stack Software Engineer - Java OR Ruby",
    "industry": "Accounting",
    "description": "If you are a\nwith experience, please read on!\nThis is a\n!\nWe are a niche FinTech that is growing and continually transforming our industry! We are looking for a Senior Full-Stack Software Engineer to join our team! We are looking for someone steeped in either Java or Ruby who loves the FinTech world and is all about rolling up their sleeves and wearing many hats!\nWhat You Will Be Doing\nWhat You Need for this Position\nWhat's In It for You\nWe offer a compensation package of base, bonus and equity in a collaborative environment with great leadership!\nSo, if you are a Senior Full-Stack Software Engineer with experience, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRhona.Kannon@CyberCoders.com\nRhona Kannon - Principal Director - CyberCoders\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:03:52.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": "Senior"
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "Blue Ash",
    "region": "OH",
    "postal_code": "43334",
    "street_address": null,
    "latitude": 39.231274,
    "longitude": -84.377045
  }
}