{
  "job": {
    "title": "Software Engineer",
    "industry": "",
    "description": "Job Description:  Orchestrade is looking for a software engineer with strong technical skills to join our development team. The Orchestrade development team continually extends our leading trading, risk and operations solution to cover new business cases, new financial products, new analytics as well as meeting the challenges of the continuous evolution of capital markets for sell-side top-tier banks and buy-side hedge funds and asset managers. Job Site:  • San Mateo, California Responsibilities:  • Contribute to the design of new services. • Develop software that is high-performance, scalable, and robust. • Work closely with the Product team to define and understand end-user requirements and translate them into pragmatic technical solutions. • Contribute to and improve our engineering standards, tooling, and processes. • Participate in developing automated tests coverage. Minimum Requirements:  • BS/MS degree in Computer Science or other related fields. • Ability to solve complex issues and strong analytical skills. • Experience with object-oriented programming languages. C# is a plus. • Ability to work well with remote teams. • Proficient in English. • Positive attitude and mindset. Why Choose Orchestrade:  • Work with latest technologies and worldwide biggest financial institutions. • International team. • Passion to see what is under the hood and master the frameworks used. • Dedicated time to continuous learning. • Eager to improve your knowledge on financial markets and on the latest technologies.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T22:11:25.000Z"
  },
  "company": {
    "name": "Orchestrade Financial Systems",
    "link": "https://www.linkedin.com/company/orchestrade-financial-systems"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco Bay Area",
    "region": null,
    "postal_code": "94112",
    "street_address": null,
    "latitude": 37.39271,
    "longitude": -122.042
  }
}