{
  "job": {
    "title": "Machine Learning Infrastructure Engineer",
    "industry": "Consumer Electronics",
    "description": "Apple is looking for Machine Learning/Deep Learning infrastructure engineers to develop infrastructure for various ML/DL applications. Your work will enable researchers and engineers to build production ML/DL models at scale. Join Apple and help us leave the world better than we found it!\nWHAT YOU’LL DO\n-  Develop highly scalable and reliable machine learning infrastructure that can perform model training and evaluation on a massive scale.\n-  Build vital tools and infrastructure to monitor and understand the performance of complex systems.\n-  Support the team to deploy models in a mission critical environment.\nStrong background in building scalable and fault-tolerant distributed systems. Ideal candidates have past experience in building applications such as data pipelines, data caching/storage systems, and/or RPC services.\nStrong programming background, with extensive experience in Python. Experience with C++ is a plus.\nFamiliarities with gRPC, ML model deployments, Ray, Spark, full-stack web developments are a plus.\nPrevious experience with developing machine learning infrastructure or experience in using GPUs is a plus.\nYou’ll join a phenomenal team of hardworking engineers and researchers with deep experience in robotics, machine learning, and software engineering. We hope you’re excited about the values that drive us:\n-  Passion for the mission: We’re here to make something great. We take on whatever work is right for the product and strive for the best possible results.\n-  Modesty: The right answer is more important than being right. We search for solutions as a team and value clear-eyed feedback.\n-  Lean habits: You can’t grow without limits. Time constraints and big goals encourage us to sharpen our focus and learn to make great decisions.\nBachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience.\nRole Number: 200174899",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T17:16:34.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": null,
    "seniority_level": null
  },
  "salary": {
    "currency": "USD",
    "min_value": 135000,
    "max_value": 206000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}