{
  "job": {
    "title": "Technical Marketing Engineer - Data Center, Network Architect",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Technical Marketing Engineer with experience with networking technologies, please read on!\nRecognized as one of Americas' fastest-growing companies in 2021, we help clients simplify their technical operations by introducing network automation and distributing data. We allow our clients to gain more visibility across their entire network which enables them to cut costs and leverage open networking hardware.\nWe are looking for a talented Network Engineer who is strong at solving complex challenges. This person should have an expert-level understanding of Data Center networking. Experience with virtualization platforms would be a great skill.\nWhat You Will Be Doing\nWhat You Need for this Position\nAt least 10+ years of experience and knowledge of:\nSo, if you are a Technical Marketing Engineer with experience in Data Center networking, please apply today!\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nIan.Henderson@Optello.com\nIan Henderson - Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:25:45.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": null
  },
  "salary": {
    "currency": null,
    "min_value": null,
    "max_value": null,
    "unit": null
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}